[
    {
        "country": "Albania",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/al.svg?v=3ab625b3644e93ad6ff329cc3dbd33b72fa5b3c7&amp;cluster=4",
        "iso_alpha2": "al",
        "report1": "Albania has lifted its flight restrictions.",
        "report2": "<b id=-entryRestrictions->Entry restrictions</b><p>Albaniaxc2xa0has lifted restrictions on commercial flights.Albaniaxc2xa0has lifted restrictions on commercial flights.Health screenings may be in place at ports of entry."
    },
    {
        "country": "Algeria",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/dz.svg?v=ee31f5bc8b2be961a9a78eb20a74cadd21546908&amp;cluster=4",
        "iso_alpha2": "dz",
        "report1": "Algeria has closed its borders.",
        "report2": "<b id=-entryRestrictions->Entry restrictions</b><p>Algeria has closed its borders until further notice. Entry is limited to nationals returning on repatriation flights from abroad, and foreign nationals with diplomatic/residency visas.Algeria has closed its borders until further notice. Entry is limited to nationals returning on repatriation flights from abroad, and foreign nationals with diplomatic/residency visas.Those who are eligible for entry will need to self-isolate for 14 days after arrival."
    },
    {
        "country": "American Samoa",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/as.svg?v=857fc2e197da0a7c14886d538ec6ab2fe71f1e14&amp;cluster=4",
        "iso_alpha2": "as",
        "report1": "American Samoa has restricted the entry of all travelers who are not residents or US nationals.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>american samoa has suspended issuing entry permits.rnrnresidents of american samoa with a residence permit or an immigration board approval may still enter the territory, as may us nationals.American Samoa has suspended issuing entry permits.rnrnResidents of American Samoa with a residence permit or an Immigration Board approval may still enter the territory, as may US nationals.passengers arriving from samoa must obtain a health clearance from the ministry of health (moh) 3 days prior to arrival and present a completed xe2x80x9cdot travel declaration formxe2x80x9dxe2x80x9d upon arrival.rnrnpassengers arriving from hawaii who have transited or have been in countries affected by  () must spend 14 days in hawaii and obtain a health clearance 3 days before arrival in american samoa. they must also present a completed xe2x80x9cdot travel declaration formxe2x80x9d and provide their itinerary upon arrival.Travelers who transited or have been in Arizona, California, Florida, Georgia, Hawaii, Illinois, Massachusetts, New Hampshire, New York, North Carolina, Oregon, Rhode Island, Texas, Washington, or Wisconsin are subject to a Public Health screening and might be medically or home quarantined upon arrival."
    },
    {
        "country": "Angola",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/ao.svg?v=419ad2613232dfe169673934db652bc9d25fa146&amp;cluster=4",
        "iso_alpha2": "ao",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>angola has restricted the entry of most travelers except for for angolan nationals and residents.Angola has restricted the entry of most travelers except for for Angolan nationals and residents.Exceptions are made for medical evacuations, movement of essential goods and services, for a small number of humanitarian flights, for the entry and exit of essential workers and the transportation of sick patients.travelers must have a medical certificate with a negative  pcr test result issued within 72 hours prior to arrival.travelers must complete a <a href=-https://www.19.gov.ao/->-travel registration form (frv)-</a> within 72 hours prior to departure.Travelers are subject to a 7-day quarantine. Returning residents are allowed to quarantine in their own residence. Non-resident essential travelers/workers have to quarantine in a government or government-approved facility.Airline crew are subject to self-isolation until their next flight.Expired residency permits, student visas, investor visas and temporary stay visas issued by Angola are accepted for entry until December 31."
    },
    {
        "country": "Anguilla",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/ai.svg?v=78733f4a03bcc851a16c0f577a35631669721130&amp;cluster=4",
        "iso_alpha2": "ai",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>wallis and futuna have restricted the entry of all foreign travelers except those with prior approval.rnrnonly travelers who can prove that entry is for urgent family/work reasons will be allowed to will be expected to fill in a travel certificate (available <a href=-https://www.interieur.gouv.fr/actualites/l-actu-du-ministere/attestation-de-deplacement-et-de-voyage->here</a>) and provide proof. all travelers over the age of 11 must show a negative testing result for  within 72 hours before departure for wallis &amp; futuna.rnrnwallis and futuna have restricted the entry of all foreign travelers except those with prior approval.rnrnonly travelers who can prove that entry is for urgent family/work reasons will be allowed to will be expected to fill in a travel certificate (available <a href=-https://www.interieur.gouv.fr/actualites/l-actu-du-ministere/attestation-de-deplacement-et-de-voyage->here</a>) and provide proof. all travelers over the age of 11 must show a negative testing result for  within 72 hours before departure for wallis &amp; futuna.rnrntravelers must also provide a self-certified document affirming that they have no  symptoms and that to their knowledge they have not been in contact with any person confirmed positive within the last 14 days.<b id=-entryrestrictions->entry restrictions</b><p>anguilla's airport is currently closed to regular traffic. however, anguilla is accepting approved visitors through an online application process.Anguilla's airport is currently closed to regular traffic. However, Anguilla is accepting approved visitors through an online application process.All travelers to Anguilla including returning residents are required to obtain pre-travel authorization. Persons without travel authorization may be refused entry to Anguilla. All visitors must complete an individual application (including children).Travelers must complete a <a href=-https://ivisitanguilla.com/escape/apply.html->Visitor Application Form</a>.travelers must have a medical certificate with a negative  pcr test issued within 3-5 days prior to arrival.travelers are required to provide health insurance which covers  medical cost.Travelers are subject to regular health monitoring and a 10-day quarantine at their approved location.travelers are subject to a  pcr test upon arrival and 10 days after their entry."
    },
    {
        "country": "Argentina",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/ar.svg?v=212734ce6562b218f9258c5126b79ebb66004746&amp;cluster=4",
        "iso_alpha2": "ar",
        "report1": "Argentina has restricted entry to most foreign travelers, except for nationals and residents, and repatriation, medical, humanitarian flights and tourist from neighboring countries.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>argentina has restricted entry to most foreign travelers, except for nationals and residents, and repatriation, medical, and humanitarian flights.Argentina has restricted entry to most foreign travelers, except for nationals and residents, and repatriation, medical, and humanitarian flights.Argentina suspended international passenger flights from the pandemic -affected areas- (Europe, the US, South Korea, Japan, China, and Iran) until at least November 8.With effect from October 30, nationals and residents of Bolivia, Brazil, Chile, Paraguay and Uruguay can enter Argentina to visit the Metropolitan Area of Buenos Aires for tourism purposes. Entry will only be allowed through the Port of Buenos Aires (Buquebus Terminal) and through Ezeiza International Airport in the Province of Buenos Aires. Traveling to other provinces is not allowed yet.Airlines operating repatriation flights must send all passenger information to ANAC 12 hours before departure. This information must contain the passenger list with travel document numbers, phone numbers, and addresses where each person declares that they will comply with the mandatory quarantine upon arrival.Passengers must complete a <a href=-http://ddjj.migraciones.gob.ar/app/->-Declaracixc3xb3n Jurada Electrxc3xb3nica para el ingreso al Territorio Nacional-</a>.nationals and residents of bolivia, brazil, chile, paraguay and uruguay must have a medical certificate with a negative  pcr test result issued within 72 hours prior to arrival and a medical insurance with coverage of  treatment cost.starting on december 15, all travelers arriving in buenos aires city via ezeiza airport may be subject to  testing in lieu of quarantine.Nationals and residents of Argentina are subject to a 14-day quarantine."
    },
    {
        "country": "Armenia",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/am.svg?v=9c786eb053ddb834dd8803f3d99e53b7a54164f7&amp;cluster=4",
        "iso_alpha2": "am",
        "report1": "Travelers are subject 14-day self-isolation and/or undertake a PCR test upon arrival.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>restrictions on entry of non-armenian citizens to the republic of armenia have been lifted.rnRestrictions on entry of non-Armenian citizens to the Republic of Armenia have been lifted.rntravelers entering armenia are asked to present a medical certificate with a negative  pcr test result issued within 72 hours prior to arrival or submit to a pcr test at the airport. travelers who choose to take a pcr test at their own expense and receive a negative result may be exempted from self-quarantine requirements. testing is available at airports for individuals who opt to take on upon arrival. the test costs approximately usd 40 and the result xe2x80x93 provided in english xe2x80x93 are usually available within 24 hours.rnTravelers are subject to a 14-day self-isolation and/or PCR testing upon arrival.Exceptions to this rule are made for plane crew members arriving in the Republic of Armenia in order to organize pilotsxe2x80x99 rest, drivers of interstate freight transport, as well as for freight train drivers who are isolated until the next departure. Train drivers and the personnel in attendance are isolated between two consecutive shifts."
    },
    {
        "country": "Aruba",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/aw.svg?v=a89edacb209a44fd274f96e384be2a4fc15d52b8&amp;cluster=4",
        "iso_alpha2": "aw",
        "report1": "Aruba has opened its borders to travelers from Europe, Canada, the United States and most Caribbean nations."
    },
    {
        "country": "Australia",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/au.svg?v=ae2e0b8c4a7d5ea410291c5456cad87e22d83502&amp;cluster=4",
        "iso_alpha2": "au",
        "report1": "Australia has restricted the entry of all foreign nationals except New Zealand nationals who reside in Australia, and nationals of other Oceania countries who are transiting through to their home countries.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>australia has restricted the entry of all travelers, with the exception of australian nationals and permanent residents and their immediate family members, new zealand nationals residing in australia, diplomats accredited to australia and residing in australia and their immediate family members, and airline crew.Australia has restricted the entry of all travelers, with the exception of Australian nationals and permanent residents and their immediate family members, New Zealand nationals residing in Australia, diplomats accredited to Australia and residing in Australia and their immediate family members, and airline crew.australia has enacted temporary travel restrictions for flights to melbourne due to a recent increase in  cases.travelers who are not australian citizens and returning permanent residents and their immediate family members need to <a href=-https://immi.homeaffairs.gov.au/help-support/departmental-forms/online-forms/19-enquiry-form->apply for an exemption</a> to enter australia.All international travelers are required to quarantine for 14 days at the first point of entry, unless they're granted an exemption upon request. Quarantines take place in state-designated facilities and fees depend on the state, ranging from $2500 for one adult in the Northern Territory to $3000 for one adult in New South Wales. International flights are currently being diverted away from Victoria. Airline crew are subject to self-isolation until their next scheduled flight.For more information on quarantine rules in the Australian states, check the following websites:<a href=-https://www.nsw.gov.au//what-you-can-and-cant-do-under-rules/quarantine->new south wales</a>,rn<a href=-https://.nt.gov.au/stay-safe/quarantine/quarantine-fee->the northern territory</a>, rn<a government=-- href=-https://www.qld.gov.au/health/conditions/health-alerts/-/protect-yourself-others/quarantine&gt;queensland&lt;/a&gt;rn&lt;a href=- https:=-- paying-hotel-quarantine-wa-frequently-asked-questions-=-- publications=-- www.wa.gov.au=-->western australia</a>.Foreign nationals may transit through Australia if the connecting flight is within 72 hours of the arriving flight. They must either have a transit visa or be nationals of a visa-exempt country.transit passengers donxe2x80x99t need to apply for an exemption to travel restrictions if they are booked to depart on a connecting flight from the same airport within 72 hours and they are not going to leave the airport. travelers who plan to leave the airport before boarding their connecting flight or who will be at the airport for longer than 72 hours need to apply for a travel exemption <a href=-https://immi.homeaffairs.gov.au/help-support/departmental-forms/online-forms/19-enquiry-form->here</a> and will be subject to quarantine until their departing flight. travelers from new zealand and pacific islanders may not need a travel exemption. more information on transiting australia is available <a href=-https://19.homeaffairs.gov.au/transiting-australia->here</a>.Travelers planning to travel across Australian state borders should note that some Australian states also have domestic travel restrictions, border restrictions, and quarantine requirements in place. In the case of onward travel within Australia, travelers are advised to check in advance with their travel/accommodation provider."
    },
    {
        "country": "Austria",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/at.svg?v=f60e3e97df368f884aba280f1eac0becc83fb4b7&amp;cluster=4",
        "iso_alpha2": "at",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>austria has opened its borders to travelers arriving from the schengen area, the uk, or from andorra, monaco, san marino, and the vatican. however, travel from outside of the eea remains restricted for travelers who are not nationals of an eu/schengen/ country or the uk, and flights remain suspended from certain areas.Austria has opened its borders to travelers arriving from the Schengen Area, the UK, or from Andorra, Monaco, San Marino, and the Vatican. However, travel from outside of the EEA remains restricted for travelers who are not nationals of an EU/Schengen/ country or the UK, and flights remain suspended from certain areas.Austrian nationals, permanent residents, D-visa holders, and EEA nationals and their immediate family members may still enter Austria. Diplomats, humanitarian aid workers, people traveling on business, healthcare professionals, and members of emergency/rescue/ambulance crews may also enter the country, and travelers with an immediate connecting flight may transit through the country.for travelers who may enter the country, the austrian government has created a <a href=-https://www.bmeia.gv.at/reise-aufenthalt/reisewarnungen/->list of areas</a> which it considers to be at elevated risk for . anyone traveling to austria from one of these areas in the last 10 days must be able to present at the border a medical certificate with a negative  test result issued within 72 hours prior to arrival. without this document, entry will be refused for anyone without a valid austrian residence permit. rnrnaustrian residents without a valid medical certificate may enter the country, but will be required to self-isolate for 10 days.  tests, which provide the medical certificate, are available for xe2x82xac120 per test on arrival at vienna and salzburg airports for travelers with a valid austrian residence permit. travelers can present a negative test result to shorten the self-isolation period.Travelers transiting through Austria without medical certificate are permitted if they can show proof that they are just transiting."
    },
    {
        "country": "Azerbaijan",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/az.svg?v=adae617035abcbf836c5ac1386dec2052f38a40b&amp;cluster=4",
        "iso_alpha2": "az",
        "report1": "Azerbaijan has extended the suspension of all commercial flights, except for special, private, and charter flights.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>azerbaijan has extended the suspension of all commercial flights, except for special, private, and charter flights. issuance of e-visas and visa on arrival has been suspended.rnrnAzerbaijan has extended the suspension of all commercial flights, except for special, private, and charter flights. Issuance of e-visas and visa on arrival has been suspended.rnrnall travelers arriving in azerbaijan must present a negative  test. the test itself can be taken more than 48 hours before your flight but the certificate showing the negative test result will only be accepted if issued within 48 hours before the flight. travelers will be tested again for  and have their temperature checked on arrival into azerbaijan. individuals are responsible for the entire cost of  tests carried out at the airport.rnAll arrivals to Azerbaijan are required to complete a 14-day self-quarantine in their own accommodation, regardless of travel origin.rnthe use of a medical mask will be required at all times at the airport and on the flight. it is mandatory to keep the mask on at all times except for specific requirements; for example, at border control, at the request of an airport official, or while eating.rnrnhand luggage will not be allowed on flights coming to azerbaijan apart from smaller personal items such as a handbag or brief case. check with your airline for the latest hand-luggage allowances and rules introduced to combat  onboard your flight.rn"
    },
    {
        "country": "Bahrain",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/bh.svg?v=6cfd551de9353bb7e67ce9887f3eb17863623cac&amp;cluster=4",
        "iso_alpha2": "bh",
        "report1": "Bahrain has restricted the entry of all travelers except for nationals, residents, military personnel, and travelers with a valid letter of Prior Permission Granted (PPG).",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>bahrain has restricted the entry of all travelers except for nationals, residents, military personnel of bahrain, and travelers with a valid letter of prior permission granted (ppg), which must be presented prior to boarding.rnBahrain has restricted the entry of all travelers except for nationals, residents, military personnel of Bahrain, and travelers with a valid letter of Prior Permission Granted (PPG), which must be presented prior to boarding.rnall arrivals into bahrain will be subject to  testing at their own expense. these tests may cost more than 30 bhd ($80), and travelers may be required to take two tests, which would double the cost to the passenger. rnrnstarting from july 22, passengers must pay the fees related to the tests and quarantine before their departure at <a href=-http://bh.bh/beaware->http://bh.bh/beaware</a>, or via the self-service payment kiosk at the airport.rnThose without symptoms after being tested will be required to self-isolate for 10 days on arrival, while those with symptoms will be subject to further quarantine measures.rnAdditionally all arrivals who have visited or transited Iran, Iraq and Lebanon within 14 days prior to their arrival in Bahrain will be subject to enhanced testing procedures and quarantine at Government facilities.rnrnBorder crossing from Saudi Arabia on the causeway has been suspended, but is now open for Saudi citizens arriving at BAH to travel to Saudi (one-way).Visas on arrival have been suspended except for diplomats or travelers with UN passports. Anyone attempting to enter Bahrain must have a Bahrain residence permit or secure a visa in advance by visiting www.evisa.gov.bh.rn"
    },
    {
        "country": "Bangladesh",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/bd.svg?v=73b918a15f2f495cf7ec65b23342d0d567360fc2&amp;cluster=4",
        "iso_alpha2": "bd",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>bangladesh has suspended flights from bhutan, hong kong, india, kuwait, nepal and thailand.Bangladesh has suspended flights from Bhutan, Hong Kong, India, Kuwait, Nepal and Thailand.Flights from Bahrain, China, Malaysia, the Maldives, Oman, Qatar, Saudi Arabia, Sri Lanka, Singapore, Turkey, UAE and the UK are permitted to operate; however, effective from August 1, the Civil Aviation Authority of Bangladesh has restricted the number of passengers on flights to and from Bangladesh to 260 on aircrafts with two aisles and 140 on one-aisle aircrafts.rntravelers with pre-arranged visas must have medical certificates issued within 72 hours before departure stating that they are not affected by  (). the certificates must be in english or translated into english.business travelers with a return/onward ticket may enter bangladesh, provided they have a confirmation letter issued by the bangladesh board of investment (boi). the letter must contain a boi registration number, and the accredited inviting organization must have notified the immigration authorities prior to arrival. business travelers must also present a medical certificate with a negative  test result issued at most 72 hours before arrival.rntravelers with bangladesh origins without symptoms of  will be required to self-isolate in dhaka for 14 days upon arrival. those who exhibit symptoms of  or do not submit the above medical certificate will be institutionally quarantined in dhaka for 14 days."
    },
    {
        "country": "Barbados",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/bb.svg?v=257a41538371afbaa34fdef9dd25a728135db81d&amp;cluster=4",
        "iso_alpha2": "bb",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>aruba has opened its borders to travelers from europe, canada, the united states and most caribbean nations.Aruba has opened its borders to travelers from Europe, Canada, the United States and most Caribbean nations.Travelers and residents from Argentina, Belize, Bolivia, Brazil, Chile, Colombia, Costa Rica, Dominican Rep., Ecuador, El Salvador, French Guiana, Guatemala, Guyana, Haiti, Honduras, Mexico, Nicaragua, Panama, Paraguay, Peru, Suriname, Uruguay or Venezuela are not allowed to enter.travelers from us states with a high incidence of  cases will only be allowed entry if they provide proof of a negative test result prior to traveling to aruba; they will not have the option to be tested on arrival. this will apply to residents of the following us states: alabama, arizona, arkansas, california, colorado, florida, georgia, idaho, iowa, kansas, louisiana, mississippi, nevada, north carolina, ohio, oklahoma, oregon, south carolina, south dakota, tennessee, texas, utah, wisconsin, and wyoming.all tourists must fill in the <a href=-https://edcardaruba.aw/?utm_source=visitaruba.com&amp;utm_medium=referral->ed card</a> and purchase <a href=-https://www.visitaruba.com/traveling-to-aruba/entry-requirements-and-visas/aruba-visitors-insurance--travel-insurance/->arubaxe2x80x99s mandatory  insurance</a>, even if they have their own insurance. the cost is flat rate of usd 30 (subject to change). children under the age of 14 will be exempt from the insurance requirement, however will be subject to a one-time administration flat fee of usd 10. they must also submit a self-health declaration form 72 hours prior to travel.travelers must also submit a medical certificate with a negative  pcr test result issued within 72 hours before departure and upload the test at <a href=-https://edcardaruba.aw/->www.edcardaruba.aw</a> within 12 hours before departure.travelers who did not submit a medical certificate with a negative  pcr test result issued within 72 hours before departure will be subject to a mandatory quarantine at their hotel or booked place of stay. the quarantine will be up to 24 hours.<b id=-entryrestrictions->entry restrictions</b><p>barbados has reopened its borders.Barbados has reopened its borders.Specific travelers who have non-standard circumstances that need to be addressed are advised to contact The Ministry of Health and Wellness via cmo@health.gov.bb at least 72 hours prior before travel to have their requests investigated and facilitated. These include: diplomats; persons with a medical condition warranting special consideration (to be certified by the Chief Medical Officer (CMO)); persons with a disability or traveling with persons with disabilities.Travelers must complete an Embarkation/Disembarkation (ED) form online at <a href=-https://travelform.gov.bb/home->https://travelform.gov.bb/home</a> and submit it 24 hours prior to travel.The type of public health measures taken upon your arrival and during your stay will depend on the risk category of the country you're traveling from.persons traveling from very low-risk country, who have not visited a high-risk country in the past 21 days prior to travel, will be exempt from the pretesting requirement. visit <a href=-https://www.visitbarbados.org/-travel-guidelines-2020->barbadostravelprotocols.com</a> for confirmation of country risk category.travelers arriving from low-risk countries are allowed to present a negative  pcr test result taken within 5 days prior to arrival.travelers arriving from medium and high-risk countries must present a negative  pcr test result issued from an accredited or certified laboratory taken within 72 hours prior to arrival to enter the country.travelers under 5 years of age will not be required to have a  pcr test unless they are symptomatic or any member of the travel party has a positive test result. unaccompanied minors will be required to have a valid negative  test result to enter barbados.travelers who have been in, or transited through, a high-risk country who havenxe2x80x99t submitted proof of a negative  pcr test may be denied entry into the country. travelers with a valid negative  pcr test result will be required to remain (with restricted movement) at a designated holding hotel or approved villa at their own expense, or free of charge at a government facility, and monitored daily for the onset of symptoms. they will be required to take a second  pcr test between 4-5 days after the last test accepted by the ministry of health and wellness. they will typically be released once the test result is negative.travelers from medium-risk countries who arrive with a valid negative  pcr test result will be permitted to leave the airport after clearance by immigration, customs and port health officials. they will then be subject to monitoring for seven days and a second  pcr test. they will be required to take a second  pcr test between 4-5 days after the last test accepted by the ministry of health and wellness. they will typically be released once the test result is negative.travelers from low-risk countries who have not visited medium or high-risk countries within 21 days will be allowed to present results of tests taken within 5 days prior to arrival. travelers who arrive with a valid negative  pcr test result will be permitted to leave the airport after clearance by immigration, customs and port health officials. travelers who arrive without a negative  pcr test, will be required to take one upon arrival.travelers from very low-risk countries who have not visited low, medium or high-risk countries within 21 days are not required to take a  pcr test prior to, or on arrival. these travelers will be permitted to leave the airport after clearance by immigration, customs and port health officials.travelers tested positive for  while in barbados may request from the ministry of health and wellness the option to self-isolate at their hotel or villa at their own expense or in a government-approved facility.travelers may only transit in barbados if they have a negative  test prior to arriving. masks must be worn at all time in the airport, and travelers will be subject to a health assessment and temperature check.All travelers must wear face masks when traveling to/from Barbados."
    },
    {
        "country": "Belgium",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/be.svg?v=d6b8358797d58fa2e77e639c787cf5fd9cbc2cf6&amp;cluster=4",
        "iso_alpha2": "be",
        "report1": "Belgium has restricted the entry of all travelers who are not arriving from EEA countries, Switzerland, or the United Kingdom. Nationals of Belgium or those same countries may still enter, but may be required to quarantine.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>belgium has restricted the entry of all travelers who are not arriving from eea member states, switzerland or the united kingdom.rnnationals, permanent residents, and long-term visa holders of eea member states, switzerland, and the united kingdom, and their family members may still enter belgium from outside of those countries, but will bexc2xa0required to self-isolate for 14 days on arrival.Belgium has restricted the entry of all travelers who are not arriving from EEA Member States, Switzerland or the United Kingdom.rnNationals, permanent residents, and long-term visa holders of EEA Member States, Switzerland, and the United Kingdom, and their family members may still enter Belgium from outside of those countries, but will bexc2xa0required to self-isolate for 14 days on arrival.Travelers arriving from Australia, Japan, South Korea, New Zealand, Rwanda, Singapore, Thailand or Uruguay are also allowed to enter Belgium.Diplomats, humanitarian aid workers, and military personnel may enter the country.rnNationals of Andorra, Monaco, Montenegro, North Macedonia, San Marino, Serbia and Vatican City may enter Belgium with proof of connection travel to their home country.Travelers entering Belgium from outside the Schengen area or any high risk area must present a completed Health Declaration Form upon arrival. The form can be found <a href=-https://dofi.ibz.be/sites/dvzoe/FR/Documents/BELGIUM_PassengerLocatorForm.PDF->here</a>.belgium has created a 'traffic light' system to track countries and regions which are experiencing high incidence rates of . travelers from -red zones- will be required to self-isolate for 14 days on arrival in belgium, while those entering belgium from -orange- regions are asked to be vigilant. the updated list of regions can be found on <a href=-https://diplomatie.belgium.be/fr->this site</a> (in french)."
    },
    {
        "country": "Bosnia and Herzegovina",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/ba.svg?v=1d47bc8d0663827dbb2620feaeed0af861148dad&amp;cluster=4",
        "iso_alpha2": "ba",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>bosnia and herzegovina has resumed commercial flights.Bosnia and Herzegovina has resumed commercial flights.travelers must have a medical certificate with a negative  pcr test result issued within 48 hours prior to arrival with the exception of nationals of bosnia and herzegovina and their spouses and children, nationals of croatia, montenegro and serbia arriving directly from the country of nationality, diplomats, eufor/nato staff, freight drivers and crew, and foreigners in transit to their country of residence.Transit through Bosnia and Herzegovina is possible without the need for a negative test result.Check <a href=-http://www.granpol.gov.ba/?lang=en->here<a></a> for more information.</a>"
    },
    {
        "country": "Brazil",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/br.svg?v=f3f8868df9e9326fdb1fce24682a037e915d5eaf&amp;cluster=4",
        "iso_alpha2": "br",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>foreign nationals are allowed to enter brazil by air. this is subject to regular entry requirements.Foreign nationals are allowed to enter Brazil by air. This is subject to regular entry requirements.The entry of foreign travelers staying for up to 90 days is currently permitted.brazil has lifted its -related entry regulations.the brazilian government recommends those experiencing  symptoms to self-quarantine for 15 days.Travelers are allowed to freely transit as long as they do not leave the international airport area and have a ticket for onward travel."
    },
    {
        "country": "British Virgin Islands",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/vg.svg?v=233aa7e9017bf37187e8fe7064f33cc46bcddaf1&amp;cluster=4",
        "iso_alpha2": "vg",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>the british virgin islands currently only allow british virgin islanders, belongers, permanent residents, naturalized citizens, and freight and cargo vessels to enter.The British Virgin Islands currently only allow British Virgin Islanders, Belongers, Permanent Residents, naturalized citizens, and freight and cargo vessels to enter.Starting September 1, work permit holders with confirmed employment, work permit exempt holders, students, and other specified groups may enter the territory.Certain special categories of persons will only be allowed in the territory for up to five days. This includes aviation crew, maritime crew, healthcare practitioners/medical staff, emergency maintenance, repair and other technical personnel and other essential specialized workers.travelers must have a medical certificate with a negative  pcr test result issued within 5 days prior to travel.All persons eligible for entry to British Virgin Islands must register in advance through an <a href=-https://bvi.gov.vg/controlled-re-entry-british-virgin-islands->online portal</a>.Starting on December 1, arrivals must submit a <a href=-bvigateway.bviaa.com->BVI Gateway Traveler Authorization Certificate</a> and is projected to be live the week of November 2.travelers will need to quarantine for 14 days in pre-approved accommodation. after the quarantine period, they will be released only after testing negative for . protocols are expected to change on december 1.On day 4, travelers will be required to take another PCR test. Once the result is negative, they will be allowed restricted movement to designated places. These locations are being coordinated by Environmental Health and other Government agencies.A final PCR test will be administered on Day 8 and once this test returns negative, travelers will be able to move within the Territory, without limitation."
    },
    {
        "country": "Bulgaria",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/bg.svg?v=886820f848cbc7372ba40f6640af02080e9c4f61&amp;cluster=4",
        "iso_alpha2": "bg",
        "report1": "Bulgaria has reopened its borders to travelers from most European countries.",
        "report2": "<b id=-entryRestrictions->Entry restrictions</b><p>Bulgaria has restricted the entry of all travelers who are not nationals or family members of nationals of the European Union, the Schengen Agreement States (including San Marino, Andorra, Monaco and Vatican City), or the UK.Bulgaria has restricted the entry of all travelers who are not nationals or family members of nationals of the European Union, the Schengen Agreement States (including San Marino, Andorra, Monaco and Vatican City), or the UK.Nationals of Albania, Australia, Bosnia and Herzegovina, Belarus, Canada, Georgia, Israel, Japan, Kosovo, Kuwait, Moldova, Montenegro, New Zealand, North Macedonia, South Korea, Rwanda, Serbia, Thailand, Tunisia, Turkey, Uruguay, Ukraine and the UAE may also enter the country.Bulgarian nationals and their family members, permanent residents, and long-term residence permit holders may also enter the country, as may long-term residents and family members of EEA/Schengen countries and the UK. Certain other exceptions exist for medical workers, students attending a Bulgarian institution, diplomats, and certain classes of workers essential to the Bulgarian state. For full details on exceptions, check the <a href=-http://www.mh.government.bg/bg/novini/aktualno/->Bulgarian Ministry of Health website</a> (in Bulgarian).A PCR test is not required for nationals arriving in Bulgaria from EU Member States, the UK, and the Schengen countries, as well as from Australia, Canada, Georgia, Japan, Morocco, New Zealand, Rwanda, South Korea, Thailand, Tunisia, Uruguay, Ukraine, and Jordan. Nationals of these countries are not subject to a 14-day quarantine.Nationals of North Macedonia, Serbia, Albania, Kosovo, Bosnia and Herzegovina, Montenegro, Moldova, Israel, and Kuwait can enter Bulgaria with a negative PCR test performed in the last 72 hours. The Bulgarian border authorities must be presented with a document showing a negative result, written in the Latin method (PCR), which contains the names of the person according to the identity document with which he travels, data about the laboratory that performed the test, and the date on which the PCR test was performed.Travelers who fall into one of the above exception categories but whose travel to Bulgaria originates in any other country must present a negative result from a PCR test done up to 72 hours before entering Bulgaria,Travelers who are required to quarantine will not be able to leave Bulgaria before the end date of the 14 day quarantine. Traveling and leaving the premises of the quarantine will be considered a violation.Nationals and long-term residents of the EU, Schengen countries, or the UK and their family members may transit through Bulgaria to their country of residence, and nationals of North Macedonia, Albania, Kosovo, Bosnia and Herzegovina, Moldova, Montenegro, Serbia, or Turkey can transit to return to the country of which they are nationals. Transit is only permitted when the traveler will immediately depart Bulgaria.Bulgarian passports and national ID cards which have expired on or after March 13, 2020 will be considered valid with a prolongation of 6 months."
    },
    {
        "country": "Burkina Faso",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/bf.svg?v=b866fdf251c82b8a4dfa2aaa5877e2e788f7e40e&amp;cluster=4",
        "iso_alpha2": "bf",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>commercial flights to burkina faso have resumed.Commercial flights to Burkina Faso have resumed.travelers must have a medical certificate with a negative  pcr (nasal swab) test issued within 5 days prior to arrival.test other than pcr test are currently not accepted. if a passenger does not arrive with a negative  test, a rapid  test will be performed at the airport, at a cost of 90,000 cfa (approximately 155 us dollars) and the passenger will be detained until results are available.all arriving travelers without a medical certificate with a negative  pcr test result are subject to a 14-day quarantine at a location of their own choice, and at their own cost.daily controls will be carried out by burkina faso authorities, including temperature tests.  tests will be carried out on the 1st, 8th and 14th day following arrival."
    },
    {
        "country": "Cameroon",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/cm.svg?v=4c41accba3fcac3e210606d9fd763ee1516e7bf6&amp;cluster=4",
        "iso_alpha2": "cm",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>cameroon has restricted entry to most travelers, except for nationals and residents of cameroon.Cameroon has restricted entry to most travelers, except for nationals and residents of Cameroon.travelers must have a medical certificate with a negative  pcr test result taken within 72 hours prior to departure from the first embarkation point.Passengers and airline crew are subject to medical screening."
    },
    {
        "country": "Cape Verde",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/cv.svg?v=73efb33a910ab869c1fd9194eaa4de62cc73d881&amp;cluster=4",
        "iso_alpha2": "cv",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>cape verde has resumed commercial flights on october 12.Cape Verde has resumed commercial flights on October 12.travelers must present a negative  rt-pcr nasal swab test issued within 72 hours of departure to gain entry to cabo verde. children under age 7 are exempt from presenting a  rt-pcr nasal swab test result.Travelers will have their temperature checked and must submit a completed <a href=-https://survey123.arcgis.com/share/af3188749dbe4bfe898deca41009a72c->health surveillance form</a> upon arrival."
    },
    {
        "country": "Caribbean Netherlands",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/bq.svg?v=7eba228b2af6aa0ad217b1e5a189697dd5f06ae4&amp;cluster=4",
        "iso_alpha2": "bq",
        "report1": "Bonaire, Saba, and Sint Eustatius have begun to relax travel restrictions for certain travelers arriving from Aruba, Curaxc3xa7ao, Europe, and the US.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>bonaire:Bonaire:Bonaire has begun to relax its travel restrictions for travelers arriving from certain countries.Travelers are allowed to enter Bonaire after transiting through Curaxc3xa7ao and complying with Curaxc3xa7aoxe2x80x99s entry requirements.Flights to and from Curacao and Aruba have now resumed.Flights to and from Europe resumed on July 1, 2020rnTravelers who have been physically present in the United States within the past 14 days are not allowed to enter Bonaire.Saba:Travelers from Bonaire, Curacao, and Sint Eustatius can travel to Saba without quarantine requirements, but cannot transit via Sint Maarten. Travelers from Europe can travel to Saba only for repatriation of residents, essential workers, medical travelers, and medical students.Travelers from Sint Maarten and the United States (and other countries in North and South America) can travel to Saba only for repatriation of residents, essential workers, medical travelers, and medical students.Sint Eustatius:Travelers from Aruba, Bonaire, Curacao, Saba, and St. Kitts and Nevis can request entry to Sint Eustatius without quarantine restrictions.Travelers from the Netherlands, Belgium, Germany, and France can request entry to Sint Eustatius, but must comply with a home-based quarantine.Travelers who have been physically present in the United States within the past 14 days are not allowed to enter Sint Eustatius, except for legal residents of Sint Eustatius, essential workers, and medical travelers.Travelers from Sint Maarten, the United Kingdom, the Dominican Republic, and most South and Central American countries can request entry to Sint Eustatius, but must comply with a mandatory quarantine in a quarantine facility.rnbonaire:rnrntraveler must present a medical certificate with a negative  pcr test taken within 72 hours prior to arrival and proof of health insurance that covers the traveler overseas.Travelers must complete a <a href=-https://bonairepublichealth.org/en/form->Health Declaration Form</a>.Saba:travelers arriving from sint maarten and the united states (and other countries in north and south america) will be subject to  testing prior to arrivalAll travelers who wish to visit Saba must send an email request to <a href=-info@Sabagov.nl->info@Sabagov.nl</a>.Sint Eustatius:travelers must request specific permission from the sint eustatius government by writing to <a href=-info.19@statiagov.com->info.19@statiagov.com</a> in addition to providing a <a href=-https://www.statiagovernment.com/questionnaire->mandatory questionnaire</a>, a negative  pcr test result, and agreeing to a mandatory quarantine in a quarantine facility.Bonaire:Travelers arriving to Bonaire from a high-risk country are required to quarantine for 14 days in a quarantine facility at their own expense.Testing is provided at no cost for those in isolation/quarantine who entered Bonaire with special permission.Saba:Travelers arriving from Europe will be subject to quarantine upon arrival.Travelers arriving from Sint Maarten and the United States (and other countries in North and South America) will be subject quarantine in a quarantine facility upon arrival.Sint Eustatius:Travelers arriving from Sint Maarten, the United Kingdom, the Dominican Republic, and most South and Central American countries will be subject quarantine in a quarantine facility upon arrival.rn"
    },
    {
        "country": "Chad",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/td.svg?v=310c037fbbfd23bc39b3e5e51b3cb6501ba9f147&amp;cluster=4",
        "iso_alpha2": "td",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>chad reopened its airports.Chad reopened its airports.all travelers must present a medical certificate with a negative  test result issued within 7 days prior to arrival.All travelers planning to stay in Chad for 7 days or more are subject to a 7-day quarantine at their home or place of accommodation and will need to surrender their passports.travelers are subject to undertake a  test on the 7th day of the quarantine period.passports will be returned upon presentation of the  test receipt.Travelers staying in Chad for less than 7 days are not subject to quarantine."
    },
    {
        "country": "Chile",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/cl.svg?v=f159bf4dfefd8973b0b30ff27b9de5b158ea4455&amp;cluster=4",
        "iso_alpha2": "cl",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>chile has reopened its airport, non-resident foreigners will be allowed to enter chile through santiago airport.rnChile has reopened its airport, non-resident foreigners will be allowed to enter Chile through Santiago Airport.rnfrom november 23, when santiago airport begins to allow foreign travelers to enter, all travelers (of all ages) will have to present three documents when boarding: <br/>rnrnxe2x80xa2a completed xe2x80x9caffidavit of travelersxe2x80x9d electronic form (available <a href=-https://www.c19.cl/->here</a> and also known as a sanitary passport) prepared less than 48 hours before boarding; <br/>rnxe2x80xa2proof of a negative result from a pcr result from a test taken within 72 hours prior to departure; and <br/>rnxe2x80xa2proof of a health insurance policy that provides coverage for  and related health issues during the travelerxe2x80x99s stay in chile.Non-resident foreigners entering Chile who were in a high-risk country at any time within 14 days prior to their travel to Chile will have to complete a mandatory 14-day self-quarantine upon entering Chile, even with a negative PCR test.Travelers in quarantine who undertake PCR test and receive a negative result within 72 hours do not need to remain in quarantine.After December 7, non-resident foreigners entering Chile with the three documents described above will no longer have to complete a 14-day quarantine. They will instead be subject to a 14-day xe2x80x9cPeriod of Vigilance for Travelers.xe2x80x9d During this period, travelers will have to report daily their location and health condition to the Health Ministry through a system that will be implemented for this purpose. (This platform will be launched in the coming days.)"
    },
    {
        "country": "China",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/cn.svg?v=9b561bf067fb9ce0a162265a87c89b4955858439&amp;cluster=4",
        "iso_alpha2": "cn",
        "report1": "China has restricted the entry of all foreign nationals except Hong Kong, Macau, and Taiwan passport holders.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>china has restricted entry and transit to all travelers except chinese nationals, hong kong, macau, or taiwan passport holders, and travelers with diplomatic, service, courtesy, or c visas, or visas issued after march 28, 2020.China has restricted entry and transit to all travelers except Chinese nationals, Hong Kong, Macau, or Taiwan passport holders, and travelers with diplomatic, service, courtesy, or C visas, or visas issued after March 28, 2020.Foreign nationals with residence permit with the purpose of work, personal matter and reunion can re-enter China. Holders of expired residence permits can apply for a new one.Foreign nationals coming to the mainland of China for necessary economic, trade, scientific or technological activities, or out of emergency humanitarian needs may apply for visas at Chinese embassies or consulates.Foreign nationals must complete a <a href=-http://health.customsapp.com/->-Health Declaration Form-</a> and present upon arrival.chinese nationals arriving from afghanistan, albania, algeria, andorra, angola, armenia, australia, azerbaijan, bahrain, bangladesh, barbados, belarus, benin, bolivia, bosnia and herzegovina, botswana, brunei darussalam, bulgaria, burkina faso, burundi, cambodia, cameroon, central african rep., chad, colombia, republic of the congo, democratic republic of the congo, costa rica, cote d'ivoire, cuba, cyprus, djibouti, dominican republic, ecuador, equatorial guinea, eritrea, estonia, eswatini (swaziland), gabon, gambia, georgia, ghana, grenada, guinea, guinea-bissau, hungary, iran, israel, japan, south korea, kuwait, kyrgyzstan, latvia, lebanon, lesotho, liechtenstein, lithuania, luxembourg, madagascar, malawi, maldives, mali, malta, mauritania, moldova, mongolia, morocco, mozambique, niger, nigeria, north macedonia, oman, palestine, panama, peru, poland, portugal, qatar, romania, rwanda, sao tome and principe, senegal, serbia, sierra leone, singapore, slovakia, slovenia, somalia, south sudan, sri lanka, st. vincent and the grenadines, sudan, suriname, tajikistan, tanzania, timor-leste, togo, tunisia, uganda, ukraine, uruguay, uzbekistan, vietnam or zambia must have a green qr code with a must declare their health status for 14 days in the wechat app -fang yi jian kang ma guo ji ban-. a green qr code generated from the program must be presented before departure. chinese nationals arriving from the following countries will need a  nucleic acid test result issued within 3 days prior to departure to generate this code.foreign nationals arriving from the abovementioned countries must have a health declaration form issued by a chinese embassy or consulate. the form can be obtained with a medical certificate with a negative  () nucleic acid test result issued at most 3 days before departuretravelers arriving from taiwan must have a medical certificate with a negative  nucleic acid test result issued at most 72 hours before departure.travelers arriving from argentina, austria, belgium, brazil, canada, chile, czech republic, denmark, egypt, ethiopia, finland, france, germany, greece, iceland, india, indonesia, iraq, ireland, italy, jamaica, jordan, kazakhstan, kenya, malaysia, mauritius, mexico, namibia, nepal, netherlands, new zealand, norway, pakistan, philippines, russia, saudi arabia, south africa, spain, syria, switzerland, thailand, turkey, uae, uk, us or zimbabwe must have a green qr code with a must declare their health status for 14 days in the wechat app -fang yi jian kang ma guo ji ban-. a green qr code generated from the program must be presented before departure. travelers arriving from the following countries will need a  nucleic acid test result issued within 48 hours and a negative igm anti-body test result issued at most 48 hours prior departure prior to departure to generate this code. travelers not arriving directly in china must repeat both tests in the transit countries and obtain a new health declaration form in each transit country.foreign nationals arriving from the abovementioned countries must have a health declaration form issued by a chinese embassy or consulate. the form can be obtained with a negative  () nucleic acid test result issued at most 48 hours before departure and a negative igm anti-body test result issued at most 48 hours before departure. travelers not arriving directly in china must repeat both tests in the transit countries and obtain a new health declaration form in each transit country.Travelers arriving at Beijing (PEK), Guangzhou (CAN), Shanghai Hongqiao (SHA), Shanghai Pudong (PVG), Shenzhen (SZX) or Xiamen (XMN) are subject to medical screening and quarantine for 14 days.Airline crew with a layover at the above airports must undergo NAT inside the passenger terminal, then self-isolate at their hotel temporarily before acquiring the NAT results."
    },
    {
        "country": "Colombia",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/co.svg?v=93cd49e98e0a01c73f8dc855786c3885e0cecea7&amp;cluster=4",
        "iso_alpha2": "co",
        "report1": "Colombia has resumed international commercial flights. Travelers must fill out the <a href=https://apps.migracioncolombia.gov.co/pre-registro/public/preregistro.jsf>Check-Mig</a> form",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>colombia has resumed international commercial flights on september 19.Colombia has resumed international commercial flights on September 19.Colombia has announced the planned resumption of a policy requiring international travelers to have a negative PCR test result prior to entering its borders. Guidelines for international travelers are forthcoming.travelers must fill out the <a href=-https://apps.migracioncolombia.gov.co/pre-registro/public/preregistro.jsf->check-mig</a> form and must comply with follow-up health checks via <a href=-https://colombia.gov.co/19/aislamiento-saludable/coronapp.html->coronapp</a> mobile app."
    },
    {
        "country": "Cook Islands",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/ck.svg?v=c132b131fca2eea5e450825f9ddc4a84f57abf7e&amp;cluster=4",
        "iso_alpha2": "ck",
        "report1": "The Cook Islands have restricted the entry to all travelers except for Cook Islanders and Cook Islands Permit Holders.",
        "report2": "<b id=-entryRestrictions->Entry restrictions</b><p>The Cook Islands have restricted the entry of all travelers except for Cook Islanders and Cook Islands Permit Holders who have been present in New Zealand for at least 30 days and whose main purpose of travel is to return home, or to take up or resume employment.The Cook Islands have restricted the entry of all travelers except for Cook Islanders and Cook Islands Permit Holders who have been present in New Zealand for at least 30 days and whose main purpose of travel is to return home, or to take up or resume employment."
    },
    {
        "country": "Costa Rica",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/cr.svg?v=9acc55eb77e479ac7e03509d6425e9d05ec2cee9&amp;cluster=4",
        "iso_alpha2": "cr",
        "report1": "Costa Rica has allowed all countries in the world to enter by air.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>costa rica has allowed all countries in the world to enter by air.Costa Rica has allowed all countries in the world to enter by air.Travelers must complete the digital <a href=-https://salud.go.cr/->Health Pass</a> 48 hours before boarding.travelers must have a travel insurance with coverage of  treatment and accommodation costs. check <a href=-https://www.visitcostarica.com/en/costa-rica/statement-costa-rica-tourism-board-->visit costa rica website</a> for more details.costa rica has eased their travel regulations and removed the requirement of rt-pcr tests for the detection of the .Expired residence permits (DIMEX) with category xe2x80x9cpermanente- are extended until 11 January 2021, with categories xe2x80x9ctemporales- and xe2x80x9cespeciales- which expired after 18 December 2019 are extended until 11 January 2021 and with category xe2x80x9cestancias- which expired after 17 March 2020 are extended until 12 February 2021.For information on visas, refer to the <a href=-https://www.migracion.go.cr/Paginas/Visas.aspx->General Directorate of Migration and Foreigners</a>."
    },
    {
        "country": "Cuba",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/cu.svg?v=27c2a6236e4527a1a3bf79773519369c47895450&amp;cluster=4",
        "iso_alpha2": "cu",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>cuba has resumed commercial and charter flights.Cuba has resumed commercial and charter flights.Travelers must complete a -Declaracixc3xb3n de Sanidad del Viajero- and present it upon arrival.Travelers will be tested on arrival (a xe2x80x98PCRxe2x80x99 swab and a temperature test), there is a charge of USD 30 for the PCR test.Tourists arriving on holiday charter flights will be transferred directly to their hotels and will be briefed on further medical checks or testing within the hotel. Tourists arriving to Cayo Coco (CCC) must have a reservation confirmation of an approved hotel.All travelers on commercial flights are subject to self-isolation and must undertake a second PCR test. If the result for the second test is negative, they will no longer have to self-isolate.travelers showing symptoms of  may be isolated.travelers who tests positive for  will be hospitalized immediately, at own their own expense."
    },
    {
        "country": "Curaxc3xa7ao",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/cw.svg?v=cf4c975bc4f7c2b34333b9cc1d517bb3033f662d&amp;cluster=4",
        "iso_alpha2": "cw",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>curacao has restricted the entry of all travelers who are not airline crew, authorized medical personnel, authorized government personnel, or residents of curacao who have been pre-approved for entry by the government of curacao. residents, medical personnel, and government personnel must have a verification letter from the government of curacao proving they are allowed to enter curacao.Curacao has restricted the entry of all travelers who are not airline crew, authorized medical personnel, authorized government personnel, or residents of Curacao who have been pre-approved for entry by the Government of Curacao. Residents, medical personnel, and government personnel must have a verification letter from the government of Curacao proving they are allowed to enter Curacao.Travelers from the following countries are welcome to visit Curacao:Low-risk Countries:Anguilla, Antigua and Barbuda, Aruba, Barbados, Bermuda, Bonaire, British Virgin Islands, Cayman Islands, Dominica, Grenada, Montserrat, Saba, Saint Kitts and Nevis, Saint Lucia, St. Eustatius, St. Vincent and GrenadinesMedium-risk countries:Austria, Azerbaijan, Canada, China, Cuba, Denmark, Finland, French Guyana, Germany, Greece, Guyana, Hong Kong, Hungary, India, Italy, Jamaica, Morocco, Netherlands, New Zealand, Norway, Poland, Saint Barthelemy, Sint Maarten, Suriname, Sweden, Taiwan, Trinidad &amp; Tobago, Turkey, Turks and Caicos, Uruguay.The US Tri-State area (New York, New Jersey and Connecticut) and the state of Florida are considered medium risk.Travelers who depart from high-risk countries or have been in a high-risk country in the last 14 days are not allowed to enter Curaxc3xa7ao. These include either countries where the risk of transmission is too high or countries that have not been evaluated by the public health authorities. For exemption, travelers from high-risk countries are requested to submit a travel exemption request to the <a href=-https://www.cognitoforms.com/DirectieRisicobeheersingRampenbeleidCura%C3%A7ao/GovernmentOfCura%C3%A7ao->Travel Verification Team</a>.All arriving travelers must complete the digital immigration card online before departure and digitally fill out the Passenger Locator Card(PLC) and carry a printed document of proof with you. Can be found at <a href=-https://dicardcuracao.com/portal->https://dicardcuracao.com/portal</a>.travelers arriving from medium-risk countries must present a medical certificate with a negative  pcr test taken within 72 hours prior to departure. (note: pcr tests based on gargle samples will not be accepted. passengers should carry a printed document of proof with them for both the plc and negative pcr test result.)Travelers must be adequately insured for medical care and any additional costs if they are quarantined or become ill during their stay.In accordance with existing policies, anyone who needs to travel to Curacao from a high risk country must apply for a permit to enter the island, which will include a mandatory quarantine of 14 days. Every traveler is responsible for paying the cost of the mandatory quarantine, and any possible cost incurred in the isolation period and the PCR test at the end of the period"
    },
    {
        "country": "Cyprus",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/cy.svg?v=8ce7f9ff7de158fda7dcea342b9e932889bf8244&amp;cluster=4",
        "iso_alpha2": "cy",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>the authorities in the north of cyprus have suspended arrivals, except for turkish-cypriots and their dependents. outbound flights are expected to continue to operate but you should consult your airline directly for more information.The authorities in the north of Cyprus have suspended arrivals, except for Turkish-Cypriots and their dependents. Outbound flights are expected to continue to operate but you should consult your airline directly for more information.Cyprus has begun to reopen its borders, and prerequisites are in place for travelers to enter the country. To facilitate travel arrangements, the government of Cyprus has created <a href=-https://cyprusflightpass.gov.cy/->CyprusFlightPass</a>, an online portal where travelers can submit the necessary details to receive authorization to fly. Countries have been sorted into categories A, B, and C based on their epidemiological situation, with A being the most favorable.Travelers entering Cyprus from countries in Category A must complete the Passenger Locator Form and the Declarations for Country A Categories to obtain the CyprusFlightpass.travelers entering from countries in category b must complete the above paperwork to obtain the cyprusflightpass, plus a test (for travelers 12 and over) and lab certificate confirming negative pcr for  within 72 hours before their flight to cyprus.Cypriot citizens and their family members, legal residents, those allowed to enter under the Vienna Convention, those with special permission from the government, and travelers entering from countries unable to offer testing may choose to get tested upon entering the country (at their own expense). They must self-isolate until the results are completed, and remain in mandatory quarantine if the test is positive.category c includes all of the remaining countries not included in category a and b. only cypriot citizens and their family members, legal residents, those allowed to enter under the vienna convention, and those with special permission from the government may enter from these countries. they must complete the above paperwork to obtain the cyprusflightpass, plus a test and lab certificate confirming negative pcr for  within 72 hours before their flight to cyprus. they may choose to get tested upon entering the country, and the same rules outlined above apply.Please note that travelers from Category A Countries that have stayed overnight in a Category B or C country in the last 14 days before flying to Cyprus will be counted as a Category B or C traveler, and must satisfy the requirements of that category. The same applies for travelers from Category B Countries who have stayed overnight in a Category C country in the last 14 days before flying to Cyprus.the administration in the north of cyprus is now also allowing entry to xe2x80x98citizensxe2x80x99 and foreign nationals who hold residency, work or student permits. travelers will be required to show a negative  pcr test result (dated between three and five days prior to the date of the flight) on arrival. they will then be required to isolate at home for 7 days, on the condition that you will not meet anyone, or host visitors, during this period. failure to follow the rules of self-isolation will result in mandatory quarantine at facilities allocated by the authorities.rnif other passengers on the flight subsequently test positive on arrival to cyprus, travelers may be subject to further quarantine facility/self-isolation measures.travelers could be subject to  test and quarantine."
    },
    {
        "country": "Czech Republic",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/cz.svg?v=51b3870e5c6e012f1fd8dc90979f7493854dfe32&amp;cluster=4",
        "iso_alpha2": "cz",
        "report1": "Starting on October 22, travelers are only allowed to enter Czechia for essential purposes, such as business or study. Czechia will now allow travelers from countries it considers to be of low risk to enter without being required to quarantine.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>starting on october 22, travelers are only allowed to enter czechia for essential purposes, such as business or study.rnStarting on October 22, travelers are only allowed to enter Czechia for essential purposes, such as business or study.rnthe czech government has classified countries based on their rate of  cases. travelers arriving from countries considered to be of low risk will not be required to quarantine or provide a pcr test. travelers arriving from countries not considered to be 'low risk' are only allowed to enter the czech republic for limited, specific purposes.Exceptions to this include family members of EEA/UK nationals residing in Czechia (who must provide evidence of their relationship), as well as travelers with a D visa issued by Czechia or a C visa issued by Czechia after May 11, 2020.details of how countries are classified, and the regulations in place for travelers from those countries, can be found on the <a href=-https://www.mvcr.cz/mvcren/article/-information-of-moi.aspx->website of the czech ministry of interior</a>."
    },
    {
        "country": "Denmark",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/dk.svg?v=ab822eddc89b8aa116a87d17772f74b0871838fe&amp;cluster=4",
        "iso_alpha2": "dk",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>danish nationals and residents may still return to denmark from anywhere. for travelers who are not residents or nationals, entry regulations depend on whether they are arriving from an xe2x80x98openxe2x80x99 country or a xe2x80x98bannedxe2x80x99 country. a countryxe2x80x99s status can change dependent on its infection rate for . the updated list and can be found <a href=- https://coronasmitte.dk/en/entry-into-denmark ->here</a>.danish nationals and residents may still return to denmark from anywhere. for travelers who are not residents or nationals, entry regulations depend on whether they are arriving from an xe2x80x98openxe2x80x99 country or a xe2x80x98bannedxe2x80x99 country. a countryxe2x80x99s status can change dependent on its infection rate for . the updated list and can be found <a href=- https://coronasmitte.dk/en/entry-into-denmark ->here</a>.Travelers arriving from <a href=-https://coronasmitte.dk/en/entry-into-denmark/persons-resident-in-open-countries->open countries</a> can enter Denmark without having to go into quarantine.Travelers arriving from <a href=-https://coronasmitte.dk/en/entry-into-denmark/persons-resident-in-banned-countries->banned countries</a> can enter Denmark if they have a worthy purpose.Proof will be required to demonstrate a xe2x80x98worthy purposexe2x80x99 to enter. Examples of 'worthy purposes' include work or study in Denmark, transporting goods, and various family-related reasons, for example visiting a family member or partner who is a Danish resident. The full list of 'worthy purposes' is subject to change and can be found <a href=-https://coronasmitte.dk/en/entry-into-denmark/persons-resident-in-banned-countries ->here</a>. Travelers from a -banned- country are advised to check with the Danish authorities on their helpline (+45 7020 6044) to confirm whether they will be allowed entry into the country.the danish government permits xe2x80x9csweetheartsxe2x80x9d, fiancees, and other close relations of danish citizens or foreign nationals legally residing in denmark to enter denmark, so long as the individual can present proof of a negative  test carried out no more than 72 hours before entry. this exception is denmark-specific and does not apply to all countries within the schengen zone or eu. travelers going to denmark under the xe2x80x9csweetheart declarationxe2x80x9d from outside the eu are strongly encouraged to take a nonstop flight to denmark to ensure smooth entry into the country. for more information on this regulation, see <a href=-https://coronasmitte.dk/en/entry-into-denmark/persons-resident-in-banned-countries ->here</a>.travelers arriving from high risk or banned countries must present a medical certificate with a negative  pcr test result issued within 72 hours prior to arrival.Travelers returning to their home country may transit through Denmark.All travelers transiting or traveling to/from Denmark must wear masks at all times on flights and inside the airport."
    },
    {
        "country": "Djibouti",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/dj.svg?v=88babe40d5dfd673bfa769a3c836aa610c9506a2&amp;cluster=4",
        "iso_alpha2": "dj",
        "report1": "Djibouti has reopend its airport.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>djiboutixe2x80x99s ambouli international airport has reopened for incoming and outgoing passenger traffic.Djiboutixe2x80x99s Ambouli International Airport has reopened for incoming and outgoing passenger traffic.from november 11, travelers without a printed medical certificate in french or english with a negative  () pcr test result issued at most 72 hours before departure from the first embarkation point and at most 120 hours before arrival are subject to a pcr test upon arrival.All arriving travelers over the age of 11 are subject to medical screening and quarantine at their own expense."
    },
    {
        "country": "Dominica",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/dm.svg?v=abca55e65f652162a748cef5c08d12e6d95e8bd5&amp;cluster=4",
        "iso_alpha2": "dm",
        "report1": "Dominica's borders are now open to all arrival.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>dominica has reopened its airport both to nationals and foreign travelers.Dominica has reopened its airport both to nationals and foreign travelers.arriving passengers will have to complete an <a href=-http://dom19.dominica.gov.dm->online questionnaire</a> 24 hours before arrival, and have a pcr swab test with a negative result taken up to 24-72 hours before arrival. the pcr result must be uploaded and submitted with the questionnaire and receive an email of approval from the dominican ministry of health. travelers will not be allowed to board the flight to dominica without this email.Travelers arriving from High-Risk country who are intending to participate in the Safe in Nature managed experience, a confirmed booking must be provided at the port of entry. Check <a href=-https://hub.touchstay.com/guest/uxVf63aXAELOg/info/#i_subcategory_item184744->DHTA Booking Line</a> for booking information.A Rapid Diagnostic Test (RDT) will be taken on arrival. If the RDT is negative, then the traveler must self-isolate in a government operated or government certified facility for five days before having a further PCR test. If the RDT is positive, then, depending on travelers country of origin, a further PCR swab test will be carried out. This will be at the traveler's expense.Upon clearance from the port, travelers arriving from Low-Risk countries will be monitored at their place of residence for 7 days. Travelers must submit to scheduled and unscheduled checks by medical professionals.Upon clearance from the port, travelers arriving from Medium-Risk countries will be monitored at their place of residence for 14 days. Optional, a PCR test can be done on day 5 after arrival, if the result is negative, there will no further monitoring at their place of residence. Travelers must submit to scheduled and unscheduled checks by medical professionals.Upon clearance from the port, travelers arriving from High-Risk countries will be subject to a mandatory 5-day quarantine at a government operated facility or manage experience at a Safe in Nature certified property. A PCR test will be administered on day 5 after arrival, if the result is negative travelers will be deemed medically cleared.Arriving travelers who test positive will be subject to a mandatory 14-day quarantine in a Government facility, or in a certified hotel or guest house.For more information about the list of affected countries <a href=-https://discoverdominica.com/travel-advisory-for-dominica->check Discover Dominica website</a>."
    },
    {
        "country": "Dominican Republic",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/do.svg?v=7eb7dac26b1910b4d30907fcd82ee424eefaafe2&amp;cluster=4",
        "iso_alpha2": "do",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>the dominican republic has reopened its air borders.rnThe Dominican Republic has reopened its air borders.rnfrom september 15, travelers no longer need to provide a negative pcr or  test upon arrival. instead, airports will administer a quick, aleatory breath test to between 3% and 10% of passengers, and all those who present symptoms, upon arrival. all passengers will also need to perform a temperature check.travelers will be required to fill out and submit a <a href=-https://www.godominicanrepublic.com/download/123248/->travelerxe2x80x99s health affidavit.</a> through this form, passengers declare they have not felt any  related symptoms in the last 72 hours and provide contact details for the next 30 daysTravelers who present symptoms or whose test results are positive will be isolated and attended at authorized locations."
    },
    {
        "country": "East Timor",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/tl.svg?v=1527283dc51420a1c4112daa518b54257277153c&amp;cluster=4",
        "iso_alpha2": "tl",
        "report1": "Timor-Leste has restricted the entry of all travelers except for nationals and residents of Timor-Leste.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>timor-leste has restricted the entry of all travelers except for nationals and residents of timor-leste, passengers born in timor-leste, legal representatives of timorese minors; and oil rig workers.rnTimor-Leste has restricted the entry of all travelers except for nationals and residents of Timor-Leste, passengers born in Timor-Leste, legal representatives of Timorese minors; and oil rig workers.rnall travelers arriving in the country are subject to quarantine for 14 days.rnrntravelers who present symptoms of , including fever, cough and breathing difficulties are restricted from traveling, and taken to a health facility for a  test. positive cases will be subject to isolation.rn"
    },
    {
        "country": "Ecuador",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/ec.svg?v=d68c44b0b1e9a5a73f3f78352522f43cee6d3c97&amp;cluster=4",
        "iso_alpha2": "ec",
        "report1": "Flights to Ecuador have now resumed.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>flights to ecuador have now resumed.Flights to Ecuador have now resumed.special 'travel corridors' exist for tourists visiting the galapagos. foreigners wishing to enter the islands must present a negative polymerase chain reaction (pcr) test for , taken 96 hours prior to the date of departure to ecuador. on arrival in ecuador, tourists may be requested to take another pcr test, at their own expense. tourists must also present a return flight and a safe passage document (xe2x80x98salvoconductoxe2x80x99) issued by the ministry of tourism to be exempt from doing 14 days of self-isolation on the islands. the tour operators or hotels are responsible for arranging this safe passage document on behalf of tourists, given that visitors are required to have previous contracted travel and accommodation arrangements. the galapagos transit control card, will need to be filled out online at least 24 hours before the flight. on arrival in ecuador you will be required to fill in a health status declaration, including a local address.rntravelers must present a completed health form and a completed immigration form as well as a negative pcr test for  issued within 10 days before arrival. travelers without a qualifying test result will be tested upon arrival.arriving travelers with a valid test certificate no longer need to enter quarantine unless they present symptoms of . those without one will be tested and sent to quarantine while awaiting results and until receiving a negative testing result. more information is available <a href=-https://www.gestionderiesgos.gob.ec/resoluciones-coe-nacional-15-de-agosto-2020/->here</a>."
    },
    {
        "country": "Egypt",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/eg.svg?v=1d2e834e4e7068044fb288207ce2871c9393030d&amp;cluster=4",
        "iso_alpha2": "eg",
        "report1": "Egypt has resumed commercial flights into the country. Travelers must bring a negative PCR test issued within 72 hours of arriving in Egypt.",
        "report2": "<b id=-entryRestrictions->Entry restrictions</b><p>Egypt's airports are open to travel including for tourism. Some airlines are imposing special requirements, such as the wearing of face masks.Egypt's airports are open to travel including for tourism. Some airlines are imposing special requirements, such as the wearing of face masks.All travelers (including those who hold Egyptian nationality) arriving from overseas, to any part of Egypt must present a negative PCR test certificate issued within the preceding 72 hours prior to flight departure to Egypt. However, travelers arriving from Argentina, Australia, Bolivia, Brazil, Canada, Chile, China, Colombia, Ecuador, France (Paris only), Germany (Frankfurt only), Guyana, Italy(Rome only) Japan, Mexico, New Zealand, Paraguay, Peru, South Korea, Suriname, Thailand, US, UK(London Heathrow only), Uruguay or Venezuela will be allowed to provide the test certificate issued within 96 hours prior to flight departure. Children under the age of 6, of all nationalities, are exempt from providing negative PCR test certificates. No other exemptions have been confirmed.All travelers arriving to Egypt will have their temperature checked, must completed a public health card with personal details, and will need to provide confirmation of valid health insurance policy to airport authorities.Tourists flying directly into the airports in the coastal governorates of the Red Sea (Hurghada and Marsa Allam), South Sinai (Sharm El-Sheikh) and Marsa Matrouh that are unable to present acceptable evidence of a negative PCR test will need to undergo testing on arrival for a fee of USD 30 and required to self-isolate in a hotel while awaiting the test result. If the result is positive, travelers are subject to a 14-day quarantine in a separate room allocated for quarantine within the hotel. If symptoms persist, they will be transferred to a public hospital or private hospital of choice, under the supervision of the Ministry of Health."
    },
    {
        "country": "Eritrea",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/er.svg?v=6654971ff8f79ad9418c121bada204dd26312d0d&amp;cluster=4",
        "iso_alpha2": "er",
        "report1": "Asmara international airport in Eritrea is closed.",
        "report2": "<b id=-entryRestrictions->Entry restrictions</b><p>All borders are officially closed, as is Asmara international airport. There is no indication of when the airport will re-open.All borders are officially closed, as is Asmara international airport. There is no indication of when the airport will re-open."
    },
    {
        "country": "Estonia",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/ee.svg?v=bdd12f9d9a57fe542600b31d3740f42b4e8d8b47&amp;cluster=4",
        "iso_alpha2": "ee",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>travelers are not allowed to enter estonia with the exception of estonian nationals, residents and their family members, travelers entering as workers and students, as well as diplomatic, medical, humanitarian and transit flights.Travelers are not allowed to enter Estonia with the exception of Estonian nationals, residents and their family members, travelers entering as workers and students, as well as diplomatic, medical, humanitarian and transit flights.Estonia has restricted most foreign nationals into the country with the exception of nationals and residents of the European Union, the Schengen area, the UK, Andorra, Monaco, San Marino, Vatican City, and individuals with a long-stay visa, residents of Australia, Japan, New Zealand, Rwanda, South Korea, Thailand, Singapore and Uruguay.travelers arriving from countries mentioned above may enter to estonia if they have no symptoms of .travelers arriving from a country where the number of  cases per 100,000 inhabitants has been more than 15 in the last 14 days are subject to a 14-day quarantine.the citizens of latvia and lithuania, holders of residence permit or right of residence of these countries, can enter estonia and do not have to stay at home if they display no symptoms of .foreign travelers who are in estonia for transit to reach their home country can travel through estonia provided they have no symptoms of .Travelers who have been required to self-isolate or stay in quarantine need to comply with the established requirement until the end of the specified deadline"
    },
    {
        "country": "Eswatini",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/sz.svg?v=bc627450f62e8d2c612e0fed6551e79f453b8501&amp;cluster=4",
        "iso_alpha2": "sz",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>eswatini (swaziland) has resumed commercial flights.Eswatini (Swaziland) has resumed commercial flights.travelers must present a medical certificate with a negative  test result issued within 72 hours prior to entry.travelers without a medical certificate with a negative  test result issued within 72 hours before arrival are subject to a pcr test upon arrival at their own expense.Travelers are subject to medical screening and quarantine or isolation for 14 days."
    },
    {
        "country": "Ethiopia",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/et.svg?v=f409caaccc04e781e4c333eb3f420ca113acca9a&amp;cluster=4",
        "iso_alpha2": "et",
        "report1": "Ethiopia's airports are open, with medical screenings, testing and quarantine requirements for arriving travelers.rn",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>ethiopia has closed its land borders, but airports remain open.Ethiopia has closed its land borders, but airports remain open.travelers must have a medical certificate with a negative  rt-pcr test result issued at most 120 hours before arrival starting from the time sample is given.Addis Ababa Bole International Airport (and other international ports of arrival) have put in place additional measures to screen passengers arriving, departing or transiting through Ethiopia. Screening may include temperature measurements, completing a health screening questionnaire and answering questions from health officials. This will include checks on recent travel to affected areas and accommodation details for self-isolation. Travelers will also be tested again prior to leaving the airport.travelers with a medical certificate with a negative  rt-pcr test result are subject to a mandatory 7-day self-isolation at their home and also required to give sample upon arrival.Travelers who tests positive for the virus but displays only mild symptoms will be required to remain in self-isolation for a further 14 days (where possible). They may be tested again prior to the end of self-isolation. If they cannot self-isolate they will need to stay at a government designated isolation center until they have recovered and tested negative with follow up tests. Those with more serious symptoms may be taken to a government designated isolation facility or hospital for treatment.travelers without a medical certificate with a negative  rt-pcr test result are subject to a mandatory 14-day self-isolation. the first 7 days will be at a government-designated facility at their own expense and the remaining 7 days at home.Travelers with an onward ticket to another destination may transit in Ethiopian airports, as long as the transit time is under 72 hours. Travelers transiting for 8 hours or less can remain in the departure lounge of the airport. For transits over 8 hours, you will be taken to a designated transit hotel for the duration of your stay. Transit travelers are subject to medical screening."
    },
    {
        "country": "Falkland Islands (Islas Malvinas)",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/fk.svg?v=efa692a696dc125cb878a53a732dc86a92d1686f&amp;cluster=4",
        "iso_alpha2": "fk",
        "report1": "The Falkland Islands has restricted the entry of all travelers who are not residents or work permit holders.",
        "report2": "<b id=-entryRestrictions->Entry restrictions</b><p>The Falkland Islands have restricted entry to all travelers except returning residents, work permit holders, and those with Falkland Islands (Malvinas) status.rnrnTravelers who have official business with the Falkland Islands government with proof of authorization may also enter.rnThe Falkland Islands have restricted entry to all travelers except returning residents, work permit holders, and those with Falkland Islands (Malvinas) status.rnrnTravelers who have official business with the Falkland Islands government with proof of authorization may also enter.rnAll travelers arriving in the Falklands Islands are subject to a 14-day quarantine."
    },
    {
        "country": "Faroe Islands",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/fo.svg?v=07aa536c02f4529512de735b1a10028c53d5be36&amp;cluster=4",
        "iso_alpha2": "fo",
        "report1": "The Faroe Islands have restricted the entry of most non-resident foreign nationals traveling from countries other than EU Member States, Schengen countries and the United Kingdom."
    },
    {
        "country": "Federated States of Micronesia",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/fm.svg?v=86fdf68518857222542dc59e9bb506a6e1ff76de&amp;cluster=4",
        "iso_alpha2": "fm",
        "report1": "The Federated States of Micronesia have not restricted entrance to the country, but there are restrictions in place for the states of Pohnpei and Chuuk.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>the federated states of micronesia have not restricted entrance to the country, but there are restrictions in place for the states of pohnpei and chuuk.The Federated States of Micronesia have not restricted entrance to the country, but there are restrictions in place for the states of Pohnpei and Chuuk.Travelers are restricted from entering the state of Pohnpei. Residents of Pohnpei and medical and technical personnel may still enter the state, but will be required to present a medical certificate and self-quarantine for 14 days.rnAll travelers and airline crew must go through medical screening upon arrival in Micronesia.travelers wishing to enter the state of chuuk may only enter after having self-quarantined for 14 days in a  free country before departure. they will also be quarantined for 14 days on arrival in micronesia."
    },
    {
        "country": "Fiji",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/fj.svg?v=91acab6c494054ebe00ec37f4975d7e7a1222298&amp;cluster=4",
        "iso_alpha2": "fj",
        "report1": "Fiji has restricted the entry of all foreign nationals who are not residents.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>fiji has restricted the entry of all travelers who are not nationals or residents of fiji.rnFiji has restricted the entry of all travelers who are not nationals or residents of Fiji.rnreturning residents and citizens must request permission to enter fiji from the  risk mitigation taskforce (crmt). to do this you must email the following documents to <a <=-- a=-- href=-mailto:crmt@govnet.gov.fj->rnrnxc2xb6letter addressed to the chair  risk mitigation taskforce providing background to your request;rnxe2x80xa2copy of passport bio-data page;rnxc2xb6copy of the valid work permit or provide the approval letter by immigration that was given for the work permit;rnxe2x80xa2proposed itinerary;rnxe2x80xa2confirmation you are willing to enter a government-mandated quarantine facility for 14 days;rnxe2x80xa2evidence of a negative  rt-pcr test (for a nasopharyngeal sample taken not more than 72 hours before departure). the test result must be in the form of the complete report from the laboratory that performed the test.</a>All Fijian citizens and Fiji residents must download the careFIJI app to enter the country. Those without a smartphone will be required to buy one upon landing at Nadi airport for $100."
    },
    {
        "country": "Finland",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/fi.svg?v=f29ddd45f23f692af6d8d09d064ade19eb1b8696&amp;cluster=4",
        "iso_alpha2": "fi",
        "report1": "Finland has eased restrictions on travelers arriving from certain countries.",
        "report2": "<b id=-entryRestrictions->Entry restrictions</b><p>The Faroe Islands have restricted the entry of non-resident foreign nationals traveling from countries other than EU Member States, Schengen countries and the UK unless they have a recognized reason for travel such as work for an employer in the Faroe Islands, visiting a sick relative, or transporting goods. Countries other than EU Member States, Schengen countries and the UK are currently by definition banned countries.The Faroe Islands have restricted the entry of non-resident foreign nationals traveling from countries other than EU Member States, Schengen countries and the UK unless they have a recognized reason for travel such as work for an employer in the Faroe Islands, visiting a sick relative, or transporting goods. Countries other than EU Member States, Schengen countries and the UK are currently by definition banned countries.For a full list of recognized reasons, see <a href=-https://corona.fo/bordercontrol?_l=en->here</a>.All travelers are required to take a test upon arrival in the Faroe Islands, and should take a follow-up test on the sixth day of their visit. Children under the age of 12 are not required to be tested.Travelers must pay for the test. Each test costs DKK 312 at Vagar Airport.Travelers arriving from banned countries are subject to a 10-day quarantine.<b id=-entryRestrictions->Entry restrictions</b><p>Finland's borders remain closed to non-resident foreign nationals entering the country, with some exemptions.Finland's borders remain closed to non-resident foreign nationals entering the country, with some exemptions.The Finnish Border Guard has is maintaining a <a href=-https://www.raja.fi/en->list of countries</a> with reduced border controls - travelers arriving from these countries will not need to self-isolate on arrival in Finland.Nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, the Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland, and the United Kingdom residing in Finland, and their family members may enter the country for some <a href=-https://www.raja.fi/current_issues/guidelines_for_border_traffic->essential reasons</a>.As of 13 July, travel between Finland and countries in the EU/Schengen Zone and the UK as well as Algeria, Australia, South Korea, Georgia, Japan, New Zealand, Rwanda, Thailand, Tunisia, Uruguay and China (provided that reciprocity is confirmed in the EU) will be permitted for work and other essential purposes for residents of these countries. Additionally, there is a special exemption allowing a quota of workers employed as berry pickers to travel from Thailand to Finland.Travelers arriving from within the EU or a Schengen Member State may enter Finland if they are traveling for work or study in Finland. Healthcare professionals, transport personnel, diplomats, humanitarian aid workers, military personnel, travelers entering for imperative family reasons, and workers who commute to another country daily may also enter the country. More information is available at the <a href=-https://www.raja.fi/current_issues/guidelines_for_border_traffic->Finnish Border Guard website</a>.People arriving in Finland from countries other than those mentioned earlier will be required to self-quarantine for 14 days upon arrival.Nationals and residents of the above-named countries who are returning to their home countries through Finland may also transit through the country."
    },
    {
        "country": "France",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/fr.svg?v=a38f98691fd2454c377951bf04008e9f8209a789&amp;cluster=4",
        "iso_alpha2": "fr",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>france has begun to ease its travel restrictions. as well as travelers arriving from states in the wider european area (eu, uk, andorra, vatican city, iceland, liechtenstein, monaco, norway, san marino and switzerland), travelers may now enter france from australia, canada, georgia, japan, new zealand, rwanda, south korea, thailand, tunisia and uruguay without any requirement to self-isolate, or to demonstrate their travel is essential.France has begun to ease its travel restrictions. As well as travelers arriving from states in the wider European area (EU, UK, Andorra, Vatican City, Iceland, Liechtenstein, Monaco, Norway, San Marino and Switzerland), travelers may now enter France from Australia, Canada, Georgia, Japan, New Zealand, Rwanda, South Korea, Thailand, Tunisia and Uruguay without any requirement to self-isolate, or to demonstrate their travel is essential.Exemptions exist for spouses and children of French nationals, long-term residents with French residence permits and their spouses and children, long-term residents of EEA Member States, Andorra, Monaco, San Marino, Switzerland, the United Kingdom or the Vatican City and their spouses and children on their way home, and healthcare professionals. Airline crew, personnel of diplomatic and consular missions and international organizations with offices in France and their spouses and children, and merchant seamen may also still enter. Mask wearing is obligatory for all travelers above the age of 11.travelers will need to complete a xe2x80x98sworn statementxe2x80x99 (dxc3xa9claration sur lxe2x80x99honneur) form self-certifying they are not suffering from symptoms associated with  and have not been in contact with confirmed cases in the preceding fortnight. this is available in english on the site of the <a href=-https://uk.ambafrance.org/-uk-and-french-travel-and-quarantine-measures->french embassy london</a>.Foreign travelers who are not nationals of the above countries or arriving from one of the above countries are still restricted from entering France.Travelers arriving from outside of the countries listed above must have an International Travel Certificate to enter and transit France, showing that their travel is of an -essential- nature. This must be obtained prior to departure via the French consular offices abroad or online at <a href=-https://www.interieur.gouv.fr->https://www.interieur.gouv.fr</a>.Travelers flying to airports in France from such areas will also be required to take a PCR test. They may either provide a negative test result taken less than 72 hours before departure. Whether this test is recommended or obligatory depends on the category your country of departure falls in to:category 1 countries: for travelers from bahrain, panama, the uae and the usa. boarding will be refused if a negative  test result is not presented. those departing the us who have taken a test but do not yet have a result will be able to board with a consular xe2x80x98laissez-passerxe2x80x99 on condition they re-take a test on arrival.Category 2 countries: For travelers from Algeria, Argentina, Armenia, Bolivia, Bosnia and Herzegovina, Brazil, Costa-Rica, Chile, Colombia, Dominican Republic, Equatorial Guinea, India , Israel, Kosovo, Kuwait, Kyrgyzstan, Lebanon, Madagascar, Maldives, Mexico, Moldova, Montenegro, Occupied Palestinian territories, Oman, Peru, Qatar, Serbia, South Africa and Turkey. Travelers are strongly recommended to take a test in the 72 hours prior to departure but can opt to take a test on arrival instead.Arrivals from countries not named above will be invited to present negative test results taken 72 hours prior to departure or may opt to take a test on arrival.Travelers without a negative test result arriving from Category 2 countries and from countries not named above are subject to quarantine if they refuse to take a test upon arrival.There are special regulations for travelers transiting through France to return to their country of residence. Only direct transit to reach your country of residence is permitted. Transiting travelers may not leave the international zone and will not be admitted to France. Luggage must be checked through to the final destination, and travelers will not be permitted to leave the international zone to collect and recheck baggage. The duration of transit must be less than 24 hours.For travel to French Overseas Territories, please check the restrictions specific to the territory you're interested in visiting."
    },
    {
        "country": "French Guiana",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/gf.svg?v=861ce4bafa2557ce8e627cfb720401eb5fd61bff&amp;cluster=4",
        "iso_alpha2": "gf",
        "report1": "French Guiana has restricted the entry of all foreign nationals.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>french guiana is restricting the entry of most travelers until further notice.French Guiana is restricting the entry of most travelers until further notice.Only travelers who can prove that entry is for urgent family/work reasons will be allowed to enter, and they will be expected to fill in a <a href=-https://www.interieur.gouv.fr/Actualites/L-actu-du-Ministere/Attestation-de-deplacement-et-de-voyage->travel certificate</a> and provide proof.all travelers over the age of 11 must show a negative test result for  issued within 72 hours before departure for french guiana.travelers must also provide a self-certified document affirming that they have no  symptoms and that to their knowledge they have not been in contact with any person confirmed positive within the last 14 days.Airlines will refuse boarding to anyone who does not produce both proof of a negative result and the self-certified document."
    },
    {
        "country": "Gabon",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/ga.svg?v=0ce8a5a065f50e721958265c2ab65fe049bf220c&amp;cluster=4",
        "iso_alpha2": "ga",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>gabon has announced the resumption of limited commercial air travel. three international flights per airline per week will be permitted.Gabon has announced the resumption of limited commercial air travel. Three international flights per airline per week will be permitted.upon arrival, travelers are subject to a  test and self-isolation for 48 hours while awaiting the test result. if the  test is negative, they will be issued a test certificate, which is valid for 14 days and can be renewed at the end of this period after another test is undertaken. if the result is positive, they are required to continue self-isolation and await specific instructions from gabonese health authorities.all  tests taken in gabon supersede any that were taken before arrival in gabon."
    },
    {
        "country": "Gambia",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/gm.svg?v=2d968e15f80fd902e3cf1906341c1d7311286bff&amp;cluster=4",
        "iso_alpha2": "gm",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>commercial flights remain very limited.Commercial flights remain very limited.travelers must present a negative  test result issued within 72 hours prior to arrival.travelers without a negative  test taken within 72 hours before travel will be tested and subject to a 14-day quarantine upon arrival at their own expense."
    },
    {
        "country": "Georgia",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/ge.svg?v=4263b3613c0bd5958000a11028ffb9df7aefbd58&amp;cluster=4",
        "iso_alpha2": "ge",
        "report1": "Georgia is imposing an 8-day quarantine upon arrival with a PCR test on the 8th day of quarantine to travelers eligible to enter the country.",
        "report2": "<b id=-entryRestrictions->Entry restrictions</b><p>Georgia has restricted the entry of all travelers who are not nationals and residents of Georgia, or an immediate family member. Nationals and residents of Croatia, Cyprus, Georgia, Greece, Iceland, Italy, Luxembourg, Netherlands, Poland, Portugal, Romania, Slovenia, Spain and Sweden are also allowed to enter.Georgia has restricted the entry of all travelers who are not nationals and residents of Georgia, or an immediate family member. Nationals and residents of Croatia, Cyprus, Georgia, Greece, Iceland, Italy, Luxembourg, Netherlands, Poland, Portugal, Romania, Slovenia, Spain and Sweden are also allowed to enter.Restrictions on most international commercial flights to Georgia have been extended through at least October 31, with exceptions in place for flights arriving from Estonia, France, Germany, Latvia and Lithuania. Nationals and residents of Estonia, France, Germany, Latvia and Lithuania are also allowed to enter Georgia if they are arriving from their country.Airline crew, humanitarian aid workers, diplomats and their families, travelers with refugee status in Georgia, and travelers with stateless status may still enter the country.nResidence permit holders must obtain an OK TO BOARD before departing for Georgia.Certain business travelers and those who want to work from Georgia remotely may apply for special permission to enter Georgia by submitting an <a href=-https://stopcov.ge/en/Protocol->online application form.</a>All arriving travelers must complete an online form 48 hours before arrival at <a href=-https://registration.gov.ge/pub/form/7_protocol_for_arrivals_in_georgia/kcjcpx/->https://registration.gov.ge/pub/form/7_protocol_for_arrivals_in_georgia/kcjcpx/</a>. rnAll travelers eligible to enter Georgia are subject to an 8-day quarantine upon arrival, and must take a PCR test on the 8th day of quarantine. If the test is negative, they will be allowed to leave the quarantine, but will have to take another PCR test on the 12th day. Travelers on business trips will have the option to take a PCR test every 72 hours instead of quarantine. Tests and quarantine will be at their own expense."
    },
    {
        "country": "Germany",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/de.svg?v=077aee93b0d19f004a9a57e43d7b2e9179d59a24&amp;cluster=4",
        "iso_alpha2": "de",
        "report1": "Germany has relaxed its entry restrictions for travelers arriving from the European Economic Area, the UK, and Australia, Georgia, Canada, New Zealand, Thailand, and Uruguay. Testing and quarantine regulations may apply to travelers arriving from high-risk areas.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>germany has restricted the entry of travelers who are arriving from outside the european economic area, except for nationals of germany, residents with a residence permit, and d-visa holders, and certain exceptions (detailed below).Germany has restricted the entry of travelers who are arriving from outside the European Economic Area, except for nationals of Germany, residents with a residence permit, and D-Visa holders, and certain exceptions (detailed below).As of June 25, travelers arriving from Austria, Belgium, Bulgaria, Croatia, Czechia, Cyprus, Denmark, Estonia, Finland, France, Greece, Hungary, Iceland, Ireland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, the Netherlands, Norway, Poland, Portugal, Slovakia, Slovenia, Spain, Sweden, Switzerland or the United Kingdom may enter Germany.Germany has also lifted restrictions on entry for travelers coming from the following countries: Australia, Canada, Georgia, New Zealand, Thailand and Uruguay. Travelers must have spent at least 2 weeks in the above-listed countries prior to their flight to Germany. Restrictions will also be lifted for entry from South Korea, China and Japan if this can be agreed on a reciprocal basis. The list will be reviewed every two weeks.Entry from any third country is possible for travelers who can demonstrate an important reason for their travel. The list of important reasons covers German and EU citizens and any third-country nationals with a right of residency in Germany. It also includes healthcare and social care personnel and health researchers, skilled workers whose economic activity is necessary and cannot be postponed or performed from abroad, freight and transport staff, seasonal workers, students who cannot continue their studies from abroad, travelers making visits for urgent family reasons, diplomats and staff at international organizations, and persons transiting Germany.travelers entering germany after staying in a designated risk area abroad during the previous 14 days must undergo mandatory testing for . the german government regularly updates its list of designated risk areas. see the -english archive- at the bottom of the <a href=-https://www.rki.de/de/content/infaz/n/neuartiges_/risikogebiete_neu.html->robert koch institute</a> page for the latest updated list.Travelers who need to be tested have the choice to either present a valid test taken within 48 hours prior to arrival, take a test on arrival at the airport, or take a test after returning to their place of residence in Germany, by reporting to the local health office. The test is free of charge if taken within 72 hours of arrival. Travelers with a negative test may be exempted from the 14-day self-isolation requirement, but some German states require a second negative test before granting an exemption from quarantine.quarantine requirements in germany differ depending on the german state. all travelers arriving from high-risk areas (over 50 cases per 100,000 inhabitants) are required to stay in quarantine for 14 days on arrival in germany. more information can be found <a href=-https://www.bmi.bund.de/shareddocs/faqs/en/topics/civil-protection//-faqs.html#doc13797140bodytext3->here</a>."
    },
    {
        "country": "Ghana",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/gh.svg?v=ddd6221d12edb1ccff5911bee5233b24877637e3&amp;cluster=4",
        "iso_alpha2": "gh",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>accra kotoka international airport reopened for regular international travelers.Accra Kotoka International Airport reopened for regular international travelers.travelers must present a negative  pcr test issued within 72 hours before departure. children under the age of 5 are exempt from presenting a pcr test result.ghanaian residents who depart ghana and return within one week will not need to present a negative pcr  test. however, they will still be subject to testing upon arrival at the airport.Travelers must complete a <a href=-https://www.ghs-hdf.org/hdf/->Port Health Declaration Form</a> before departure.upon arrival, each traveler age five and over will be subject to a mandatory  test conducted at the airport. this test carries a usd 150 fee to be paid online by the traveler at <a href=-https://myfrontierhealthcare.com/->https://myfrontierhealthcare.com/</a> and present proof of payment to the airline prior to boarding. the test results will generally be available in 30 minutes.health authorities will attend to any traveler who tests positive for  and transfer them to ga east municipal hospital for clinical assessment and management, while those who receive negative test results will be allowed to enter ghana with no quarantine requirement.Airline crew are subject to quarantine until their next flight.transit passengers, except those who were diverted to accra for an emergency and where they will remain in the airport throughout, will also be subject to mandatory  testing as outlined above."
    },
    {
        "country": "Gibraltar",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/gi.svg?v=5ed770eb28c4b2086beaf9cac4156ab32846be35&amp;cluster=4",
        "iso_alpha2": "gi",
        "report1": "The Government of Gibraltar has lifted its travel restrictions. All incoming travelers with valid travel documents will be allowed entry into Gibraltar via the Gibraltar International Airport.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>the government of gibraltar has lifted its travel restrictions. all incoming travelers with valid travel documents will be allowed entry into gibraltar via the gibraltar international airport.rnThe Government of Gibraltar has lifted its travel restrictions. All incoming travelers with valid travel documents will be allowed entry into Gibraltar via the Gibraltar International Airport.rnthe government of gibraltar requires travelers flying to gibraltar to complete a  contact tracing form. this form will be given to travelers by airlines.Travelers must complete a <a href=-https://www.passengers.egov.gi/->passenger locator form</a> and report to the authorities if they have been in a xe2x80x9crelevant areaxe2x80x9d in the 14 days before their arrival in Gibraltar. Failure to do so constitutes an offence punishable with a fine of up to xc2xa31000.A relevant area means a country, area or territory outside the European Union but does not include the UK, Jersey, Guernsey, Isle of Man, Andorra, Monaco, San Marino and the Vatican. It also excludes the list of countries included in the Schedule (Iceland, Liechtenstein, Norway, Switzerland, Australia, Canada, Georgia, Japan, New Zealand, Rwanda, South Korea, Thailand, Tunisia, Uruguay and China).See the <a href=-https://www.gibraltar.gov.gi/press-releases/travel-measures-5382020-6114->Government of Gibraltar press release</a> for more details.Travelers arriving from the 'relevant area' from the last 14 days are subject to a 5-day self-isolation in a hotel and must be swabbed on day 1 and day 5. Travelers who are not registered with the Gibraltar Health Authority (GHA) must arrange a private swab."
    },
    {
        "country": "Greenland",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/gl.svg?v=15802ceb086219b8a4c80deb83b7a54c0699255a&amp;cluster=4",
        "iso_alpha2": "gl",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>greenland's travel restrictions are set by the government of denmark. travelers from <a href=-https://politi.dk/en/-in-denmark/travelling-in-or-out-of-denmark/entry-into-denmark->open countries</a> xe2x80x93 as classified by denmark xe2x80x93 may travel to greenland if they present a negative  test result taken in a nordic country (denmark, norway, sweden, finland, iceland, or the faroe islands) no more than five days prior to travel.greenland's travel restrictions are set by the government of denmark. travelers from <a href=-https://politi.dk/en/-in-denmark/travelling-in-or-out-of-denmark/entry-into-denmark->open countries</a> xe2x80x93 as classified by denmark xe2x80x93 may travel to greenland if they present a negative  test result taken in a nordic country (denmark, norway, sweden, finland, iceland, or the faroe islands) no more than five days prior to travel.a travel ban remains in place for travelers from other countries, unless the traveler has a xe2x80x9cworthyxe2x80x9d purpose of travel as classified by denmark; such travelers must quarantine upon arrival. the full list of travel exceptions (ie, worthy purposes) can be found on the <a href=-https://politi.dk/en/-in-denmark/travelling-in-or-out-of-denmark/entry-into-denmark->danish government  information page</a>. rnall travelers must also complete a xe2x80x9csumutxe2x80x9d form prior to entry, containing their travel itinerary and lodging details in greenland. that form can be found on the <a href=-https://sumut2020.gl/instructions/editinstructions->greenlandic government  information page</a>. rntravelers are not required to self-quarantine upon arrival in greenland or re-test for  after arrival. however, additional  tests may be required depending on where in greenland you intend to travel. visit the <a href=-https://nun.gl/emner/english/travel_to_greenland?sc_lang=da->greenlandic government  information page</a> for detailed information."
    },
    {
        "country": "Grenada",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/gd.svg?v=b8a56b57c24b19bcb5d7f77f3f41db732c4b4e8b&amp;cluster=4",
        "iso_alpha2": "gd",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>grenada has resumed commercial flights.Grenada has resumed commercial flights.All travelers must have a printed or electronic copy <a href=-https://travelauth.health.gov.gd/->Pure Safe Travel Certificate</a>. The application must be submitted no later than 48 hours prior to the date of travel.travelers must have a medical certificate with a  pcr test result issued within 72 hours prior to the date of travel. children under the age of 5 are exempt from presenting a  pcr test result.Travelers are required to have a confirmed reservation at an <a href=-https://www.puregrenada.com/pure-safe-travels/->Approved Accommodation</a> or Apply for Home Quarantine at least 7 days prior to travel. Home Quarantine requests are made via the Pure Safe Travel portal.travelers must download contact tracing app <a href=-https://play.google.com/store/apps/details?id=com.outsys.supportapp->-ronatrac mobile app-</a> and register prior to travel, the app is not available for iphone users yet, and they are currently exempt from this requirement.rnrnAll travelers are subject to health screening on arrival.all travelers are subject to a mandatory 7-day quarantine and  testing on day 4 of the quarantine period. if the test result is negative, they will receive official notification of clearance from quarantine. travelers who test positive may be transferred to an isolation or treatment facility.After receiving medical clearance they must continue to self-monitor for the remaining 14 days using the self-monitoring App.for more information, check the <a href=-https://19.gov.gd/travel-/->traveler's guide</a> on the ministry of health website."
    },
    {
        "country": "Romania",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/ro.svg?v=958ab267d74376ff3552f62b30400459cac45ddd&amp;cluster=4",
        "iso_alpha2": "ro",
        "report1": "Romania has restricted the entry of all travelers who are not nationals of Romania, the EEA countries, Switzerland, or the United Kingdom.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>romania has restricted the entry of all travelers who are not nationals of austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland, italy, latvia, liechtenstein, lithuania, luxembourg, malta, the netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland, or the united kingdom.Romania has restricted the entry of all travelers who are not nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, the Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland, or the United Kingdom.Romanian nationals and their families, residence permit holders, and long-stay visa holders may still enter the country.Nationals of EEA Member States, Switzerland, and the United Kingdom with a residence in Romania may also enter the country.diplomats, transport personnel, military personnel, humanitarian aid workers, travelers in family emergencies, and travelers in need of international or other humanitarian protection may also enter the country. for more information on the exceptions for travel to romania, check <a href=-http://eviza.mae.ro/19->here</a>.the romanian government is issuing and updating a list of countries for which  travel restrictions have been lifted, as well as those with high risk. information on this can be found <a href=-http://www.cnscbt.ro/index.php/liste-zone-afectate-->here</a> (in romanian).People traveling from high risk countries must enter a 14-day quarantine on arrival, while those arriving from low risk areas are exempted from quarantine."
    },
    {
        "country": "Russia",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/ru.svg?v=25b2e09dd44f0c5d24c1fcb113b19122ad11f70b&amp;cluster=4",
        "iso_alpha2": "ru",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>russia has restricted the entry of all travelers who are not russian nationals, permanent residents, residents with residence permits, airline crew members, diplomats, members of international organizations based in russia, and travelers whose visit concerns the death of a direct relative.Russia has restricted the entry of all travelers who are not Russian nationals, permanent residents, residents with residence permits, airline crew members, diplomats, members of international organizations based in Russia, and travelers whose visit concerns the death of a direct relative.The Russian government allows entry of foreigners for medical treatment or in order to care for relatives in Russia. Travelers with a close family member who is a Russian national may enter the country, but must provide supporting documentation of their relationship. Travelers may transit through Russian airports, as long as they are not entering the country.Nationals and residents of the UK, Belarus, Cuba, Egypt, Ethiopia, Japan, Kazakhstan, Kyrgyzstan (not traveling on flights SU1883 and SU1895), Maldives, Serbia, Seychelles, South Korea, Switzerland, Tanzania, Turkey, UAE arriving directly from their country and not via a third-party nation are permitted to enter Russia, providing they have a valid visa, can demonstrate their citizenship or residence, and comply with other entry requirements.foreign travelers must have a medical certificate with a negative  () pcr test result issued within 72 hours before arrival. the medical certificate must be issued in russian or in english. a notarized translation to russian is accepted.Travelers entering Russia for permanent work purposes including Highly Qualified Specialist (HQS) visa holders are subject to a 14-day self-isolation upon arrival. All other arrivals are not required to self-isolate if arriving on a regularly scheduled flight, provided they can show a negative test certificate.travelers who do not provide the above documentation will be required to take a pcr test for  at their own expense within three days of arriving in russia.however, if travelers develop any symptoms  and/or test positive of , they will be required to self-isolate until recovered and tested negative for  on a pcr test."
    },
    {
        "country": "Rwanda",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/rw.svg?v=d0a97403a2b17a8ff9613b02b1ce758e0f08995e&amp;cluster=4",
        "iso_alpha2": "rw",
        "report1": "Rwanda has reopened its airports. Travelers must bring a negative PCR test and will be tested again on arrival.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>rwanda's airports reopened on august 1.Rwanda's airports reopened on August 1.travelers and airline crew must have a medical certificate with a negative  rt-pcr test result issued within 120 hours before their departure. only rt-pcr tests will be accepted, and the certificate must be clearly marked as such.Travelers must complete a <a href=-https://rbc.gov.rw/travel/->Public Health Passenger Locator Form</a>. Travelers will receive a confirmation email with their Unique Health Code (UHC) which they will present upon arriving in Rwanda.On arrival, they will have to take a second test and enter quarantine at a designated hotel for 24 hours while awaiting its results. Designated hotels can be found in the <a href=-https://rdb.rw/wp-content/uploads/2020/07/Info-note-for-passengers-arriving-in-Rwanda-b.pdf->Government of Rwanda guidance</a>. The test will cost USD 50. Travelers may leave the quarantine once receiving a negative testing result. If the results are positive, they will be required to enter a government treatment facility.travelers transiting through rwanda must have a medical certificate with a negative  rt-pcr test result issued within 120 hours before their departure."
    },
    {
        "country": "Rxc3xa9union",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/re.svg?v=a38f98691fd2454c377951bf04008e9f8209a789&amp;cluster=4",
        "iso_alpha2": "re",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>rxc3xa9union has reopened its airports.Rxc3xa9union has reopened its airports.all travelers over the age of 11 must show a negative test result for  issued within 72 hours before departure for rxc3xa9union.travelers must also provide a self-certified document affirming that they have no  symptoms and that to their knowledge they have not been in contact with any person confirmed positive within the last 14 days.Airlines will refuse boarding to anyone who does not produce both proof of a negative result and the self-certified document."
    },
    {
        "country": "Saint Vincent and the Grenadines",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/vc.svg?v=fb126799a50397452ca73b502cd3315dee90b7c8&amp;cluster=4",
        "iso_alpha2": "vc",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>st. vincent and the grenadines has reopened its airport.St. Vincent and the Grenadines has reopened its airport.travelers entering st. vincent and the grenadines must have a medical certificate with a negative  rt-pcr test result issued at most 5 days before arrival.A completed <a href=-http://health.gov.vc/health/->-Pre-Arrival form-</a> must be presented upon arrival.Travelers must have a <a href=-http://health.gov.vc/health/images/PDF/Approved_Accommodations_for_Quarantine_List_24_OCT_2020.pdf->quarantine hotel reservation</a> made for 5 days.travelers are subject to undertake  rt-pcr upon arrival in svg and a 5-day quarantine in a tourism authority/mohwe approved transition/quarantine hotel at their own expense.Travelers must be retested between day 4 and 5 of quarantine the quarantine period.Travelers must continue 9-16 monitored days in anrnapproved home/hotel/vessel at the discretion of the Port Health Officer.travelers transiting st. vincent and the grenadines must have a medical certificate with a negative  () pcr test result issued within 5 days before arrivaltravelers intending to transit through another country from st. vincent and the grenadines are advised to visit the countryxe2x80x99s travel website to determinernthe requirements for travel: <a href=-https://www.nowgrenada.com/2020/07/protocol-fortravellers-into-grenada/->grenada</a>, <a href=-https://visitantiguabarbuda.com/travel-advisory/->antigua</a>, <a href=-https://www.visitbarbados.org/-travel-guidelines2020->barbados</a>, <a href=-https://www.stlucia.org/en//->st. lucia</a>.for more information check the <a href=-http://www.gov.vc/index.php/visitors/-protocols->government of saint vincent and the grenadines website</a>."
    },
    {
        "country": "Samoa",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/ws.svg?v=de7847fbb496af1921e86da04ffa80b6b128cd3f&amp;cluster=4",
        "iso_alpha2": "ws",
        "report1": "Samoa has restricted entry of all travelers except permanent residents and essential workers.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>samoa has restricted entry of all travelers except permanent residents and essential workers.Samoa has restricted entry of all travelers except permanent residents and essential workers.travelers from new zealand are required: to complete the health declaration card in flight; to have a  test within three days before arrival; and to undergo a medical examination by a registered medical practitioner within three days before arrival.travelers must have a negative  test to board the plane and must not exhibit any  symptoms. face masks must be worn on the plane.all travelers are required to present a hard copy of a  test and medical report on arrival to health officers. failure can result in denial of entry, with individuals returned to the point of departure before samoa.All travelers from outside of New Zealand must spend 28 days in New Zealand before onward travel to Samoa and must comply with all requirements. All passengers entering Samoa from New Zealand will be quarantined for 14 days at a designated facility."
    },
    {
        "country": "Serbia",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/rs.svg?v=4c677ae7482bc0367dc85f31393d8ec716795579&amp;cluster=4",
        "iso_alpha2": "rs",
        "report1": "Serbia has reopened its borders. Travelers entering Serbia from Croatia, North Macedonia, Bulgaria or Romania, excluding Serbian nationals, must arrive with a negative PCR test taken in the 48 hours before arrival.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>serbia has reopened its borders. incoming travelers will be provided on arrival with instructions on preventing the spread of . if you have booked, or are looking to book, flights between serbia and another country, you should be aware that changes and cancellations are possible as flights restart.rnserbia has reopened its borders. incoming travelers will be provided on arrival with instructions on preventing the spread of . if you have booked, or are looking to book, flights between serbia and another country, you should be aware that changes and cancellations are possible as flights restart.rnfrom september 18, serbian citizens, as well as foreigners in serbia are required to take a self-assessment test at <a href=-https://www.e-zdravlje.gov.rs/landing/->e-zdravlje.gov.rs</a> upon arrival to determine whether they report to a  clinic, print or save the results of the self-assessment as proof that it was completed, and take another self-assessment test on the 10th day of arrival.rnrnprevious requirements from august 14 remain in place. all travelers entering serbia from croatia, north macedonia, bulgaria or romania must arrive with a negative pcr test taken in the 48 hours before arrival except serbian nationals, crew members and travelers transiting for less than 12 hours, children under age 12 accompanied by parents who have valid pcr test results and properly accredited diplomats and their families.rnForeign nationals who have a temporary stay authorization in Serbia which expired after March 15, 2020 will be allowed to enter the Republic of Serbia until July 1, 2020. They can legally submit a request for extension of their temporary stay within 30 days from their arrival in Serbia.rn"
    },
    {
        "country": "Seychelles",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/sc.svg?v=78056b54c5d46ffe57c6b9723d7d6c126da8e6be&amp;cluster=4",
        "iso_alpha2": "sc",
        "report1": "Seychelles has lifted travel restrictions for travelers arriving from a select group of countries. Travelers from special status countries will be allowed to travel to Seychelles under specific conditions.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>seychelles has begun to ease its travel restrictions, having reopened its borders to commercial flights from certain areas from august 1. rnrnthe department of health in seychelles has published a list of originating countries considered low to medium risk. travelers originating in countries that are considered high risk will not be permitted entry until further notice. travelers intending to travel to the seychelles should check <a href=-http://tourism.gov.sc/-guidelines/->seychelles government updates</a>, and contact their airline to confirm they will be allowed to enter. non-residents must have a hotel reservation confirmation.rnrnfrom 1 october, travelers from the uk, france, germany, italy, switzerland, austria and the uae will be allowed to travel to seychelles under specific conditions.rnseychelles has begun to ease its travel restrictions, having reopened its borders to commercial flights from certain areas from august 1. rnrnthe department of health in seychelles has published a list of originating countries considered low to medium risk. travelers originating in countries that are considered high risk will not be permitted entry until further notice. travelers intending to travel to the seychelles should check <a href=-http://tourism.gov.sc/-guidelines/->seychelles government updates</a>, and contact their airline to confirm they will be allowed to enter. non-residents must have a hotel reservation confirmation.rnrnfrom 1 october, travelers from the uk, france, germany, italy, switzerland, austria and the uae will be allowed to travel to seychelles under specific conditions.rnthe department of health has specified separate entry requirements for visitors and for returning residents or work permit holders. a full list of entry guidelines and application forms can be found on <a href=-http://www.health.gov.sc/index.php//guidelines/->department of health website.</a>rnrna completed application for entry into seychelles must be submitted to the public health commissioner before boarding. the form can be obtained at <a href=-http://tourism.gov.sc- target=-_blank->http://tourism.gov.sc</a> .travelers must have a medical certificate with a negative  test result issued at most 72 hours before arrival and are subject to medical screening.rnrntravelers from -special status countries- must present a negative  pcr test taken within 48 hours prior to departure to seychelles and required to stay in one establishment (specifically authorized to accommodate) for the first 5 days after entering seychelles. on the 5th day after arrival, all visitors from xe2x80x9cspecial status countriesxe2x80x9d must have a pcr  test.If the PCR test is negative, they will be free to travel within Seychelles. If the PCR test is positive they will be required to stay in a designated establishment or medical facility until recovery and cleared by the Public Health Authority.Check the updated list at <a href=-http://tourism.gov.sc/->http://tourism.gov.sc/</a>Nationals and residents of Seychelles are subject to quarantine for 14 days.rn"
    },
    {
        "country": "Solomon Islands",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/sb.svg?v=07d5960c71972734712746bcd66bd6f52f78750e&amp;cluster=4",
        "iso_alpha2": "sb",
        "report1": "The Solomon Islands restricted the entry of all travelers who are not nationals or family members of nationals and travelers with prior written authorization issued by the Prime Minister. Travelers will have to show evidence of at least 2 negative tests prior to travelling and present a completed Travelerxe2x80x99s Public Health Declaration Card. Travelers are subject to mandatory testing and quarantine.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>the solomon islands restricted the entry of all travelers who are not nationals or family members of nationals and travelers with prior written authorization issued by the prime minister.The Solomon Islands restricted the entry of all travelers who are not nationals or family members of nationals and travelers with prior written authorization issued by the Prime Minister.prospective travelers must submit request to enter through the office of the secretary to the prime minister or the ministry of foreign affairs and external trad by writing to the head of the governmentxe2x80x99s  committee, permanent secretary james remobatu <a href=-jremobatu@pmc.gov.sb->(jremobatu@pmc.gov.sb)</a>. prospective travelers should clearly describe any special or compelling circumstances.Travelers will have to show evidence of at least 2 negative tests prior to travelling (3 if travelling from high risk countries).Travelers must present a completed Travelerxe2x80x99s Public Health Declaration Card and provide full details of their place of stay, travel itinerary and current personal contact details in Solomon Islands.Upon arrival, travelers are subject to a 14-day quarantine in one of the local hotels, at their own expense.all passengers will undertake at least 3  tests before being permitted to leave quarantine."
    },
    {
        "country": "Spain",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/es.svg?v=aea48faa62006469e6b89bc05ec24f9ccd2d6a90&amp;cluster=4",
        "iso_alpha2": "es",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>spain has reopened its borders to travelers from most eu and schengen area countries; however, entry remains restricted to travelers arriving from other areas, except for spanish nationals and residents, and accompanying immediate family members.Spain has reopened its borders to travelers from most EU and Schengen Area countries; however, entry remains restricted to travelers arriving from other areas, except for Spanish nationals and residents, and accompanying immediate family members.As of July 22, travelers arriving from Montenegro and Serbia are no longer allowed to enter Spain.For travelers arriving from outside the EU, only the following categories of travelers may enter:xe2x80xa2Habitual residents in the European Union, Schengen Associated States, Andorra, Monaco, The Vatican, or San Marino.rnxe2x80xa2Holders of a long-term visa issued by a Schengen member of Schengen Associated State who are going to that country.rnxe2x80xa2Health professionals coming to Spain for work.rnxe2x80xa2Goods and transport personnel in the practice of their duties.rnxe2x80xa2Diplomats, consular, international officials, military personnel, civil protection and members of humanitarian organizations in the practice of their duties.rnxe2x80xa2Students who study in one of the EU/Schengen member states and possess the appropriate visa or equivalent permit and medical insurance. They may enter the country 15 days prior to the start of their studies.rnxe2x80xa2Highly qualified workers, including participants in high-level sporting events that take place in Spain.rnxe2x80xa2People traveling for duly accredited family reasons.rnxe2x80xa2People traveling for duly accredited humanitarian reasons of reasons of force major.rnxe2x80xa2Residents of Australia, Canada, Georgia, Japan, New Zealand, Rwanda, South Korea, Thailand, Tunisia, or Uruguay, provided that they have come directly from these countries or only made international transits at airports outside of these countries.from november 23, all travelers (including children) arriving from albania, andorra, argentina, armenia, aruba, austria, bahrain, belgium, belize, bosnia and herzegovina, bulgaria, cape verde, colombia, costa rica, croatia, cyprus, czechia, denmark, estonia, france, french polynesia, georgia, germany, gibraltar, greece, guam, hungary, iceland, ireland, italy, jordan, kuwait, latvia, lebanon, libya, liechtenstein, lithuania, luxembourg, malta, moldova, monaco, morocco, netherlands, north macedonia, norway, palestinian territory, panama, poland, portugal, puerto rico, romania, russia, san marino, serbia, slovakia, slovenia, st. martin, sweden, switzerland, tunisia, uae, uk, ukraine and us, must present a medical certificate with a negative  pcr test result issued within 72 hours prior to arrival with the exception of travelers arriving from azores in portugal; rogaland, more og romsdal, nordland, viken, innlandet, vestfold og telemark, agder, vestland, trondelag or troms og finnmarkin in norway; kitri, ionia nisia, dytiki ellada or sterea ellada in greece; faroe island or greenlandSpain has reopened its borders to travelers from the EU, the Schengen area, and the UK. Travelers arriving from the aforementioned areas are no longer required to present a residency certificate or to self-isolate upon entry into Spain; however they will need to complete an -FCS health control form- 48 hours before arrival at <a href=-https://www.spth.gob.es/- target=-_blank->https://www.spth.gob.es/</a>. A QR code generated from the completed form must be presented upon arrival.Travelers will also undergo a temperature check and visual health assessment.from november 14, travelers visiting the canary islands and are booked into regulated tourist accommodation must present a negative  test taken no more than 72 hours earlier, when checking in to their accommodation, download and activate the <a href=-https://www.gobiernodecanarias.org/principal//radar/->radar  notification app</a> throughout their stay on the islands, and for 15 days after they return home. children under the age of 7 are exempt from these requirements.Residency permits and D visas that expired between December 14, 2019 and June 21, 2020 are accepted for entry."
    },
    {
        "country": "Taiwan",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/tw.svg?v=320f45b85c1ee62ff9586ef5a53a88e03ed5506d&amp;cluster=4",
        "iso_alpha2": "tw",
        "report1": "Taiwan has begun to reopen its borders to foreign nationals - they must apply for a special entry permit before traveling.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>taiwan has begun to reopen its borders to foreign nationals, provided they are traveling for reasons other than study, tourism or to visit friends. all visa waivers have been suspended, so travelers must apply for a special entry permit with a taiwan representative office overseas before traveling.Taiwan has begun to reopen its borders to foreign nationals, provided they are traveling for reasons other than study, tourism or to visit friends. All visa waivers have been suspended, so travelers must apply for a special entry permit with a Taiwan representative office overseas before traveling.Travelers who already hold a valid Alien Resident Certificate (ARC) or Alien Permanent Resident Certificate (APRC) do not require a visa to enter Taiwan.starting from december 1, until february 28, all travelers, including transit passengers, regardless of nationality and travel purpose must present a medical certificate with a negative  rt-pcr test result issued within 72 hours prior to departure to taiwan.foreign nationals must have a medical certificate in english with a negative  rt-pcr test result issued within 72 hours prior to departure to taiwan.Travelers must complete and submit a <a href=-https://hdhq.mohw.gov.tw/->-Quarantine System for Entry Form-</a> before departure.the following visitors may be exempted from negative  test: personnel on diplomatic or official business, migrant workers, students, those coming to taiwan for emergency situations, and crewmembers on vessels arriving in taiwan.Passengers arriving from the Philippines are subject to medical screening on arrival.Travelers are subject to a 14-day home quarantine.from november 9, all travelers arriving into taiwan must declare if they have had  symptoms in the last 14 days. if they report symptoms, they are subject to pcr test at the airport or a hospital immediately upon arrival. if they test negative, they must have a second test after 24 hours. they are subject to quarantine at a designated quarantine facility while awaiting for both results. if they receive two negative results, they will be able to leave the quarantine facility and carry out the 14-day self-isolation at home or in a designated quarantine hotel. a positive test will mean hospitalization.During the quarantine period, the individual is to stay home (or at the designated location) and may not use public transportation or leave Taiwan. Travelers may be asked to install a local SIM card if they do not already have one. Mobile phone location monitoring will be used as part of the quarantine management process by local authorities. Short-term business travelers may apply for a shortened period of home quarantine.Foreign passengers, including people from Hong Kong and Macau, are now allowed to transit through Taoyuan International Airport. Holders of Peoplexe2x80x99s Republic of China (PRC) passports will not be permitted to transit in Taiwan. Those transiting will need to board connecting flights of the same airline company they fly in on. Transits must last less than 8 hours. Transit passengers who need to wait for more than one hour will remain separate from other passengers and stay in a separate area. For more information on Taiwan's travel restriction policy, see <a href=-https://www.cdc.gov.tw/En/Bulletin/Detail/pis3aYhaXkLCDrN8XV-9KQ?typeid=158->here</a>."
    },
    {
        "country": "Tajikistan",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/tj.svg?v=7e7eb3bb90c6c4318b73fbc84f564b4d0de24b59&amp;cluster=4",
        "iso_alpha2": "tj",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>travelers are not allowed to enter tajikistan with the exception of tajikistan nationals, residents and their family members and foreign travelers who obtain a tajik visa prior to entering tajikistan.Travelers are not allowed to enter Tajikistan with the exception of Tajikistan nationals, residents and their family members and foreign travelers who obtain a Tajik visa prior to entering Tajikistan.Most flights to Tajikistan are suspended with the exception of flights arriving from China, Turkey and the UAE (Dubai).travelers must have a medical certificate with a negative  pcr test result issued within 72 hours before arrival. children under age of 3 are exempt from presenting a  pcr-rt test result.Test results are verified in Dubai before passengers are allowed to board flights to Dushanbe.Travelers arriving from Dubai will not be subject to quarantine.all arriving travelers without a medical certificate with a negative  pcr test result are subject to testing. these travelers will be subject to quarantine until return of negative test results.Airline crew are subject to quarantine until their next flight."
    },
    {
        "country": "Tanzania",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/tz.svg?v=e8c26413eed8cb862f8022ebc6f79c72ac891710&amp;cluster=4",
        "iso_alpha2": "tz",
        "report1": "Tanzania has not implemented any entry restrictions, but all arriving travelers are subject to medical screening upon arrival.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>tanzania has not implemented any entry restrictions, but all arriving travelers are subject to medical screening upon arrival and the government is collecting tracking information for all internationalxc2xa0travelers.Tanzania has not implemented any entry restrictions, but all arriving travelers are subject to medical screening upon arrival and the government is collecting tracking information for all internationalxc2xa0travelers.the government of tanzania is implementing temperature scanning for all international passengers arriving into tanzania. travelers who show symptoms of  on arrival may be required to take a test.rnrntravelers must complete a health surveillance form on the plane and submit it to the port health authorities upon arrival.Travelers and airline crew are subject to medical screening.travelers who are tested for  on arrival may be required to self-isolate for 14 days."
    },
    {
        "country": "Thailand",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/th.svg?v=65f78bb9e372795bec3ff40f78030160222e3e33&amp;cluster=4",
        "iso_alpha2": "th",
        "report1": "Thailand has restricted the entry of most foreign nationals.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>thailand has restricted the entry of foreign nationals except those in the following categories:Thailand has restricted the entry of foreign nationals except those in the following categories:xe2x80xa2 diplomats, people belonging to international organizations, or government representatives performing duties in thailand, or who have permission from the ministry of foreign affairs. rnxe2x80xa2family members of the above.rnxe2x80xa2work permit holders or those who have already been granted permission from the thai government to work in thailand or have the certificate of residence and a valid re-entry permit.rnxe2x80xa2family members of the above.rnxe2x80xa2spouses, children or parents of thai nationals.rnxe2x80xa2people seeking medical treatment in thailand (except treatment for ), or who are caring for someone seeking medical treatment in thailand.rnxe2x80xa2international students studying in thailand, or their parents/guardiansrnxe2x80xa2people with a special exemption authorized by the prime minister or permanent secretary of ministry of foreign affairs.rnxe2x80xa2airline pilots and crew members with a fixed travel schedule.rnxe2x80xa2cargo transporters (must leave the country immediately after their mission is completed).rnxe2x80xa2holders of foreigners work permit (wp3) and/or boi certificate. people in this category should contact their local royal thai embassy or consulate for a permit to travel to thailand. the civil aviation authority of thailand (caat) will arrange seats aboard repatriation flights for eligible passengers.Eligible travelers wishing to travel to Thailand should apply for permission to travel via the Royal Thai Governmentxe2x80x99s <a href=-https://coethailand.mfa.go.th/regis/step?language=en->online platform</a>.certain categories of foreigners arriving in thailand will be tested for  on entry.All travelers to Thailand are required to complete 14 days quarantine at a State Quarantine or <a href=-https://thaiembdc.org/asq/->Alternative State Quarantine (ASQ) facility</a>.travelers may be required to download the <a href=-https://www.thaichana.com/->thai chana  tracking app</a> on arrival in thailand."
    },
    {
        "country": "Togo",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/tg.svg?v=c6d0682e8fc3e1cf82becd1cf09c0e17e2815724&amp;cluster=4",
        "iso_alpha2": "tg",
        "report1": "Togo has reopened its borders to limited commercial flights. Travelers will be tested on arrival.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>togo has reopened its borders to limited commercial flights.Togo has reopened its borders to limited commercial flights.all travelers arriving in togo must show proof of a negative  pcr test taken no more than 7 days prior to boarding. on arrival, they will be subject to another mandatory  pcr test.travelers must complete an <a href=-https://voyage.gouv.tg/?language=en->online immigration and health form</a> prior to traveling, where they will have to pre-pay for the on-site  test, which costs cfa 40,000 (approximately usd 70). they will need a print-out of the electronic receipt to be allowed to board the aircraft.the  pcr test will be carried out on arrival at lomxc3xa9 international airport. before leaving the airport, travelers must download the togo safe application and add the location where they will self-isolate until receiving their test results. test results should arrive within 24 hours. those with positive test results will be required to self-isolate either at home or at a government facility until they test negative."
    },
    {
        "country": "Tonga",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/to.svg?v=6e31e6e30b2c0acc5714974d62078c946a73bc02&amp;cluster=4",
        "iso_alpha2": "to",
        "report1": "Tonga has restricted the entry of all foreign nationals.",
        "report2": "<b id=-entryRestrictions->Entry restrictions</b><p>Tonga has restricted entry of all travelers except Tongan nationals returning by special arrangement.Tonga has restricted entry of all travelers except Tongan nationals returning by special arrangement."
    },
    {
        "country": "Trinidad and Tobago",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/tt.svg?v=14a911ea73ed85733a48fbcbf4f9afad5575a2fc&amp;cluster=4",
        "iso_alpha2": "tt",
        "report1": "Trinidad and Tobago has closed its airports.",
        "report2": "<b id=-entryRestrictions->Entry restrictions</b><p>Trinidad and Tobago has closed its airports.Trinidad and Tobago has closed its airports."
    },
    {
        "country": "Tunisia",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/tn.svg?v=cf0514869cb7572009f9a509383ce1dffbc9a300&amp;cluster=4",
        "iso_alpha2": "tn",
        "report1": "From November 16, all travelers, regardless of what country they fly from, must take a PCR test within 72 hours of their departure and present the negative test results at the airport upon arriving in Tunisia.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>tunisia has resumed commercial flights. currently there are no restrictions on travelers entering tunisia.Tunisia has resumed commercial flights. Currently there are no restrictions on travelers entering Tunisia.From November 16, all travelers, regardless of what country they fly from must follow the requirement that applies to all people arriving in Tunisia.travelers must have a medical certificate with a negative  pcr test result issued within 72 hours prior to travel and present it to the authorities upon arrival in tunisia. children under the age of 12 are exempt from presenting a  pcr test result.Travelers must complete a <a href=-https://app.e7mi.tn/language->Health Declaration Form</a> before traveling.Travelers must download and use the Tunisian government's <a href=-https://e7mi.tn/index_fr.html?fbclid=IwAR1GzwwSAjCVdndRqzu34oDHKtHVTAMWyYhvuihH4I-7b8khnEH3ZJo7mcI->Track and Trace App</a> on their mobile phone.Foreign nationals must have a confirmed hotel reservation.Travelers must self-isolate for 14 days at their place of residence, government-approved hotel or a quarantine facility, at their own expense.All arriving travelers are subject to a medical screening on arrival, and could be randomly selected for rapid test. Travelers who receive a positive result from the test are subject to a 14-day quarantine in a government-approved hotel or quarantine facility, at their own expense.Travelers may undertake a second PCR test after 7 days, if the result of the test is negative, they will be permitted to leave the quarantine.A small number of transit flights are operating through Tunisia. Travelers transiting through Tunisia must comply with sanitary measures and temperature checks."
    },
    {
        "country": "Turkey",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/tr.svg?v=410bd9e2f89cc3cd11d0b85c6848b3ffbdc4037c&amp;cluster=4",
        "iso_alpha2": "tr",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>turkey has now lifted most of its  travel restrictions, but travelers who are not turkish residents or nationals may not enter turkey if arriving from afghanistan or bangladesh.turkey has now lifted most of its  travel restrictions, but travelers who are not turkish residents or nationals may not enter turkey if arriving from afghanistan or bangladesh.nall arrivals into turkey will be subject to a medical evaluation for symptoms of , including temperature checks. travelers with symptoms will be required to undergo a pcr test. travelers who test positive will be provided with medical treatment at a facility determined by the ministry of health or, if preferred, at a private medical facility in turkey at their own expense.rnrntravelers are required to complete a passenger locator form prior to arriving in turkey.All travelers are required to wear a face mask at all times whilst in an airport, and for the duration of all flights to and from Turkey. rn"
    },
    {
        "country": "Turkmenistan",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/tm.svg?v=cb8796e16949eedeb49a0b0c9d33cf99f4d24bb6&amp;cluster=4",
        "iso_alpha2": "tm",
        "report1": "Turkmenistan has suspended all flights into the country.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>turkmenistan has suspended all flights into the country, except for repatriation flights for turkmen nationals, accredited diplomats, permanently registered foreigners and some employees of international companies and organizations.Turkmenistan has suspended all flights into the country, except for repatriation flights for Turkmen nationals, accredited diplomats, permanently registered foreigners and some employees of international companies and organizations.Internationalxe2x80xafflight restrictions are expected to continue at least throughxe2x80xafNovember 1.rntravelers are required to have a health report issued within 72 hours of departure from the health organizations of the country they are arriving from that shows that they have undergone the  () check and tested negative.rnThey will be subject to a 14-day quarantine upon entering the country.rn"
    },
    {
        "country": "Turks and Caicos Islands",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/tc.svg?v=4e71cbed5c02dd63b2f9b997ff3a7b28272f57dc&amp;cluster=4",
        "iso_alpha2": "tc",
        "report1": "Turks and Caicos has reopened its airports.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>turks and caicos reopened its airports.Turks and Caicos reopened its airports.all travelers over age 10 except merchant seamen and airline crew must have a <a href=-http://turksandcaicostourism.com->travel authorization</a> completed 72 hours before departure, and a medical certificate with a negative pcr test for  from within the last 5 days before arrival in the turks and caicos islands. they must also have proof of health/travel insurance with  cover (including cover for any necessary in-country medical treatment, quarantine costs or repatriation/medevac) and must complete a health screening questionnaire.All visitors will be required to wear masks on arrival to the Turks and Caicos Islands.Travelers are subject to medical screening and quarantine for 14 days on arrival."
    },
    {
        "country": "Tuvalu",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/tv.svg?v=b7bddcd5e7398e20116d155586380e7b76dcccde&amp;cluster=4",
        "iso_alpha2": "tv",
        "report1": "Tuvalu has closed its borders.",
        "report2": "<b id=-entryRestrictions->Entry restrictions</b><p>Tuvalu has closed its borders.Tuvalu has closed its borders."
    },
    {
        "country": "U.S. Virgin Islands",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/vi.svg?v=33b69e50a0fbbd97a7a4907329c8b378ec941f32&amp;cluster=4",
        "iso_alpha2": "vi",
        "report1": "The US Virgin Islands has reopened its borders.rnAll arriving travelers are subject to medical screening and quarantine",
        "report2": "<b id=-entryRestrictions->Entry restrictions</b><p>The US Virgin Islands has reopened its borders.The US Virgin Islands has reopened its borders.All arriving travelers are subject to medical screening and quarantine."
    },
    {
        "country": "Uganda",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/ug.svg?v=0c66f162cfbb95033f7162b76eaf6d90a57c5e1a&amp;cluster=4",
        "iso_alpha2": "ug",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>uganda has reopened entebbe international airport.Uganda has reopened Entebbe International Airport.travelers must present a negative  test certificate issued within 72 hours before boarding the aircraft. travelers without a negative test certificate are not allowed to travel. children under the age of 3 are exempt as long as the accompanying parents have a negative test certificate.travelers and airline crew are subject to medical screening. those presenting with symptoms of any infectious disease will be required to remain in quarantine until a  test is conducted and test results are returned."
    },
    {
        "country": "Ukraine",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/ua.svg?v=2cf1ed34229e251cd033ea8a5470f04b2dfbb94a&amp;cluster=4",
        "iso_alpha2": "ua",
        "report1": "Ukraine has lifted the restrictions on the entry of foreign citizens into the territory of Ukraine. Self-isolation depends on the traveler's country of origin.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>ukraine has lifted the restrictions on the entry of foreign citizens into ukraine.rnrnUkraine has lifted the restrictions on the entry of foreign citizens into Ukraine.rnrnall foreign nationals must have health insurance certificate. such health insurance certificate shall be issued by company registered in ukraine, or foreign insurance company that has a representative office in ukraine and/or is in the treaty relations with insurance company the partner in ukraine. health insurance certificate must cover costs related to  treatment, observation and must be valid during the whole stay of visitor in ukraine.The insurance policy that was purchased through the portal can be postponed for the required period for the tourist. The date change procedure can be performed several times.travelers arriving from countries of the green zone are not required to undergo self-isolation or observation on arrival.rnrntravelers arriving from countries in what the ukrainian authorities call the xe2x80x9cred zonexe2x80x9d (where  case incidence in the previous 14 days has been higher than in ukraine, and/or where the incidence has increased by over 30% in the previous 14 days) are required to undergo 14 daysxe2x80x99 self-isolation proven by the <a href=-https://visitukraine.today/#diya->xe2x80x9cdii vdomaxe2x80x9d</a> tracking app (requires ukrainian mobile phone number), or quarantine in a government-approved facility for 14 days upon arrival.mandatory self-isolation or quarantine is no longer necessary if a traveler undergoes a pcr test and receives a negative result no more than 48 hours in advance of his/her arrival in ukraine, or once in ukraine. children under the age of 12, drivers and crew members of cargo vehicles, buses, train, locomotive, aircraft, sea and river vessels are also not required to undergo self-isolation or quarantine, provided they have not been in contact with a person with .Check the <a href=-https://visitukraine.today/->list of red and green zone countries</a> by clicking the xe2x80x9cmore detailedxe2x80x9d links in the xe2x80x9cfor citizens of green/red zonesxe2x80x9d information boxes.rn"
    },
    {
        "country": "United Kingdom",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/gb.svg?v=edee8579065a25064a1183808f9a26de245fdfa0&amp;cluster=4",
        "iso_alpha2": "gb",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>the united kingdom has not implemented any entry restrictions, but is monitoring direct flights into the country from certain areas.The United Kingdom has not implemented any entry restrictions, but is monitoring direct flights into the country from certain areas.From November 5 to December 2, <a href=-https://www.gov.uk/guidance/new-national-restrictions-from-5-november->National restrictions in England is in effect</a>. Travelling away from home, including internationally, is restricted from England except in limited circumstances such as for work or for education.From November 20, Scotland restricted cross-border travels within the UK, only essential travelsxe2x80x94which includes health reasons, work and for studyxe2x80x94will be allowed to enter and leave Scotland. People living within Level 3 or Level 4 lockdown areas in Scotland are also not permitted to leave their area, and banned from traveling overseas, though people in Level 0-2 are not.different rules apply in <a href=-https://www.gov.scot/publications/--public-health-checks-at-borders/pages/exemptions/->scotland</a>, <a href=-https://gov.wales/exemptions-self-isolation---html->wales</a>, and <a href=-https://www.nidirect.gov.uk/articles/--countries-and-territories-exemptions->northern ireland</a>. travelers must follow all the rules that apply to them.certain areas of the uk and crown dependencies may have specific travel regulations. check the relevant page for information related to travel to <a href=-https://www.jersey.com/visit-safe->jersey</a>, <a -information-=-- href=-https://www.visitguernsey.com/--update/&gt;guernsey&lt;/a&gt;, &lt;a href=- https:=-- visitor-information=-- www.visitisleofman.com=-->isle of man</a>, <a href=-https://www.shetland.org/60n/blogs/posts/-latest-visitor-information->shetland</a>, and <a href=-https://www.orkney.com/->orkney</a>.rnrnAll travelers entering the United Kingdom must present a completed <a href=-https://www.gov.uk/provide-journey-contact-details-before-travel-uk->-Public Health Passenger Locator Form-</a> to immigration upon arrival.The UK government is updating a list of countries from which arriving travelers will not be required to self-isolate upon arrival, unless theyxe2x80x99ve visited or stopped in any other country or territory in the preceding 14 days.the united kingdom announced a mandatory 14-day quarantine for all travelers which started on june 8. freight workers, medical professionals traveling to help with the fight against , and travelers arriving from ireland, the channel islands and the isle of man are exempt from the quarantine requirement.note: the english, scottish, welsh, and northern irish governments may be applying quarantine requirements differently. check for more information on travel to <a href=-https://www.gov.uk/guidance/--travel-corridors->england</a>, <a href=-https://www.gov.scot/publications/--public-health-checks-at-borders/pages/exemptions/->scotland</a>, <a href=-https://gov.wales/exemptions-self-isolation---html->wales</a>, and <a href=-https://www.nidirect.gov.uk/articles/--countries-and-territories-exemptions->northern ireland</a>.All travelers on flights to the UK must wear face coverings on aircraft and on public transport upon arrival thereafter. Passengers using taxis and private hire vehicles should also use a face covering for the duration of their journey. Drivers may refuse to transport passengers who do not follow guidance for safe travel.<a href=-https://www.gov.uk/uk-border-control->rnReview the UK governmentxe2x80x99s entry requirements</a>, and <a href=-https://www.kayak.com/travel-restrictions/united-kingdom/->read more about travel restrictions for the UK</a>."
    },
    {
        "country": "United States",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/us.svg?v=64d1ec0287142a6dbc7e38ac8814cc2181900d59&amp;cluster=4",
        "iso_alpha2": "us",
        "report1": "The United States has restricted the entry of all foreign nationals who have passed through or have been in China, Iran, Most European Countries, UK, Ireland and Brazil in the past 14 days.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>the united states has restricted the entry of all foreign nationals who have passed through or have been in china, iran, most european countries (austria, belgium, czech republic, denmark, estonia, finland, france, germany, greece, hungary, iceland, italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, slovakia, slovenia, spain, sweden, switzerland, monaco, san marino, vatican city), the uk, ireland and brazil in the past 14 days.The United States has restricted the entry of all foreign nationals who have passed through or have been in China, Iran, Most European Countries (Austria, Belgium, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Slovakia, Slovenia, Spain, Sweden, Switzerland, Monaco, San Marino, Vatican City), the UK, Ireland and Brazil in the past 14 days.With the exception of certain travelers which includes certain family members of US citizens or permanent residents including; spouses, children (under the age of 21), parents (provided that his/her US citizen or permanent resident child is unmarried and under the age of 21), and siblings (provided that both the sibling and the US citizen or permanent resident are unmarried and under the age of 21);There is also an exception for travelers with the following visas: A-1, A-2, C-1, C-1/D, C-2, C-3, CR-1, CR-2, D, E-1 (as an employee of TECRO or TECO or the employee's immediate family members), G-1, G-2, G-3, G-4, IR-1, IR-4, IH-4, NATO-1 through NATO-4, or NATO-6 visa;Members of the US Armed Forces, spouses, and children of members of the US Armed Forces;travelers with invitation of the usa government for a purpose related to the containment/mitigation of the  ();Travelers with documents issued by the US Department of Homeland Security, US Customs and Border Protection, or US Department of State indicating that the traveler is exempt from the restriction;B1 crew crewmembers that are engaged in lightering, Outer Continental Shelf (OCS) activity, wind farm activity, private air/sea crew and other similar crewmember activities;Students with an F-1 or M-1 visa and their F-2 and M-2 dependents, if they arrive from or have been in Ireland, the UK or Schengen Area in the past 14 days.travelers returning to the us are advised to stay home as much as possible, avoid being around people and consider getting tested for  after returning from travel and participated in higher risk activities.travelers are subject to  measures set by the state/territory of their final destination. for more information go to <a href=-https://www.cdc.gov/publichealthgateway/healthdirectories/healthdepartments.html->cdc website</a>."
    },
    {
        "country": "Uruguay",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/uy.svg?v=381668d23e406ed8f4ef28bb147edf2897ddb17d&amp;cluster=4",
        "iso_alpha2": "uy",
        "report1": "Uruguay now allows travelers to enter for family reunification reasons.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>uruguayan borders are currently closed, with a few exceptions for family reunification between parents and minor single children or adult children with disabilities, or between spouses or common-law spouses.Uruguayan borders are currently closed, with a few exceptions for family reunification between parents and minor single children or adult children with disabilities, or between spouses or common-law spouses.Drivers for international transportation companies, airplane pilots, and seamen may also enter the country.all travelers and airline crew entering uruguay will need to show a certificate of negative rt-pcr  test, carried out within 72 hours of travel, as well as fill a health affidavit.rnrnTravelers staying longer than 7 days must enter a 7-day isolation. They will be re-tested on day 7 and may leave quarantine with a negative result.travelers must also download the ' oops' for contact tracing, and all non-resident foreigners entering uruguay must have proof of health insurance that covers suspected or actual .Travelers are not allowed to transit with the exception of nationals and residents of Argentina, Brazil, Paraguay transiting through Montevideo (MVD) or Punta del Este (PDP).For more detail, please check the <a href=-https://turismo.gub.uy/index.php/requisitos-de-ingreso-y-tramites->Ministry of Tourism</a> website (in Spanish)."
    },
    {
        "country": "Uzbekistan",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/uz.svg?v=9c84e3eab4bf25875704f0b7ac8da3277db0c304&amp;cluster=4",
        "iso_alpha2": "uz",
        "report1": "",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>uzbekistan has resumed international flights for certain categories of travelers from countries deemed to have a stable epidemiological situation. the complete list of countries includes the eu, japan, south korea, china, israel, malaysia, thailand, singapore, the united arab emirates, turkey, iran, afghanistan, russia and cis countries (armenia, azerbaijan, belarus, kazakhstan, kyrgyzstan, moldova, russia, and tajikistan).rnrntravelers who have spent at least 14 days before travel in the countries listed above may enter/exit uzbekistan if they are:rnrnemployees of embassies and consulates and members of their families, staff of foreign companies and other organizations working in uzbekistan as part of investment projects, people traveling for medical treatment, people with close relatives or seriously ill relatives abroad, people transiting through uzbekistan at the request of embassies and consulates of foreign countries, foreign citizens with residence in uzbekistan, stateless persons, or citizens of uzbekistan with registration in other countries. rnrnUzbekistan has resumed international flights for certain categories of travelers from countries deemed to have a stable epidemiological situation. The complete list of countries includes the EU, Japan, South Korea, China, Israel, Malaysia, Thailand, Singapore, the United Arab Emirates, Turkey, Iran, Afghanistan, Russia and CIS countries (Armenia, Azerbaijan, Belarus, Kazakhstan, Kyrgyzstan, Moldova, Russia, and Tajikistan).rnrnTravelers who have spent at least 14 days before travel in the countries listed above may enter/exit Uzbekistan if they are:rnrnEmployees of embassies and consulates and members of their families, staff of foreign companies and other organizations working in Uzbekistan as part of investment projects, people traveling for medical treatment, people with close relatives or seriously ill relatives abroad, people transiting through Uzbekistan at the request of embassies and consulates of foreign countries, foreign citizens with residence in Uzbekistan, stateless persons, or citizens of Uzbekistan with registration in other countries. rnrntravelers must present a negative  test issued within 72 hours before the entry to uzbekistan.rnQuarantine rules apply differently depending on which country the traveler is arriving from:Japan, South Korea, China and Israel: No quarantine required.rnEuropean Union, Malaysia, Thailand and Singapore: 14-day self-quarantine at home.rnUnited Arab Emirates, Turkey, Iran, Afghanistan, Russia and CIS countries (Armenia, Azerbaijan, Belarus, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan): Government quarantinernAll travelers entering Uzbekistan must wear masks in public at all times."
    },
    {
        "country": "Vanuatu",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/vu.svg?v=c2040a17892e3274a769821fab24469e5de7779a&amp;cluster=4",
        "iso_alpha2": "vu",
        "report1": "Vanuatu has suspended all flights except for humanitarian and repatriation flights.",
        "report2": "<b id=-entryRestrictions->Entry restrictions</b><p>Vanuatu has suspended all flights except for humanitarian and repatriation flights. rnrnAir Vanuatu are running scheduled repatriation flights from Auckland, Brisbane and Noumea between September and December for Vanuatu citizens and permanent residents.Vanuatu has suspended all flights except for humanitarian and repatriation flights. rnrnAir Vanuatu are running scheduled repatriation flights from Auckland, Brisbane and Noumea between September and December for Vanuatu citizens and permanent residents.Travelers arriving on repatriation flights are subject to medical screening and quarantine for 14 days on arrival.rnThere is currently a ban on inter-island travel to and from the main island of Efate."
    },
    {
        "country": "Venezuela",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/ve.svg?v=82a7954f63b2801c66429f09c112f388724b50e4&amp;cluster=4",
        "iso_alpha2": "ve",
        "report1": "Venezuela has suspended all international travel until at least November 12, except humanitarian, medevac and repatriation flights",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>venezuela has suspended all international travel until at least november 12, except humanitarian, medevac and repatriation flights.Venezuela has suspended all international travel until at least November 12, except humanitarian, medevac and repatriation flights.Entry into Venezuela is limited to Venezuelan citizens and foreign national residents.travelers must have a medical certificate with a negative  test results issued within 48 hours prior to arrival.travelers are subject to a  test at port of entry to be administered by local health authorities. if the test is positive, they are subject to quarantine in a state-designated facility."
    },
    {
        "country": "Vietnam",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/vn.svg?v=3cb635a8554a0224b27876a09b848e7b1e07f951&amp;cluster=4",
        "iso_alpha2": "vn",
        "report1": "Vietnam has restricted the entry of all foreign nationals.",
        "report2": "<b id=-entryrestrictions->entry restrictions</b><p>vietnam has restricted all entry to travelers except for citizens, diplomats, and highly skilled workers, experts, business managers, and others who were approved by the national steering committee on  prevention and control. those traveling for official purposes will be subject to medical examination at the border before entering vietnam.vietnam has restricted all entry to travelers except for citizens, diplomats, and highly skilled workers, experts, business managers, and others who were approved by the national steering committee on  prevention and control. those traveling for official purposes will be subject to medical examination at the border before entering vietnam.All visa issuances are suspended. Citizens of Italy, South Korea, Denmark, Finland, France, Germany, Norway, Spain, Sweden, and passengers with a British passport are no longer visa-exempt.rnrnTravelers with a Certificate of Visa Exemption issued by Vietnam residing in China, Denmark, Finland, France, Germany, Iran, Italy, South Korea, Norway, Spain, Sweden, or the United Kingdom are no longer visa-exempt.rnrnCitizens of Belarus, Japan, and Russia with a normal passport or Certificate of Visa Exemption are no longer visa-exempt.All travelers are subject to a 14-day quarantine and must fill out a quarantine form prior to arrival.rn"
    },
    {
        "country": "Wallis and Futuna",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/wf.svg?v=b0a45abccaf5f7dd342eb567d3567e28523e9bcd&amp;cluster=4",
        "iso_alpha2": "wf",
        "report1": "Wallis and Futuna have restricted the entry of all foreign travelers except those with prior approval."
    },
    {
        "country": "Western Sahara",
        "flagurl": "https://content.r9cdn.net/res/images/flags-svg/eh.svg?v=c6be916df7755f0aaa3db825e498bdbe97b4f747&amp;cluster=4",
        "iso_alpha2": "eh",
        "report1": "No information available at this time.",
        "report2": "<b id=-entryRestrictions->Entry restrictions</b><p>No information available at this time.No information available at this time."
    }
]