[
  {
    "continent": "",
    "iso_alpha2": "AE",
    "name": "United Arab Emirates",
    "score": "Partially restricted",
    "updated": "nited Arab Emirates&amp;item_index=46&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>United Arab Emirates<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From July 7, 2020, foreign nationals may enter Dubai for tourism. All persons must carry a certificate issued no more than 96 hours prior to departure showing a negative test result for COVID-19 and undergo additional testing upon arrival in Dubai. Persons currently holding a valid residence visa for Dubai may apply for a return permit from the Federal Authority for Identity and Citizenship (ICA). Issued permits are valid for 21 days from the date of approval. Persons seeking to return to Dubai must apply for a Return Permit for Residents Outside the UAE from the General Directorate of Residency and Foreigners Affairs (GDRFA) – Dubai. More information is available at: https://u.ae/en/information-and-services/justice-safety-and-the-law/handling-the-covid-19-outbreak/travelling-amid-covid-19/travelling-to-the-uaeFrom August 1, 2020, persons arriving in (or transiting through) Abu Dhabi must carry proof of a negative result for COVID-19 issued no more than 96 hours prior to departure using a polymerase chain reaction (PCR) test performed by a UAE-approved testing provider. This policy does not apply to persons 12 years of age or younger, or persons with a recognized disability. Information on approved testing providers is available at the following URL: https://screening.purehealth.ae/application"
  },
  {
    "continent": "",
    "iso_alpha2": "AF",
    "name": "Afghanistan",
    "score": "Entry prohibited",
    "updated": "fghanistan&amp;item_index=14&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Afghanistan<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >All commercial flights have been suspended until further notice."
  },
  {
    "continent": "",
    "iso_alpha2": "AG",
    "name": "Antigua and Barbuda",
    "score": "Partially restricted",
    "updated": "ntigua and Barbuda&amp;item_index=4&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Antigua and Barbuda<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From July 1, 2020, all persons arriving in Antigua and Barbuda by air must carry documentation issued no more than 7 days prior to departure showing a negative result for COVID-19 using a real time reverse transcription polymerase chain reaction (RT-PCR) test. Persons arriving by sea are subject to quarantine measures in accordance with guidelines established by local health authorities. Passengers disembarking in Antigua and Barbuda must complete a health declaration and undergo a health screening for symptoms of COVID-19. All persons, regardless of their mode of transportation, will be monitored for COVID-19 for up to 14 days following their arrival in accordance with local health guidelines. More information is available at the following URL: https://visitantiguabarbuda.com/travel-advisory/"
  },
  {
    "continent": "",
    "iso_alpha2": "AL",
    "name": "Albania",
    "score": "Partially restricted",
    "updated": "lbania&amp;item_index=8&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Albania<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Albania’s land border with Greece is closed until at least July 15, 2020."
  },
  {
    "continent": "",
    "iso_alpha2": "AM",
    "name": "Armenia",
    "score": "Partially restricted",
    "updated": "rmenia&amp;item_index=9&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Armenia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons arriving in Armenia must present proof written in Armenia, English, or Russian of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Persons lacking such proof must undergo testing upon arrival and are required to quarantine while awaiting their results. Upon arrival, all persons are subject to additional testing for COVID-19 and possible quarantine."
  },
  {
    "continent": "",
    "iso_alpha2": "AO",
    "name": "Angola",
    "score": "Entry prohibited",
    "updated": "ngola&amp;item_index=2&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Angola<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Angola until further notice. This policy does not apply to long-term residents, diplomats, or persons engaged in the transportation of cargo, freight, or humanitarian aid. All persons permitted to enter Angola must carry proof of a negative test result for COVID-19 issued no more than 72 hours prior to departure. Upon arrival, all persons must submit a travel registration form and undergo a 7-day quarantine. Travelers arriving at Quatro de Fevereiro International Airport (LAD) in Luanda must undergo a rapid antigen test for COVID-19. More information is available at the following URL: https://viagem.covid19.gov.ao/en/"
  },
  {
    "continent": "",
    "iso_alpha2": "AR",
    "name": "Argentina",
    "score": "Entry prohibited",
    "updated": "rgentina&amp;item_index=1&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Argentina<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Argentina. This policy does not apply to lawful residents. All persons permitted to enter Argentina must present proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test and undergo a 7-day quarantine upon arrival. A nationwide stay-at-home order is in effect until further notice. Most international flights are suspended."
  },
  {
    "continent": "",
    "iso_alpha2": "AS",
    "name": "American Samoa",
    "score": "Entry prohibited",
    "updated": "merican Samoa&amp;item_index=3&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>American Samoa<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >All entry permits are suspended until further notice. Persons authorized to travel to American Samoa must have proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. All persons arriving in American Samoa are subject to a 14-day quarantine. Most international flights are suspended."
  },
  {
    "continent": "",
    "iso_alpha2": "AT",
    "name": "Austria",
    "score": "Entry prohibited",
    "updated": "ustria&amp;item_index=10&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Austria<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From February 22, 2021, foreign nationals are prohibited from entering Austria for non-essential travel. All persons (including Austrian nationals) seeking to travel to Austria must obtain pre-travel clearance from Austrian authorities prior to departure. All persons permitted to travel to Austria from locations considered by the Austrian government as risk areas must carry proof of a negative test result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test and undergo a 10-day self-quarantine upon arrival. This policy does not apply to persons traveling from Australia, Finland, Greece, Iceland, New Zealand, Norway, Singapore, South Korea, and Vatican City. Travelers are strongly encouraged to check with their local Austrian embassy or consulate in order to verify their status prior to making travel arrangements. More information is available at the following URL: https://www.austria.info/en/service-and-facts/coronavirus-information/entry-regulations"
  },
  {
    "continent": "",
    "iso_alpha2": "AU",
    "name": "Australia",
    "score": "Partially restricted",
    "updated": "ustralia&amp;item_index=1&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Australia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From February 21, 2021, foreign nationals are prohibited from entering Australia. This policy does not apply to lawful residents and their immediate family members, persons traveling from New Zealand who normally reside in Australia, persons traveling from New Zealand aboard special Green Safe Travel Zone flights, transit passengers who will remain within Australian jurisdiction for less than 72 hours, diplomats accredited to Australia and their family members, airline crew members, maritime crew members including marine pilots, persons traveling as part of the Seasonal Worker Program or the Pacific Labour Scheme, or persons who hold a Business Innovation and Investment visa. Additional exemptions are possible on a case-by-case basis. Travelers must apply online for an exemption at least 2 weeks prior to their intended departure. Applications for exemption from Australian travel restrictions are available at the following URL: https://travel-exemptions.homeaffairs.gov.au/tepAll persons (including Australian nationals) must, prior to boarding flights bound for Australia, present proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. This policy does not apply to children 4 years of age or younger, or to persons traveling from New Zealand aboard special Green Safe Travel Zone flights, provided such persons have not visited Auckland within 14 days of their scheduled departure for Australia. Additional exemptions exist for international air crew members, and persons arriving from locations where the Australian government has determined PCR testing is not readily available. Upon arrival, all persons must undergo a 14-day quarantine in a designated facility in their port of entry. This policy does not apply to persons traveling from New Zealand aboard special Green Safe Travel Zone flights provided they meet specific criteria, including having remained entirely within New Zealand during the 14 days prior to their scheduled departure (excluding any time spent in quarantine in New Zealand). More information on arrival requirements is available from the Australian Ministry of Health at the following URL: https://www.health.gov.au/news/health-alerts/novel-coronavirus-2019-ncov-health-alert/coronavirus-covid-19-restrictions/coronavirus-covid-19-advice-for-international-travellers"
  },
  {
    "continent": "",
    "iso_alpha2": "AW",
    "name": "Aruba",
    "score": "Partially restricted",
    "updated": "ruba&amp;item_index=2&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Aruba<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From February 8, 2021, foreign nationals traveling from Brazil, Peru, or Venezuela are prohibited from entering Aruba. All persons (including Aruban nationals) must submit an online Embarkation and Disembarkation (ED) card and obtain permission to board transportation bound for Aruba no more than 72 hours prior to their scheduled departure. Persons who hold a passport that requires a visa for travel to Aruba must separately obtain a valid visa prior to departure. An ED card is NOT a substitute for a required visa. All persons (including Aruban nationals) must have proof of a negative result for COVID-19 issued at least 12 hours and no more than 72 hours prior to departure using a nucleic acid test. This policy does not apply to children age 14 years or younger. Foreign nationals must purchase an Aruba Visitors Insurance policy no more than 72 hours prior to departure using the ED card system. Upon arrival, travelers may, at their own expense, be required to undergo additional testing for COVID-19 and to quarantine while awaiting their test results. ED cards are available at the following URL: https://edcardaruba.aw/"
  },
  {
    "continent": "",
    "iso_alpha2": "AZ",
    "name": "Azerbaijan",
    "score": "Partially restricted",
    "updated": "zerbaijan&amp;item_index=15&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Azerbaijan<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons arriving in Azerbaijan will be screened for COVID-19. In cases of suspected exposure, persons will undergo further evaluation and quarantine at a designated facility. All others must self-isolate for 14-days after entry. Chinese and Iranian nationals are prohibited from entering Azerbaijan and the Azerbaijani government has suspended the issuing of new visas to persons holding Chinese or Iranian passports. All land border checkpoints with Iran, Georgia, Russia, and Turkey are closed. Persons wishing to travel to Azerbaijan must apply for a visa at an Azerbaijani embassy or consulate abroad. The issuing of e-visas is suspended."
  },
  {
    "continent": "",
    "iso_alpha2": "BA",
    "name": "Bosnia and Herzegovina",
    "score": "Partially restricted",
    "updated": "osnia and Herzegovina&amp;item_index=13&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Bosnia and Herzegovina<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From September 10, 2020, foreign nationals arriving in Bosnia and Herzegovina must hold proof of a negative test result for COVID-19 issued no more than 48 hours prior to departure."
  },
  {
    "continent": "",
    "iso_alpha2": "BB",
    "name": "Barbados",
    "score": "Partially restricted",
    "updated": "arbados&amp;item_index=6&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Barbados<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Travelers will be screened, those showing symptoms will be quarantined."
  },
  {
    "continent": "",
    "iso_alpha2": "BD",
    "name": "Bangladesh",
    "score": "Partially restricted",
    "updated": "angladesh&amp;item_index=17&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Bangladesh<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >The Bangladeshi government has suspended all visa-on-arrival services until further notice. Foreign nationals must visit a Bangladeshi embassy or consulate abroad and produce a valid medical certificate showing they have not tested positive for COVID-19 in order to obtain a visa. Persons arriving in Bangladesh via air will undergo screening for COVID-19 upon arrival. Foreign nationals arriving from countries impacted by COVID-19 must undergo a 14-day quarantine."
  },
  {
    "continent": "",
    "iso_alpha2": "BE",
    "name": "Belgium",
    "score": "Entry prohibited",
    "updated": "elgium&amp;item_index=12&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Belgium<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Belgium. This policy does not apply to persons traveling for essential reasons. Additional exemptions exist for other limited categories of persons. All persons must carry a sworn statement with them at all times attesting to their essential reasons for travel. Additionally, all persons arriving from a location Belgian authorities consider high-risk for COVID-19 infection must carry proof of a negative test result issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. All persons, regardless of origin, must complete a Public Health Passenger Locator Form within 48 hours of arrival in Belgium. After submitting their locator form, travelers will receive notification as to whether they are obliged to undergo quarantine. Persons arriving from high-risk locations will also receive a code for use when seeking additional testing for COVID-19. More information and sworn statement forms are available at the following URL: https://www.info-coronavirus.be/en/travels/"
  },
  {
    "continent": "",
    "iso_alpha2": "BF",
    "name": "Burkina Faso",
    "score": "Partially restricted",
    "updated": "urkina Faso&amp;item_index=5&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Burkina Faso<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From August 1, 2020, persons arriving in Burkina Faso must carry proof of a negative result for COVID-19 issued no more than 5 days prior to departure using a polymerase chain reaction (PCR) test performed by an approved healthcare service provider in their place of departure."
  },
  {
    "continent": "",
    "iso_alpha2": "BG",
    "name": "Bulgaria",
    "score": "Partially restricted",
    "updated": "ulgaria&amp;item_index=14&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Bulgaria<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals arriving in Bulgaria may need to show proof of a negative result for COVID-19 using a polymerase chain reaction (PCR) test and undergo a 14-day quarantine. This policy does not apply to persons traveling from certain countries / regions. An official list of such locations is available from Bulgarian authorities at the following URL: https://bulgariatravel.org/en/useful/practical-information-for-tourists-covid-19/"
  },
  {
    "continent": "",
    "iso_alpha2": "BH",
    "name": "Bahrain",
    "score": "Partially restricted",
    "updated": "ahrain&amp;item_index=16&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Bahrain<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From September 4, 2020, foreign nationals are prohibited from entering Bahrain. This policy does not apply to lawful residents, citizens from countries or regions in the Gulf Cooperation Council (GCC) who are eligible for visa-free travel to Bahrain, persons eligible to obtain a visa on arrival, persons holding a valid eVisa, diplomats, military personnel, airline crew members, or persons who hold official, service, or United Nations passports. Upon arrival, all persons must, at their own expense, undergo a polymerase chain reaction (PCR) test for COVID-19 and self-isolate while awaiting their test results. Persons intending to remain in Bahrain for more than 10 days must undergo an addition PCR test on the 10th day following arrival. The Bahraini government has announced the resumption of visa-on-arrival services for 68 countries and regions. To determine their eligibility, travelers should visit the following URL: https://evisa.gov.bh/"
  },
  {
    "continent": "",
    "iso_alpha2": "BI",
    "name": "Burundi",
    "score": "Partially restricted",
    "updated": "urundi&amp;item_index=6&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Burundi<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons arriving at Melchior Ndadaye International Airport (BJM) in Bujumbura must have the following: 1) a valid entry visa and a valid residence visa, 2) proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test, and 3) proof of a valid reservation at a specially-designated arrival hotel. All persons must, at their own expense of US$100, undergo an additional PCR test upon arrival and self-isolate for 7 days at a designated hotel. Should any passenger on an arriving flight test positive for COVID-19, all persons on the same fight must undergo a second post-arrival PCR test and self-isolate while awaiting results. Persons who test positive will be transferred to an appropriate care center. All persons seeking to depart Burundi must have proof of a negative PCR test issued no more than 72 hours prior to scheduled departure as well as an invoice showing payment in full of US$100 for testing costs."
  },
  {
    "continent": "",
    "iso_alpha2": "BJ",
    "name": "Benin",
    "score": "Partially restricted",
    "updated": "enin&amp;item_index=3&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Benin<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All non-essential travel to Benin is prohibited. Persons seeking to enter Benin must undergo screening for COVID-19. Those exhibiting symptoms will be quarantined. Persons arriving at Cotonou Cadjehoun Airport (COO) must, at their own expense, undergo testing for COVID-19 upon arrival and again after 15 days. Preregistration and confirmation of payment in full in the amount of 50,000 West African CFA francs are required prior to travel. Persons who test positive will be sent to designated facilities for quarantine and treatment. All travelers must complete a health declaration form. More information including prepayment instructions and health declaration forms is available at the following URL: https://centresurveillancesanitaire.bj/"
  },
  {
    "continent": "",
    "iso_alpha2": "BN",
    "name": "Brunei Darussalam",
    "score": "Partially restricted",
    "updated": "runei Darussalam&amp;item_index=19&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Brunei Darussalam<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering or transiting through Brunei Darussalam. From September 15, 2020, the following categories of persons may apply for an Entry Pass to travel to Brunei Darussalam: essential business or official travelers, students, persons traveling for medical treatment, and persons traveling for compassionate or other special circumstances such as family reunions with Bruneian nationals or lawful residents. All persons traveling with an Entry Pass must hold proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test and self-isolate for up to 14 days upon arrival. Additional information is available at the following URL: http://www.pmo.gov.bn/travelportal/Home.aspx"
  },
  {
    "continent": "",
    "iso_alpha2": "BO",
    "name": "Bolivia",
    "score": "Partially restricted",
    "updated": "olivia&amp;item_index=3&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Bolivia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals who, within 14 days of their scheduled departure, have visited the United Kingdom are prohibited from entering Bolivia. This policy does not apply to lawful permanent residents. All persons arriving in Bolivia must carry proof of a negative polymerase chain reaction (PCR) test result for COVID-19. Results must be issued no more than 72 hours prior to departure for travelers from neighboring countries, no more than 7 days prior to departure for travelers from other locations in the Caribbean and South America, and no more than 10 days prior to departure for travelers from Asia, Europe, and North America."
  },
  {
    "continent": "",
    "iso_alpha2": "BR",
    "name": "Brazil",
    "score": "Partially restricted",
    "updated": "razil&amp;item_index=4&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Brazil<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From January 26, 2021, the entry into Brazil by foreign nationals is restricted to arrivals by air. Foreign nationals who, within 14 days of their intended arrival in Brazil, have visited or transited through South Africa or the United Kingdom are prohibited from entering Brazil. Persons otherwise permitted to enter Brazil who, within 14 days of their intended arrival, have visited or transited through South Africa or the United Kingdom must undergo a 14-day quarantine. Before boarding flights bound for Brazil, all persons (including Brazilian nationals) must present proof written in English, Portuguese, or Spanish of a negative result for COVID-19 issued no more than 72 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. This policy does not apply to children between the ages of 2 and 12 provided they are traveling with an adult companion. Additional exemptions exist for airline crew members provided they adhere to specific health protocols while in Brazilian jurisdiction.All persons must submit a Traveler’s Health Declaration (DSV) and agree to abide by all pandemic prevention measures currently in force. All land and sea border checkpoints are closed to foreign nationals. This policy does not apply to foreign nationals crossing land border checkpoints from Paraguay provided they are in compliance with all relevant immigration provisions including having a valid visa where appropriate. Further exemptions to land border restrictions exist for permanent residents, foreign professionals employed by a non-governmental aid organization recognized by the Brazilian government, foreign officials accredited by the Brazilian government, spouses, domestic partners, sons or daughters, fathers or mothers, or caregivers of a Brazilian citizen, any person whose entrance into Brazil is deemed by the government to be in the public interest, or persons engaged in the transportation of cargo. Persons seeking humanitarian access and cross-border migrant workers may enter with appropriate documentation. DSV forms are available at the following URL: https://formulario.anvisa.gov.br/index.php/register/index?sid=39183"
  },
  {
    "continent": "",
    "iso_alpha2": "BS",
    "name": "Bahamas",
    "score": "Partially restricted",
    "updated": "ahamas&amp;item_index=5&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Bahamas<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons traveling to the Bahamas must show proof of a negative result for COVID-19 issued no more than 5 days prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. This policy does not apply to children 10 years of age or younger. All travelers must apply online for a Bahamas Travel Health Visa prior to departure. This includes a mandatory opt-in for travel health insurance valid for the duration of stay in the Bahamas. Travel Health Visa applications are available at the following URL: https://travel.gov.bs/"
  },
  {
    "continent": "",
    "iso_alpha2": "BT",
    "name": "Bhutan",
    "score": "Entry prohibited",
    "updated": "hutan&amp;item_index=18&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Bhutan<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From March 25, 2020, all land border checkpoints are closed."
  },
  {
    "continent": "",
    "iso_alpha2": "BW",
    "name": "Botswana",
    "score": "Partially restricted",
    "updated": "otswana&amp;item_index=4&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Botswana<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons traveling to Botswana must present proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Persons who lack such proof must, at their own expense, undergo testing and quarantine upon arrival. All land border checkpoints with South Africa are closed. All persons seeking to depart Botswana must obtain proof of a negative PCR test result for COVID-19 issued no more than 72 hours prior to their intended departure. Traveling between domestic regions in Botswana requires special documentation. More information including on domestic travel documentation is available at the following URL: https://covid19.gov.bw/"
  },
  {
    "continent": "",
    "iso_alpha2": "BY",
    "name": "Belarus",
    "score": "Partially restricted",
    "updated": "elarus&amp;item_index=11&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Belarus<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From October 29, 2020, all persons arriving in Belarus must self-isolate for 10 days upon arrival. This policy does not apply to persons arriving from the following countries / regions: Austria, Albania, China, Estonia, Finland, Germany, Greece, Hungary, Italy, Latvia, Monaco, Montenegro, Norway, Serbia, and Spain. An official list from the Belarusian government is available at the following URL: http://minzdrav.gov.by/ru/novoe-na-sayte/Belarusian land border checkpoints with Latvia, Lithuania, Poland, and Ukraine are closed. This policy does not apply to persons holding diplomatic passports or crew members engaged in the cross-border transportation of goods or passengers. To better facilitate arrival, foreign nationals are encouraged to carry proof of a negative result for COVID-19 issued no more than 48 hours prior to departure using a polymerase chain reaction (PCR) test."
  },
  {
    "continent": "",
    "iso_alpha2": "BZ",
    "name": "Belize",
    "score": "Partially restricted",
    "updated": "elize&amp;item_index=7&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Belize<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons arriving in Belize must undergo a polymerase chain reaction (PCR) test for COVID-19. This policy does not apply to persons who carry proof of a negative PCR test result issued no more than 72 hours prior to departure. Persons who test positive must undergo a 14-day quarantine at their own expense. All persons are required to install the latest version of the Belize Travel Health app onto their mobile devices and submit the requested information therein no more than 72 hours prior to departure. A nightly curfew is in effect nationwide between 21:00 (9:00 p.m.) and 05:00 (a.m.). Additional details are available at the following URL: https://www.belizetourismboard.org/news-and-gallery/belize-covid-19-update/"
  },
  {
    "continent": "",
    "iso_alpha2": "CA",
    "name": "Canada",
    "score": "Entry prohibited",
    "updated": "anada&amp;item_index=1&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Canada<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From February 22, 2021, foreign nationals are prohibited from entering Canada. This policy does not apply to lawful permanent residents, persons with special authorization, persons registered under Canada's Indian Act, or protected persons. Further exemptions exist for foreign nationals who are an immediate or extended family member of a Canadian citizen or permanent resident and who intend to remain in Canada for more than 15 days, persons authorized by the Canadian Public Health Agency to enter Canada for compassionate reasons, and persons who meet specific criteria for exemption from Canadian travel restrictions. All persons traveling by air from abroad (including the United States) must arrive at either Calgary International Airport (YYC), Montreal–Trudeau International Airport (YUL), Toronto Pearson International Airport (YYZ), or Vancouver International Airport (YVR).All persons (including Canadian nationals) must present proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Upon arrival, all persons (including those arriving at land border checkpoints) must undergo testing for COVID-19, a 14-day quarantine at a suitable location, and additional testing at the end of the quarantine period. Additionally, persons arriving by air must carry proof of a valid booking for a 3-night stay in a government-authorized hotel. Prior to departure, travelers must submit their personal information and a quarantine plan online via the ArriveCAN website or mobile application. Quarantine plans must include details on how the traveler intends to proceed to their quarantine location, how the traveler will obtain necessary items such as food, and how the traveler will access essential services or medical care if necessary. Border officials will assess this information at the port of entry.Canada’s land border with the United States is closed to all non-essential travel until further notice. Be advised, some province-level authorities in Canada have implemented additional policies and restrictions for persons arriving into their jurisdictions. More information, including about the ArriveCAN system, is available at the following URL: https://www.canada.ca/en/immigration-refugees-citizenship/services/coronavirus-covid19/travel-restrictions-exemptions.html"
  },
  {
    "continent": "",
    "iso_alpha2": "CD",
    "name": "Democratic Republic of the Congo",
    "score": "Partially restricted",
    "updated": "emocratic Republic of the Congo&amp;item_index=12&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Democratic Republic of the Congo<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons must submit a registration form online and obtain a QR code for travel to DR Congo prior to departure. Upon arrival, all persons must, at their own expense of US$45, undergo a polymerase chain reaction (PCR) test for COVID-19. Persons departing Kinshasa for destinations abroad must present their travel documents at the Congolese National Institute for Biomedical Research (INRB) 72 hours prior to their scheduled departure in order to undergo a PCR test for COVID-19. Registration forms are available from the INRB the following URL: https://inrbcovid.com/"
  },
  {
    "continent": "",
    "iso_alpha2": "CF",
    "name": "Central African Republic",
    "score": "Entry prohibited",
    "updated": "entral African Republic&amp;item_index=9&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Central African Republic<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >Persons arriving at Bangui M'Poko International Airport (BFG) must complete a health questionnaire and undergo a 14-day quarantine. The wearing of face masks is mandatory in public spaces."
  },
  {
    "continent": "",
    "iso_alpha2": "CG",
    "name": "Republic of the Congo",
    "score": "Partially restricted",
    "updated": "epublic of the Congo&amp;item_index=13&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Republic of the Congo<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From August 24, 2020, persons arriving in the Republic of the Congo must undergo a reverse transcription polymerase chain reaction (RT-PCR) test for COVID-19 upon arrival. This policy does not apply to persons who carry proof of a negative RT-PCR test result issued no more than 72 hours prior to departure. Persons who test positive on arrival will be transferred to a designated location for treatment. All other persons must self-isolate for 14 days. A daily curfew is in effect from 22:00 (10:00 p.m.) to 05:00 (5:00 a.m.) nationwide, expect for Brazzaville and Pointe-Noire where curfew begins at 20:00 (8:00 p.m.)."
  },
  {
    "continent": "",
    "iso_alpha2": "CH",
    "name": "Switzerland",
    "score": "Partially restricted",
    "updated": "witzerland&amp;item_index=43&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Switzerland<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Switzerland. This policy does not apply to persons who hold a valid Swiss residence permit or to persons (regardless of origin) entitled to freedom of movement in Switzerland. For all other foreign nationals, entry restrictions may apply. All persons must complete an electronic entry form prior to arrival. Persons arriving by air or from countries or regions deemed by the Swiss Federal Office of Public Health to be at increased risk for COVID-19 infection must carry proof of a negative test result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Persons lacking such proof must undergo testing upon arrival in Switzerland. Additionally, all persons arriving from locations with an increased risk must undergo a 10-day quarantine. Additional information is available from the Swiss government at the following URL: https://www.sem.admin.ch/sem/en/home/sem/aktuell/faq-einreiseverweigerung.html"
  },
  {
    "continent": "",
    "iso_alpha2": "CI",
    "name": "Côte d'Ivoire",
    "score": "Partially restricted",
    "updated": "ôte d'Ivoire&amp;item_index=14&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Côte d'Ivoire<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All land border checkpoints are closed until further notice. All persons arriving in Côte d'Ivoire must provide proof of a negative result for COVID-19 issued no more than 5 days prior to departure using a polymerase chain reaction (PCR) test and complete an online travel declaration form at the following URL: http://www.deplacement-aerien.gouv.ci/"
  },
  {
    "continent": "",
    "iso_alpha2": "CK",
    "name": "Cook Islands",
    "score": "Entry prohibited",
    "updated": "ook Islands&amp;item_index=4&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Cook Islands<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >All persons are prohibited from entering into the Cook Islands. This policy does not apply to persons holding a written exemption issued by the Ministry of Foreign Affairs andImmigration. Further exemptions exist for Cook Islanders, lawful permanent residents, persons who hold a valid work permit for the Cook Islands, and persons who hold a valid residence permit for the Cook Islands. All persons authorized to travel to the Cook Islands must, for the 14 days prior to their departure, remain in New Zealand. Additionally, all persons must provide proof of a negative result for COVID-19 issued no more than 96 hours prior to their departure from Auckland, New Zealand."
  },
  {
    "continent": "",
    "iso_alpha2": "CL",
    "name": "Chile",
    "score": "Partially restricted",
    "updated": "hile&amp;item_index=5&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Chile<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From December 31, 2020, all persons (including Chilean nationals) must self-isolate for 10 days upon arrival. Persons who, after 7 days in self-isolation, undergo a PCR test for COVID-19 will be eligible for early release provided their test results are negative. Foreign nationals traveling to Chile must arrive via air at Arturo Merino Benítez International Airport (SCL) in Santiago. All foreign nationals traveling for tourism must: 1) have proof of a negative test result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test, 2) have health insurance valid for use in Chile during their entire stay with coverage sufficient for all expenses related to the treatment of COVID-19, and 3) submit an affidavit online regarding the prevention of COVID-19. Foreign nationals arriving from countries / regions classified by the World Health Organization (WHO) as high-risk for COVID-19 transmission must undergo a 14-day quarantine upon arrival in Chile. Foreign nationals are required to use a mobile contact tracing application, monitor their health status, and comply with all sanitary and pandemic control measures including the use of face masks, prohibitions on movement, and curfews. A nightly curfew is currently in effect nationwide from 00:00 (12:00 a.m.) to 05:00 (5:00 a.m.). The online affidavit is available at the following URL: https://www.c19.cl/"
  },
  {
    "continent": "",
    "iso_alpha2": "CM",
    "name": "Cameroon",
    "score": "Partially restricted",
    "updated": "ameroon&amp;item_index=8&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Cameroon<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From October 6, 2020, all persons traveling to Cameroon must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test."
  },
  {
    "continent": "",
    "iso_alpha2": "CN",
    "name": "China",
    "score": "Partially restricted",
    "updated": "hina&amp;item_index=8&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>China<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Requirements for Travel to Mainland China Entry restrictions for Mainland China vary depending on departure location. All travelers are strongly advised to check with a local Chinese embassy or consulate in each jurisdiction they intend to pass through in order to confirm all testing and document verification requirements. All persons (including Chinese nationals) traveling from abroad to destinations in Mainland China must have proof of dual negative results for COVID-19 using both a nucleic acid test and a serological test for IgM antibodies. Both tests must be performed no more than 48 hours prior to departure and results must be submitted for approval to a local Chinese embassy or consulate. Chinese nationals should upload results into their mobile Health QR Code app in order to obtain a green code containing an HS designation, which they must present to airline staff prior to boarding. Foreign nationals are advised to check with their local Chinese embassy or consulate for instructions on how to submit copies of their negative test results, their passport information page, and a signed health declaration form for inspection and verification. Foreign nationals from certain countries and regions will, upon verification of their information, receive a QR code containing an HDC designation, which they must present to airline staff prior to boarding. Whenever possible, travelers are strongly encouraged to book direct flights to China in order to avoid complications with testing and document verification in connecting locations. Limited exemptions to this policy exist. All persons (including Chinese nationals) must undergo a 14-day quarantine at a designated location upon arrival in Mainland China. This policy includes an option for persons entering via Shanghai to undergo a 7-day quarantine in a designated location followed by 7 days of self-isolation at home. Be advised, many provincial authorities in China have implemented additional policies and restrictions on both Chinese and foreign nationals.Fast Lane Immigration Clearance for Singaporean Nationals Singaporean nationals traveling to one of the following 6 provinces or municipalities in China for business purposes may qualify for special fast lane immigration clearance: Chongqing, Guangdong, Jiangsu, Shanghai, Tianjin, or Zhejiang. To use fast lane, travelers must be sponsored by either a company or a government agency in China, which will file an application on the traveler's behalf with local provincial or municipal authorities. If approved, the traveler will receive an official invitation letter. Travelers must then apply for a visa from the Chinese embassy in Singapore and submit a health declaration to Chinese authorities.No more than 48 hours prior to departure, fast lane travelers must undergo a polymerase chain reaction (PCR) test for COVID-19. Airlines will conduct pre-boarding checks to verify the traveler holds approval for fast lane clearance, a negative PCR test result, a return air ticket, and a valid visa. Failure to produce these documents may result in a denial of permission to board the aircraft.Upon arrival, fast lane travelers will undergo an additional PCR test and a serology test at their own expense. Travelers must then remain in a location designated by the local provincial or municipal government while awaiting their test results. Upon confirmation of a negative test result, the host company or government agency will ensure the traveler is transported between their designated accommodation and workplace for the duration of their stay. Fast lane travelers are required to use the local Health QR code system for the duration of their stay in China. Fast lane travelers are not permitted to use public transportation while in China.Fast-Track Immigration Clearance for Korean Nationals Korean nationals traveling to China for business purposes may qualify for special fast-track immigration clearance provided they meet the following criteria:1) They are sponsored by a Korean or Chinese firm in China that has successfully applied for permission to use the fast-track program;2) They hold a letter of invitation from the sponsoring firm;3) They were issued a valid visa by a Chinese embassy or consulate in Korea.Prior to departing for China, persons using the fast-track program must:1) Self-monitor for 14 days for symptoms of COVID-19;2) Obtain a certificate issued no more than 72 hours prior to scheduled departure from a healthcare provider designated by the Ministry of Health and Welfare stating they have tested negative for COVID-19.Upon arrival in China, persons using the fast-track program must:1) Undergo 1-2 days quarantine at a designated location;2) Test negative for COVID-19 on both a polymerase chain reaction (PCR) and a serological (antibody) test;3) Use prearranged transportation to their final destination upon confirmation of negative test results.Korea nationals using the fast-track program are restricted to the following regions in China: Anhui Province, Chongqing Municipality, Guangdong Province, Jiangsu Province, Liaoning Province, Shaanxi Province, Shandong Province, Shanghai Municipality, Sichuan Province, and Tianjin Municipality.Quarantine-Free Entry for Persons Traveling from Macau SAR Persons traveling from Macau SAR to destinations in Mainland China are eligible for quarantine-free entry provided they meet the following criteria:1) They hold valid travel documents to visit Mainland China;2) They have not traveled outside Macau SAR or Mainland China during the 14 consecutive days prior to their intended arrival in Mainland China;3) They hold proof of a negative test for COVID-19 issued no more than 7 days prior to departure using a PCR test, or can show their official health code contains that information;4) They comply with all relevant epidemic prevention and control measures including submitting a health declaration form upon arrival in Mainland China.Persons unable to satisfy these requirements will be required to undergo a 14-day quarantine.All Others The following policies are in place:1) Residents of Hong Kong SAR, Macau SAR, and Taiwan must undergo a nucleic acid test for COVID-19 and a 14-day quarantine upon arrival in Mainland China. This policy provides a limited exemption for travelers from Macau SAR (see above);2) The following visa-free or temporary visa arrangements are temporarily suspended:Port visas, 24/72/144-hour visa-free transit, Hainan 30-day visa-free entry, 15-day visa-free entry for foreign cruise ships or groups tours at Shanghai Port, Guangdong 144-hour visa-free entry for foreign tour groups from Hong Kong SAR or Macau SAR, and Guangxi 15-day visa-free entry for foreign tour groups from ASEAN countries.3) Diplomatic, service, courtesy, or C visas are not impacted;4) Foreign nationals coming to China for necessary economic, trade, scientific or technological activities, or for emergency humanitarian needs may continue to apply for visas at Chinese embassies or consulates. Foreign nationals holding visas issued after these policies were implemented may enter China."
  },
  {
    "continent": "",
    "iso_alpha2": "CO",
    "name": "Colombia",
    "score": "Partially restricted",
    "updated": "olombia&amp;item_index=6&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Colombia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Entry to Colombia is restricted to arrivals by air. All persons must carry proof of a negative result for COVID-19 issued no more than 96 hours prior to departure using a polymerase chain reaction (PCR) test. Additionally, all persons must preregister using the Check-Mig system at least 1 hour and no more than 24 hours prior to departure. All land and sea border checkpoints are closed until further notice. Information on preregistration is available at the following URL: https://www.migracioncolombia.gov.co/"
  },
  {
    "continent": "",
    "iso_alpha2": "CR",
    "name": "Costa Rica",
    "score": "Partially restricted",
    "updated": "osta Rica&amp;item_index=8&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Costa Rica<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From November 1, 2020, foreign nationals traveling to Costa Rica must fulfill the following requirements: 1) hold a valid visa (if required), 2) submit a Health Pass form online prior to departure, 3) hold proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test, and 4) carry travel insurance valid for use in Costa Rica with a minimum coverage amount of US$50,000 including at least US$2,000 for lodging expenses incurred as a result of the pandemic. This policy does not apply to diplomats. Health Pass forms are available online at the following URL: https://salud.go.crUntil November 1, 2020, Costa Rican authorities have restricted the locations from where persons can travel to Costa Rica. More information is available at the following URL: https://www.visitcostarica.com/en/costa-rica/planning-your-trip/entry-requirements"
  },
  {
    "continent": "",
    "iso_alpha2": "CU",
    "name": "Cuba",
    "score": "Partially restricted",
    "updated": "uba&amp;item_index=9&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Cuba<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals seeking to travel to Cuba for tourism must obtain a valid tourist visa from a Cuban embassy, consulate, or a travel agency abroad. From January 1, 2021, all persons must have proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test performed by an accredited laboratory in the location of departure. Upon arrival in Cuba, all persons must undergo an additional PCR test and self-isolate at a hotel or guesthouse for up to 48 hours while awaiting their test results. Persons who test negative will be released from self-isolation. Persons (including Cuban nationals and lawful residents) who do not intend to stay at a hotel or guesthouse must remain in self-isolation and undergo an additional PCR test 5 days after their initial arrival in Cuba. Such persons will be released from self-isolation upon confirmation of a second negative PCR test result."
  },
  {
    "continent": "",
    "iso_alpha2": "CV",
    "name": "Cape Verde",
    "score": "Partially restricted",
    "updated": "ape Verde&amp;item_index=7&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Cape Verde<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From October 12, 2020, all persons must show proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test."
  },
  {
    "continent": "",
    "iso_alpha2": "CW",
    "name": "Curacao",
    "score": "Entry prohibited",
    "updated": "uracao&amp;item_index=10&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Curacao<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From March 24, 2020, all persons are prohibited from entering Curaçao. A 24-hour curfew is in place."
  },
  {
    "continent": "",
    "iso_alpha2": "CY",
    "name": "Cyprus",
    "score": "Partially restricted",
    "updated": "yprus&amp;item_index=16&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Cyprus<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Cyprus. This policy does not apply to nationals from the following countries or regions: Australia, Canada, Denmark, Estonia, Finland, Germany, Greece, Hong Kong SAR, Iceland, Ireland, Italy, Japan, Latvia, Liechtenstein, Lithuania, Mainland China, New Zealand, Norway, Poland, Rwanda, San Marino, Serbia, South Korea, Sweden, Thailand, United Kingdom, and Vatican City.Persons traveling from certain countries / regions must present a certificate showing a negative test result for COVID-19 using a polymerase chain reaction (PCR) test performed no more than 72 hours prior to departure for Cyprus. More information is available at the following URL: more information is available at: https://cyprusflightpass.gov.cy/en/country-categoriesAll persons traveling to Cyprus should apply online for the CyprusFlightPass 24 hours before their scheduled flight time. Applications may be found at: https://cyprusflightpass.gov.cy/"
  },
  {
    "continent": "",
    "iso_alpha2": "CZ",
    "name": "Czech Republic",
    "score": "Entry prohibited",
    "updated": "zech Republic&amp;item_index=17&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Czech Republic<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From October 21, 2020, foreign nationals are prohibited from entering the Czech Republic. This policy does not apply for persons traveling for essential reasons and cross-border workers. Additional information is available at the following URL: https://www.mvcr.cz/mvcren/article/coronavirus-information-of-moi.aspx"
  },
  {
    "continent": "",
    "iso_alpha2": "DE",
    "name": "Germany",
    "score": "Partially restricted",
    "updated": "ermany&amp;item_index=2&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Germany<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Germany. This policy does not apply to citizens from countries or regions in the European Union, countries or regions associated with the Schengen Area, Australia, New Zealand, Singapore, South Korea, or Thailand. Further exemptions exist for persons performing essential functions in Germany, persons traveling to Germany for essential reasons, or the unmarried partners of German nationals or legal residents currently living in Germany.Foreign nationals traveling from a location determined by German health authorities to have confirmed cases of a new SARS-CoV-2 variant of concern are prohibited from entering Germany. This policy does not apply to lawful residents, transit passengers who do not exit the secure area of a commercial airport, and persons traveling for urgent humanitarian reasons. Additional exemptions exist for persons engaged in certain critical functions. All persons (including German nationals) authorized to travel from an area of variant of concern or from a location determined to have a high incidence of COVID-19 infections must present proof of a negative test result for COVID-19 issued no more than 48 hours prior to departure using a nucleic acid test (NAT) performed by a testing provider recognized by the Robert-Koch-Institut. Additionally, such persons must submit an online health registration form prior to departure and undergo a 10-day quarantine upon arrival. Health registration forms are available at the following URL: https://www.einreiseanmeldung.de/All persons (including German nationals) who, within 10 days of their scheduled departure for Germany, have visited a country or region the Robert-Koch-Institut has designated as a COVID-19 risk area must submit an online health registration form prior to departure and undergo a 10-day quarantine upon arrival. Additionally, such persons must carry proof of a negative NAT for COVID-19 issued no more than 48 hours prior to departure or undergo testing within 48 hours of their arrival in Germany. All persons entering Germany from abroad will have the option to undergo free testing for COVID-19 upon arrival.Be advised, many state-level authorities in Germany have implemented additional policies and restrictions for persons arriving into their jurisdictions. A current list of risk locations is available from the following URL: https://www.rki.de/DE/Content/InfAZ/N/Neuartiges_Coronavirus/Risikogebiete_neu.html"
  },
  {
    "continent": "",
    "iso_alpha2": "DJ",
    "name": "Djibouti",
    "score": "Normal",
    "updated": "jibouti&amp;item_index=15&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Djibouti<span class=countryStatusGreen>Normal<div class=sc-3okj19-0 jJdyoA><div class=content >From July 17, 2020, all persons arriving in Djibouti are subject to testing for COVID-19 at their own expense."
  },
  {
    "continent": "",
    "iso_alpha2": "DK",
    "name": "Denmark",
    "score": "Partially restricted",
    "updated": "enmark&amp;item_index=18&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Denmark<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From January 9, 2021, foreign nationals are prohibited from entering Denmark. This policy does not apply to persons arriving from countries or regions in the European Union (with the exception of Belgium, Bulgaria, Luxembourg, Malta, Romania, and Spain) countries or regions associated with the Schengen Area (with the exception of Andorra and Monaco), Australia, Japan, New Zealand, Singapore, South Korea, or Thailand. Foreign nationals seeking to travel to Denmark must have a worthy purpose or present documentation showing a minimum stay of 6 nights. This policy does not apply to persons arriving from Norway, the provinces of Scania, Halland, or Blekinge in Sweden, or the state of Schleswig-Holstein in Germany.All persons age 13 years or over must have proof of a negative result for COVID-19 issued no more than 24 hours prior to departure. Persons lacking such proof are prohibited from boarding flights bound for Denmark. This policy does not apply to cargo flights or passenger flights from the Faroe Islands and Greenland. Health screening will occur at border checkpoints and persons exhibiting symptoms of illness will be denied entry. Additional information is available at the following URL: https://politi.dk/en/coronavirus-in-denmark/travelling-in-or-out-of-denmark/is-my-country-open-or-banned"
  },
  {
    "continent": "",
    "iso_alpha2": "DM",
    "name": "Dominica",
    "score": "Partially restricted",
    "updated": "ominica&amp;item_index=11&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Dominica<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons traveling to Dominica must fill in and submit a health questionnaire online at least 24 hours prior to departure and obtain a notification of clearance to travel. Upon arrival, all persons must present their notification for inspection as well as proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction test. Health questionnaire forms are available at the following URL: http://domcovid19.dominica.gov.dm . Health questionnaires and additional information are available at the following URL: https://discoverdominica.com/travel-advisory-for-dominica"
  },
  {
    "continent": "",
    "iso_alpha2": "DO",
    "name": "Dominican Republic",
    "score": "Partially restricted",
    "updated": "ominican Republic&amp;item_index=12&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Dominican Republic<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons arriving in the Dominican Republic must complete an electronic entry and exit form (e-Ticket) and receive 2 QR codes for use when entering and exiting the Dominican Republic. Upon arrival, all persons will undergo temperature screening. Additionally, between 3% and 10% of arriving passengers will be randomly selected to undergo rapid testing for COVID-19. All persons exhibiting symptoms consistent with COVID-19 must undergo testing. Symptomatic persons and those who test positive will be isolated. All persons are required to fill in and submit a Traveler's Health Affidavit. More information is available at the following URL: https://www.godominicanrepublic.com/newsroom/coronavirus/"
  },
  {
    "continent": "",
    "iso_alpha2": "DZ",
    "name": "Algeria",
    "score": "Entry prohibited",
    "updated": "lgeria&amp;item_index=1&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Algeria<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >The government declared state of emergency on March 17, all borders have been closed, all air and sea travel have been suspended. From July 9, 2020, the government has imposed a partial confinement for at least 15 days."
  },
  {
    "continent": "",
    "iso_alpha2": "EC",
    "name": "Ecuador",
    "score": "Partially restricted",
    "updated": "cuador&amp;item_index=7&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Ecuador<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From September 15, 2020, all persons arriving in Ecuador must have proof of a negative result for COVID-19 issued no more than 10 days prior to departure using a polymerase chain reaction (PCR) test and cannot be exhibiting symptoms consistent with COVID-19. Upon arrival, all persons must undergo additional rapid-result testing for COVID-19 and a period of Mandatory Preventive Isolation (APO). Those who test positive will be isolated and given a PCR test for confirmation. All land and sea border checkpoints are closed."
  },
  {
    "continent": "",
    "iso_alpha2": "EE",
    "name": "Estonia",
    "score": "Partially restricted",
    "updated": "stonia&amp;item_index=19&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Estonia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Estonia. This policy does not apply to citizens or residents from countries or regions in the European Union, countries or regions associated with the Schengen Area, Andorra, Australia, Japan, Monaco, New Zealand, San Marino, Singapore, South Korea, Thailand, United Kingdom, or Vatican City, provided such persons are not exhibiting symptoms consistent with COVID-19. All persons arriving from countries or regions where the rate of COVID-19 infection is 150 cases per 100,000 inhabitants or higher must self-isolate for 10 days. Persons who carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test and who agree to undergo an additional PRC test following 6 days of self-isolation can, upon confirmation of dual negative test results, end their self-isolation early. More information is available from the Estonian Ministry of Foreign Affairs at the following URL: https://vm.ee/en/information-countries-and-self-isolation-requirements-passengers"
  },
  {
    "continent": "",
    "iso_alpha2": "EG",
    "name": "Egypt",
    "score": "Partially restricted",
    "updated": "gypt&amp;item_index=16&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Egypt<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From September 1, 2020, all persons (including Egyptian nationals) must present proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. This policy does not apply to those age six or under. Upon arrival, all persons must undergo temperature screening and must comply with all relevant epidemic prevention measures."
  },
  {
    "continent": "",
    "iso_alpha2": "ER",
    "name": "Eritrea",
    "score": "Entry prohibited",
    "updated": "ritrea&amp;item_index=18&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Eritrea<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From March 25, 2020, commercial passenger flights to and from Eritrea are suspended. From April 2, 2020, a nationwide lockdown is in effect."
  },
  {
    "continent": "",
    "iso_alpha2": "ES",
    "name": "Spain",
    "score": "Partially restricted",
    "updated": "pain&amp;item_index=6&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Spain<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From March 8, 2021, foreign nationals are prohibited from entering Spain. This policy does not apply to persons arriving from countries or regions in the European Union, countries or regions associated with the Schengen Area, Australia, Hong Kong SAR, Macau SAR, Mainland China, New Zealand, Rwanda, Singapore, South Korea, and Thailand. Further exemptions exist for persons engaged in the transportation of cargo, diplomatic staff and consular agents accredited in Spain and traveling as part of their official duties, and people who normally reside on Spanish territory. All persons arriving by air or sea from locations considered high-risk for the spread of COVID-19 based on determinations by Spanish health authorities must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a nucleic acid test. Upon arrival, all persons must undergo health screening and those suspected of having COVID-19 must undergo additional testing. All persons traveling from Brazil, Botswana, Colombia, Comoros, Ghana, Kenya, Mozambique, Peru, South Africa, Tanzania, Zambia, or Zimbabwe must undergo a 10-day quarantine upon arrival. Persons who agree to undergo testing for COVID-19 following 7 days in quarantine may be eligible for early release upon confirmation of a negative result. Prior to departure, all persons traveling to Spain by air must fill in an online sanitary control form (FCS) and obtain an associated QR code. Forms are available in the SpTH mobile application and at the following URL: https://www.spth.gob.es/createA current list of high-risk locations is available from the Spanish government at the following URL: https://www.mscbs.gob.es/en/profesionales/saludPublica/ccayes/alertasActual/nCov/spth.htm"
  },
  {
    "continent": "",
    "iso_alpha2": "ET",
    "name": "Ethiopia",
    "score": "Partially restricted",
    "updated": "thiopia&amp;item_index=20&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Ethiopia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons traveling to Ethiopia must present proof of a negative result for COVID-19 issued no more than 120 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. This policy does not apply to children 10 years of age or younger or to transit passengers. All persons traveling on diplomatic or service passports, including their immediate family members, who do not carry proof of a negative RT-PCR test result must self-isolate for 14 days upon arrival."
  },
  {
    "continent": "",
    "iso_alpha2": "FI",
    "name": "Finland",
    "score": "Partially restricted",
    "updated": "inland&amp;item_index=20&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Finland<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Finland for non-essential travel until at least March 18, 2021. This policy does not apply to lawful permanent residents or to persons traveling from Australia, Iceland, New Zealand, South Korea, Singapore, Thailand, or Vatican City. All travelers are encouraged to undergo testing for COVID-19 no more than 72 hours prior to departure and again no more than 72 hours after arrival in Finland. All persons traveling from locations considered by Finish authorities to have a high-incidence of COVID-19 infections are encouraged to undergo a 14-day self-isolation upon arrival. More information is available at the following URL: https://valtioneuvosto.fi/en/information-on-coronavirus/current-restrictions"
  },
  {
    "continent": "",
    "iso_alpha2": "FJ",
    "name": "Fiji",
    "score": "Entry prohibited",
    "updated": "iji&amp;item_index=5&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Fiji<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Fiji. This policy does not apply to persons holding valid residence or work permits. All persons seeking entry to Fiji must obtain travel authorization from the Fijian government. Additionally, all persons must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Commercial flights to Nadi International Airport (NAN) are suspended. This policy does not apply to special repatriation flights. More information is available at the following URL: https://www.fiji.travel/covid-19"
  },
  {
    "continent": "",
    "iso_alpha2": "FM",
    "name": "Micronesia",
    "score": "Entry prohibited",
    "updated": "icronesia&amp;item_index=7&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Micronesia<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >All persons are prohibited from entering Micronesia until further notice."
  },
  {
    "continent": "",
    "iso_alpha2": "FR",
    "name": "France",
    "score": "Partially restricted",
    "updated": "rance&amp;item_index=1&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>France<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From February 5, 2021, foreign nationals are prohibited from entering France. This policy does not apply to persons arriving from countries or regions in the European Union, Andorra, Iceland, Liechtenstein, Monaco, Norway, San Marino, Switzerland, or Vatican City. Limited exemptions exist for persons traveling from other locations for essential purposes such as imperative personal or family reasons, emergency medical treatment, or professional trips that cannot be postponed.All persons, regardless of origin or mode of transportation, must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. This policy does not apply to children 10 years of age or younger. In addition to RT-PCR test results, all persons must present a sworn declaration stating that: 1) the traveler is not exhibiting symptoms consistent with COVID-19, 2) the traveler has not, in the 14 days prior to their scheduled departure, had contact with anyone confirmed to have COVID-19, and 3) the traveler agrees to undergo an RT-PCR test upon arrival in France. Persons traveling from locations where RT-PCR tests are not readily available should contact their local French embassy or consulate and obtain a PCR test exemption document for travel to France. All persons (including French nationals) seeking to enter France for essential purposes from a country or region not listed above must, in addition to all above-listed requirements, further agree in their sworn declaration to self-isolate for 7 days upon arrival and undergo an additional RT-PCR test at the end of their self-isolation period. Necessary travel certificates are available from the French Ministry of the Interior’s website at the following URL: https://www.interieur.gouv.fr/Actualites/L-actu-du-Ministere/Certificate-of-international-travel"
  },
  {
    "continent": "",
    "iso_alpha2": "GA",
    "name": "Gabon",
    "score": "Partially restricted",
    "updated": "abon&amp;item_index=21&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Gabon<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test administrated by a testing provider approved by health authorities in the location of departure. Upon arrival, all persons must undergo an additional PCR test at their own expense of up to 20,000 CFA francs and remain isolated until receiving confirmation of a negative result. All non-residents must undergo isolation at a designated location. This policy does not apply to persons aged six or under. Children aged 15 or under may enter Gabon without a visa provided they are accompanied by a parent or legal guardian who holds a valid visa. A nationwide curfew is in effect daily from 18:00 (6:00 p.m.) to 05:00 (5:00 a.m.)."
  },
  {
    "continent": "",
    "iso_alpha2": "GB",
    "name": "United Kingdom",
    "score": "Partially restricted",
    "updated": "nited Kingdom&amp;item_index=7&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>United Kingdom<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >F<span style=display: inline !important; font-size: 15px; white-space: pre-wrap;>rom February 15, 2021, foreign nationals who, within 10 days of their scheduled departure, have traveled through any of the following countries or regions are prohibited from entering the United Kingdom: Angola, Argentina, Bolivia, Botswana, Brazil, Burundi, Cape Verde, Chile, Colombia, DR Congo, Ecuador, Eswatini, French Guiana, Guyana, Lesotho, Malawi, Mauritius, Mozambique, Namibia, Panama, Paraguay, Peru, Portugal, Rwanda, Seychelles, South Africa, Suriname, Tanzania, Uruguay, United Arab Emirates, Venezuela, Zambia, or Zimbabwe. This policy does not apply to Irish nationals or lawful residents; however, such persons must undergo a 10-day quarantine in a government-approved hotel.All persons (including UK nationals) must fill in a Public Health Passenger Locator Form online to provide their journey and contact details no more than 48 hours prior to departure. This policy does not apply to persons arriving from Ireland, the Channel Islands, or the Isle of Man. All persons (including UK nationals) arriving from abroad must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a nucleic acid test (NAT) or an antigen test. This policy does not apply to persons traveling from Ascension, Falkland Islands, Guernsey, Ireland, the Isle of Man, Jersey, or Saint Helena. Additional exemptions exist for children ages 10 or under, persons traveling for or accompanying someone who is traveling for urgent medical treatment, or persons who have medical conditions that prevent them from undergoing testing.Upon arrival, all persons (including UK nationals) must proceed directly to their place of residence and self-isolate for 10-days or undergo a 10-day quarantine in a government-approved facility. This policy does not apply to persons arriving from Ireland, the Channel Islands, or the Isle of Man. During self-isolation, all persons should remain indoors unless they require urgent medical treatment, support from social services, food and medicine that cannot be delivered, need to attend the funeral of a close relative, or in cases of emergency at the place of isolation. Visitors are not allowed during the self-isolation period, unless they are providing essential care. All persons while aboard public transportation (including taxis and private hire vehicles) must wear an appropriate face covering and maintain adequate physical distancing to the extent possible.Note that England, Northern Ireland, Scotland, and Wales each implement additional restrictions for persons arriving into their jurisdictions. The Public Health Passenger Locator Form can be found at the following URL: https://visas-immigration.service.gov.uk/public-health-passenger-locator-form"
  },
  {
    "continent": "",
    "iso_alpha2": "GD",
    "name": "Grenada",
    "score": "Partially restricted",
    "updated": "renada&amp;item_index=14&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Grenada<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons traveling to Grenada must obtain a Pure Safe Travel Certificate prior to departure. Additionally, all persons must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. All persons must undergo a 14-day quarantine upon arrival and hold a confirmed booking for an approved quarantine accommodation. Persons who carry special preapproval may be eligible for self-isolation at their residence. More information is available at the following URL: https://covid19.gov.gd/travel-covid/"
  },
  {
    "continent": "",
    "iso_alpha2": "GE",
    "name": "Georgia",
    "score": "Partially restricted",
    "updated": "eorgia&amp;item_index=21&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Georgia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Georgia. This policy does not apply to nationals and permanent residents of the following countries/regions provided they arrive via air from one of these locations: Croatia, Cyprus, Estonia, France, Germany, Greece, Italy, Latvia, Lithuania, Luxemburg, Netherlands, Poland, Portugal, Romania, Spain, and Sweden. Additional exemptions exist for persons traveling from other locations for business reasons provided they receive special permission from relevant authorities in Georgia prior to departure. Business travelers must, at their own expense, undergo polymerase chain reaction (PCR) testing for COVID-19 every 72 hours or complete a 14-day quarantine.Nationals and permanent residents from Estonia, France, Germany, Latvia, and Lithuania who arrive via air from one of those locations must fill in an online form detailing their travel history during the 14 days prior to their departure and undergo a PCR test for COVID-19 upon arrival in Georgia. Nationals and permanent residents from Croatia, Cyprus, Greece, Italy, Luxemburg, Netherlands, Poland, Portugal, Romania, Spain, and Sweden must additionally undergo a 14-day quarantine at their own expense. Health declaration forms are available at the following URL: https://stopcov.ge/en"
  },
  {
    "continent": "",
    "iso_alpha2": "GH",
    "name": "Ghana",
    "score": "Partially restricted",
    "updated": "hana&amp;item_index=23&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Ghana<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From September 1, 2020, persons arriving at Kotoka International Airport (ACC) in Accra must hold proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test performed by an accredited laboratory. This policy does not apply to persons returning to Ghana within 7 days of their last departure. Upon arrival, all persons age 5 and older must, at their own expense, undergo an additional test for COVID-19. Pre-payment for testing in the amount of US$150 must be made online prior to departure at the following URL: https://myfrontierhealthcare.com/Home/Ghana . Travelers must also submit a health declaration form online at the following URL: https://www.ghs-hdf.org/hdf/ ."
  },
  {
    "continent": "",
    "iso_alpha2": "GL",
    "name": "Greenland",
    "score": "Partially restricted",
    "updated": "reenland&amp;item_index=23&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Greenland<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From June 15, 2020, foreign nationals are prohibited from entering Greenland. This policy does not apply to citizens or lawful permanent residents from Denmark, the Faroe Islands, Germany, Iceland, and Norway. The total number of persons who may fly to Greenland each week is capped at 600. Persons arriving in Greenland must produce a certificate issued no more than 120 hours prior to departure showing a negative test result for COVID-19 and complete a personal locator form (Sumut form) detailing their travel itinerary. This form is available at: https://www.sumut2020.gl . Upon arrival, all persons must proceed directly to quarantine and undergo an additional test for COVID-19 after 5 days in isolation."
  },
  {
    "continent": "",
    "iso_alpha2": "GM",
    "name": "Gambia",
    "score": "Partially restricted",
    "updated": "ambia&amp;item_index=22&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Gambia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From January 9, 2021, all persons (regardless of origin) must provide proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. All persons arriving from countries or regions with confirmed cases of the new so-called VOC-202012/01 or 501Y.V2 variants of the SARS-CoV-2 virus must undergo additional testing and quarantine at their own expense upon arrival in the Gambia."
  },
  {
    "continent": "",
    "iso_alpha2": "GN",
    "name": "Guinea",
    "score": "Partially restricted",
    "updated": "uinea&amp;item_index=24&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Guinea<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Guinea. This policy does not apply to persons who hold long-stay family or professional visas, spouses of Guinean nationals, lawful residents, humanitarian personnel, diplomatic personnel, or technical experts. All persons arriving on Guinea must complete a health declaration form and present proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Upon arrival, all persons are subject to health screening. Persons exhibiting symptoms consistent with COVID-19 will be isolated and transferred to the Guinean Epidemiological Treatment Center (CT-Epi)."
  },
  {
    "continent": "",
    "iso_alpha2": "GQ",
    "name": "Equatorial Guinea",
    "score": "Partially restricted",
    "updated": "quatorial Guinea&amp;item_index=17&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Equatorial Guinea<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Entry to Equatorial Guinea is restricted to arrivals by air. Foreign nationals must hold a valid entry visa issued by a local Equatorial Guinean embassy or consulate. This policy does not apply to lawful residents. All persons traveling to Equatorial Guinea must carry proof of a negative result for COVID-19 issued no more than 48 hours prior to departure using a polymerase chain reaction (PCR) test. Upon arrival, all persons must surrender their passports before undergoing a rapid antigen test and a 5-day quarantine followed by an additional PCR test. Persons who test positive will be quarantined at a designated location. Persons who test negative will have their passports returned and be released from quarantine."
  },
  {
    "continent": "",
    "iso_alpha2": "GR",
    "name": "Greece",
    "score": "Partially restricted",
    "updated": "reece&amp;item_index=22&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Greece<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Greece. This policy does not apply to residents from countries or regions in the European Union, countries or regions associated with the Schengen Area, Australia, New Zealand, Rwanda, Singapore, South Korea, Thailand, United Arab Emirates, or the United Kingdom. All persons (regardless of origin or mode of transportation) must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test performed by a testing laboratory recognized by Greek authorities. This policy does not apply to children 9 years of age or younger. Upon arrival, all persons are subject to random testing for COVID-19 and must fill in a Passenger Locator Form (PLF) online at least 24 hours prior to departure. PLFs and more information on travel requirements are available at the following URL: https://travel.gov.gr/#/"
  },
  {
    "continent": "",
    "iso_alpha2": "GT",
    "name": "Guatemala",
    "score": "Partially restricted",
    "updated": "uatemala&amp;item_index=15&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Guatemala<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From December 23, 2020, foreign nationals who, within 14 days of their scheduled departure, have visited South Africa or the United Kingdom are prohibited from entering Guatemala. This policy does not apply to lawful residents. All persons entering Guatemala must present proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test, or undergo a 14-day quarantine upon arrival. All persons must complete a health questionnaire found at the following URL: https://servicios.igm.gob.gt/pasedesalud/"
  },
  {
    "continent": "",
    "iso_alpha2": "GW",
    "name": "Guinea-bissau",
    "score": "Partially restricted",
    "updated": "uinea-bissau&amp;item_index=25&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Guinea-bissau<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From August 1, 2020, all persons entering Guinea-Bissau must present proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Persons who do not carry such proof or who are currently exhibiting symptoms consistent with COVID-19 must undergo a 14-day quarantine."
  },
  {
    "continent": "",
    "iso_alpha2": "GY",
    "name": "Guyana",
    "score": "Entry prohibited",
    "updated": "uyana&amp;item_index=8&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Guyana<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >All international flights are suspended until further notice."
  },
  {
    "continent": "",
    "iso_alpha2": "HK",
    "name": "Hong Kong",
    "score": "Partially restricted",
    "updated": "ong Kong&amp;item_index=4&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Hong Kong<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Quarantine-Free Entry from Guangdong Province and Macau SAR Hong Kong SAR residents returning from Guangdong Province in Mainland China or from Macau SAR may be eligible for special quarantine-free entry under the so-called Return2hk Scheme. Residents must submit an online reservation and receive confirmation prior to departure. The daily limit on returnees is 3,000 via the Shenzhen Bay Port and 2,000 via the Hong Kong-Zhuhai-Macau Bridge, respectively. All reservations are allocated on a first-come, first-served basis and are non-transferable. Residents seeking to use the Return2hk Scheme must obtain proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test performed by a testing provider recognized by the HKSAR government. Upon arrival at the boundary control point, residents traveling under the Return2hk Scheme must present a valid Hong Kong SAR Identity Card, a Return2hk reservation confirmation, and proof of a negative RT-PCR test result. Additional information is available at the following URL: https://www.coronavirus.gov.hk/eng/return2hk-scheme.htmlAll Others The Hong Kong SAR government has implemented the following policies in response to COVID-19: 1) All non-residents arriving from overseas by air are prohibited from entering Hong Kong SAR; 2) All non-residents arriving from Mainland China, Macau SAR, or Taiwan who have visited any other country or region within 14 days of arrival are prohibited from entering Hong Kong SAR; 3) All persons (including Hong Kong SAR residents) arriving from Mainland China, Macau SAR, or Taiwan are required to undergo a 14-day quarantine at a designated location (see below for exceptions based on recent travel history);4) Travelers may transit Hong Kong International Airport (HKIA) for onward flights under the same ticket provided they (and any accompanying luggage) are checked through to their final destination. This includes flights originating in Mainland China bound for final destinations abroad;5) Transfer services at HKIA to final destinations in Mainland China remain suspended until further notice.From February 2, 2021, all persons (including HKSAR residents) who have visited Brazil, Ireland, South Africa, or the United Kingdom for more than 2 hours at any point within 21 days of their scheduled departure for HKSAR are prohibited from entering HKSAR. All persons who have visited any of the following very high-risk locations within 21 days of their scheduled departure for HKSAR must, upon arrival, present original documentation (in English or Chinese) issued no more than 72 hours prior to departure showing a negative result for COVID-19 using a nucleic acid test: Bangladesh, Belgium, Canada, Ecuador, Ethiopia, France, Germany, India, Indonesia, Kazakhstan, Nepal, Pakistan, Philippines, Romania, Russia, Switzerland, Turkey, Ukraine, United Arab Emirates, or the United States. Test results must contain the traveler's name and identity card or passport number. Following arrival, all persons with recent travel history to very high-risk locations must undergo a 21-day quarantine at a designated location. All persons (including HKSAR residents) who, within 21 days of their arrival in HKSAR, have visited any other location outside Mainland China, Macau SAR, or Taiwan must undergo a 21-day quarantine at a designated quarantine hotel at their own expense.Post-Arrival Testing and Quarantine All persons arriving at Hong Kong International Airport who are not exhibiting symptoms will be taken to a designated location and tested for COVID-19. All persons are required to wait onsite for their test results. Those who test negative will be instructed on how to proceed directly to their homes or a designated quarantine facility where they must complete their mandatory 14-day or 21-day quarantine.Mandatory quarantine requirements do not apply to cross-boundary travelers provided they fall into one of the following categories:1) Persons necessary for the supply of goods or services required for the normal operation of Hong Kong SAR or the daily needs of the people of Hong Kong SAR; 2) Persons necessary for governmental operation;3) Persons necessary to protect the health or safety of the people of Hong Kong SAR or to handle the public health emergency;4) Persons receiving nursery, kindergarten, primary, or secondary education at any school registered under the Education Ordinance (Cap. 279) in Hong Kong SAR, persons providing such education, or persons necessary for the safe travelling of any persons arriving in Hong Kong SAR for the purposes outlined in this clause;5) Persons whose entry is deemed to serve the public interest of Hong Kong SAR; or6) Persons traveling for purposes relating to manufacturing operations, business activities, or the provision of professional services deemed to be in the interest of economic development in Hong Kong SAR.Mandatory quarantine requirements do not apply to persons arriving from foreign places provided they fall into one of the following categories:1) Persons necessary for the supply of goods or services required for the normal operation of Hong Kong SAR or the daily needs of the people of Hong Kong SAR;2) Persons necessary for governmental operation;3) Persons necessary to protect the health or safety of the people of Hong Kong SAR or to handle the public health emergency; or4) Persons whose entry is deemed to serve the public interest of Hong Kong SAR."
  },
  {
    "continent": "",
    "iso_alpha2": "HN",
    "name": "Honduras",
    "score": "Partially restricted",
    "updated": "onduras&amp;item_index=17&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Honduras<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From August 17, 2020, all persons traveling to Honduras must provide proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) or rapid reagent test. All persons must fill in an online immigration pre-check form and carry a printed copy for inspection by authorities upon arrival. The form can be found at the following URL: https://prechequeo.inm.gob.hn"
  },
  {
    "continent": "",
    "iso_alpha2": "HR",
    "name": "Croatia",
    "score": "Partially restricted",
    "updated": "roatia&amp;item_index=15&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Croatia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From December 1, 2020, foreign nationals are prohibited from entering Croatia. This policy does not apply to persons, regardless of citizenship, arriving from countries or regions in the European Union, countries or regions associated with the Schengen Area, Australia, Hong Kong SAR, Japan, Macau SAR, Mainland China, New Zealand, Rwanda, Singapore, South Korea, Thailand, or the United Kingdom. All persons much carry proof of a negative result for COVID-19 issued no more than 48 hours prior to departure using a polymerase chain reaction (PCR) test. This policy does not apply to persons, regardless of citizenship, arriving from countries or regions classified as green by the European Centre for Disease Prevention and Control, Australia, Hong Kong SAR, Japan, Macau SAR, Mainland China, New Zealand, Rwanda, Singapore, South Korea, or Thailand, provided such persons are not exhibiting symptoms consistent with COVID-19 and have not had contact with persons known to be infected with COVID-19. Travelers who do not carry such proof must undergo testing for COVID-19 upon arrival in Croatia. Prior to arrival, all persons must fill out and submit the online form found at the following URL: https://entercroatia.mup.hr/ . Additional information is available at the following URL: https://koronavirus.hr/recommendations-and-instructions-for-crossing-the-state-border/736"
  },
  {
    "continent": "",
    "iso_alpha2": "HT",
    "name": "Haiti",
    "score": "Normal",
    "updated": "aiti&amp;item_index=16&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Haiti<span class=countryStatusGreen>Normal<div class=sc-3okj19-0 jJdyoA><div class=content >From July 1, 2020, all persons arriving Haiti must fill out and submit a health declaration pertaining to their COVID-19 status. All persons must retain a copy of this form for 14 days following arrival in order to facilitate contact tracing as necessary."
  },
  {
    "continent": "",
    "iso_alpha2": "HU",
    "name": "Hungary",
    "score": "Entry prohibited",
    "updated": "ungary&amp;item_index=24&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Hungary<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Hungary. This policy provides for exemptions on a case-by-case basis for persons with specific needs to travel to Hungary. From November 11, 2020, strict new restrictions are in place nationwide, including a nightly curfew from 20:00 (8:00 p.m.) to 05:00 (5:00 a.m.)."
  },
  {
    "continent": "",
    "iso_alpha2": "ID",
    "name": "Indonesia",
    "score": "Entry prohibited",
    "updated": "ndonesia&amp;item_index=6&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Indonesia<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content ><span style=white-space: pre-wrap;>From February 9, 2021, foreign nationals are prohibited from entering or transiting Indonesia. This policy does not apply to persons who hold a valid diplomatic or official visa, a diplomatic or official residence permit, a temporary stay permit or temporary stay visa, a permanent stay visa, or a visit visa. Further exemptions exist for transportation crew members, persons holding an Asia-Pacific Economic Cooperation Business Travel Card (ABTC), and persons holding a traditional Border Crossing pass or card. Persons seeking to enter Indonesia should contact a local Indonesian embassy or consulate in order to obtain a valid travel visa. All visa-free and visa-on-arrival services are suspended. International arrivals and departures by air are restricted to 7 designated airports. More information is available at the following URL: https://www.imigrasi.go.id/covid19/detail/1b645389/border-closures-and-exceptions <span style=white-space: pre-wrap;><span style=white-space: pre-wrap; display: inline !important;>Foreign nationals permitted to enter Indonesia must fill in and submit an Electronic Health Alert Card (e-HAC) and carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. Upon arrival, foreign nationals must, at their own expense, undergo an additional RT-PCR test and a 5-day quarantine at a designated facility. At the end of the quarantine period, foreign nationals must undergo a third RT-PCR test. Persons who at any point test positive for COVID-19 shall be transferred to a hospital for treatment at their own expense. Electronic Health Alert Cards are available online at the following URL: https://inahac.kemkes.go.id/"
  },
  {
    "continent": "",
    "iso_alpha2": "IE",
    "name": "Ireland",
    "score": "Partially restricted",
    "updated": "reland&amp;item_index=26&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Ireland<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From February 4, 2021, all persons (including Irish nationals) must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. This policy does not apply to persons arriving from Northern Ireland. Further exemptions exist for children 6 years of age or younger. Additionally, all persons must complete an online COVID-19 Passenger Locator Form and undergo a 14-day quarantine at the address they specify on the locator form. This policy provides limited exemptions from quarantine requirements. Additional information and links to locator forms are available at the following URL: https://www.gov.ie/en/publication/b4020-travelling-to-ireland-during-the-covid-19-pandemic/"
  },
  {
    "continent": "",
    "iso_alpha2": "IL",
    "name": "Israel",
    "score": "Entry prohibited",
    "updated": "srael&amp;item_index=24&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Israel<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From December 23, 2020, foreign national are prohibited from entering Israel. Limited exemptions apply. All persons allowed entry must undergo a 14-day quarantine at a designated location upon arrival. Persons who agree to undergo two separate tests for COVID-19 may be eligible for a shortened quarantine. More information is available via the following URL: https://www.gov.il/en/departments/air-travel-covid19-israel"
  },
  {
    "continent": "",
    "iso_alpha2": "IN",
    "name": "India",
    "score": "Partially restricted",
    "updated": "ndia&amp;item_index=5&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>India<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering India for tourism. This policy does not apply to Bhutanese and Nepalese nationals. Foreign nationals seeking to travel to India must hold a valid entry visa. All persons holding a previously-issued visa are advised to verify their visa status with a local Indian embassy or consulate prior to making travel arrangements. Persons seeking to travel to India for family emergencies should apply for authorization at an Indian embassy or consulate abroad, which will evaluate applications on a case-by-case basis.All persons (including Indian nationals and transit passengers) must use the Air Suvidha system to submit an online health declaration form and proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. Travelers must further agree to abide by all regulations concerning quarantine and self-isolation issued by appropriate Indian government authorities. All persons must monitor their health status for 14 days following arrival in India. Travelers arriving on flights originating in Europe (including the United Kingdom) or the Middle East must undergo testing for COVID-19 upon arrival. All persons traveling aboard flights originating in Brazil, South Africa, or the United Kingdom must self-isolate for 7 days, undergo an additional test for COVID-19 following the self-isolation period, and monitor their health status for a further 7 days. Persons who at any point test positive for COVID-19 will be isolated and sent for treatment. All persons are advised to install the Aarogya Setu mobile application for contact tracing purposes. Health declaration forms are available at the following URL: https://www.newdelhiairport.in/airsuvidha/apho-registrationBe advised, some state-level authorities in India have implemented additional policies and restrictions for persons arriving into their jurisdictions. More information on current national guidelines is available at the following URI: https://www.mohfw.gov.in/pdf/Guidelinesforinternationalarrivals17022021.pdf"
  },
  {
    "continent": "",
    "iso_alpha2": "IQ",
    "name": "Iraq",
    "score": "Partially restricted",
    "updated": "raq&amp;item_index=23&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Iraq<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From January 14, 2021, foreign nationals traveling from the following countries or regions are prohibited from entering Iraq: Australia, Austria, Belgium, Brazil, Denmark, Finland, France, Georgia, Germany, Greece, India, Ireland, Japan, Luxembourg, Slovakia, South Africa, Spain, United Kingdom, United States, and Zambia. This policy does not apply to diplomats, official delegations, and personnel from international organizations provided they carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Iraqi nationals traveling from those locations must undergo a 14-day quarantine upon arrival in Iraq. All land border checkpoints are closed to non-essential traffic."
  },
  {
    "continent": "",
    "iso_alpha2": "IR",
    "name": "Iran",
    "score": "Partially restricted",
    "updated": "ran&amp;item_index=22&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Iran<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From August 5, 2020, all persons over the age of 2 arriving in Iran must carry proof of a negative result for COVID-19 issued no more than 96 hours prior to departure using a polymerase chain reaction (PCR) test. Travelers must fill in a health declaration form prior to arrival and undergo additional screening for COVID-19 once in Iran. Protective face masks are mandatory on all flights to Iran and in Iranian airports. The Iranian government has suspended the issuing of all tourist visas."
  },
  {
    "continent": "",
    "iso_alpha2": "IS",
    "name": "Iceland",
    "score": "Partially restricted",
    "updated": "celand&amp;item_index=25&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Iceland<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From February 19, 2021, foreign nationals are prohibited from entering Iceland. This policy does not apply to residents of countries and regions in the European Union or countries and regions associated with the Schengen Area. All persons must submit a preregistration form online prior to departure, install the Rakning C-19 mobile application, and carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Upon arrival, all persons must undergo a PCR test followed by a 5-day quarantine and an additional PCR test. This policy does not apply to persons carrying proof they have completed a full COVID-19 vaccination regimen or proof they have fully recovered from a prior COVID-19 infection. More information and links to preregistration forms are available from the following URL: https://www.covid.is/sub-categories/visiting-iceland"
  },
  {
    "continent": "",
    "iso_alpha2": "IT",
    "name": "Italy",
    "score": "Partially restricted",
    "updated": "taly&amp;item_index=3&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Italy<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content > From March 28, 2020, foreign nationals are prohibited from entering Italy. This policy provides exemptions for health reasons, work requirements, and reasons of absolute necessity. Transit through Italy from one foreign country to another is allowed only for work requirements, medical needs, or reasons of absolute necessity.\n\nAll persons entering Italy (including Italian nationals) are required to self-isolate for 14 days. Prior to boarding transportation bound for Italy, the carrier staff will collect the following information from all travelers: the reason for travel to Italy, an address where the traveler will self-isolate for 14 days, the private means of transportation to be used to reach the self-isolation location, and a contact phone number.\n\nThese policies do not apply to cross-border workers, health services personnel, and passenger or freight transport crews.\n style=font-size: 14.6667px;>From February 14, 2021, foreign nationals are prohibited from entering Italy. This policy does not apply to persons arriving from countries or regions in the European Union, countries or regions associated with the Schengen Area, Andorra, Australia, Japan, Monaco, New Zealand, Rwanda, San Marino, Singapore, South Korea, Thailand, or Vatican City. Foreign nationals who, within 14 days of their scheduled departure, have visited or transited through Brazil or the United Kingdom are prohibited from entering Italy. This policy does not apply to lawful residents. Additional exemptions exist for persons traveling for reasons of absolute necessity.All persons (including Italian nationals) must carry proof of a negative test result for COVID-19 issued no more than 48 hours prior to departure using a nucleic acid or antigen test. This policy does not apply to persons traveling from San Marino or Vatican City. All persons (including Italian nationals) must undergo a 14-day quarantine upon arrival and are required to fill out and present for inspection upon request a Self-Declaration Form for Travel to Italy from Abroad. This policy does not apply to persons traveling from countries or regions in the European Union (with the exception of Austria), countries or regions associated with the Schengen Area, Andorra, or Monaco. Self-declaration form are available at following URI: https://www.esteri.it/mae/resource/doc/2021/02/modulo_rientro_sintetico_13_febbraio_2021-convertito_eng.pdfPersons authorized to travel from the Austria, Brazil, or the United Kingdom must carry proof of a negative test result for COVID-19 issued no more than 48 hours prior to departure using a nucleic acid or antigen test. Upon arrival, such persons must undergo an additional test for COVID-19 and a 14-day quarantine. Persons authorized to travel from Austria and Brazil must, in addition to the aforementioned requirements, undergo testing for COVID-19 at the end of their quarantine period. This policy provides limited exemptions to quarantine requirements for cargo and passenger transportation crew members, provided such persons meet certain conditions. More information is available at the following URL: https://www.esteri.it/mae/en/ministero/normativaonline/decreto-iorestoacasa-domande-frequenti/focus-cittadini-italiani-in-rientro-dall-estero-e-cittadini-stranieri-in-italia.htmlBe advised, some regional-level authorities in Italy have implemented additional policies and restrictions for persons arriving into their jurisdictions."
  },
  {
    "continent": "",
    "iso_alpha2": "JM",
    "name": "Jamaica",
    "score": "Partially restricted",
    "updated": "amaica&amp;item_index=18&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Jamaica<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From June 15, 2020, all persons (including Jamaican nationals) must present a Travel Authorization document prior to boarding flights bound for Jamaica. These documents are available at the following URL: https://www.visitjamaica.com/travelauthorization/ . All persons 12 years of age or older traveling for non-business reasons from Arizona, Florida, New York, and Texas in the United States must upload proof of a negative result for COVID-19 issued no more than 10 days prior to departure by a medical laboratory accredited by the US College of American Pathologists (CAP). A negative result is required to obtain travel authorization for Jamaica. More information is available at the following URL: https://www.visitjamaica.com/"
  },
  {
    "continent": "",
    "iso_alpha2": "JO",
    "name": "Jordan",
    "score": "Partially restricted",
    "updated": "ordan&amp;item_index=25&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Jordan<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From February 3, 2021, all persons must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Upon arrival, all persons 6 years of age or above must undergo an additional PCR test at their own expense. Proof of prepayment for testing on arrival is required to board flights bound for Jordan. Persons who test positive must self-isolate for 14 days. More information is available at the following URLs: https://registration.questlabjo.com/ https://COVID19.biolab.jo"
  },
  {
    "continent": "",
    "iso_alpha2": "JP",
    "name": "Japan",
    "score": "Entry prohibited",
    "updated": "apan&amp;item_index=1&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Japan<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From February 2, 2021, foreign nationals are prohibited from entering Japan. This policy does not apply to lawful permanent residents provided they have not, within 14 days of their intended arrival in Japan, visited Brazil, Ireland, Israel, South Africa, or the United Kingdom. All persons (including Japanese nationals) returning from abroad must sign and submit a Written Pledge to indicate they understand and agree to abide by all testing and quarantine requirements currently in effect. Additionally, all persons must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. Upon arrival, all persons are subject to a 14-day quarantine at a designated facility. Travelers are strongly advised to contact their local Japanese embassy or consulate in order to verify their status prior to finalizing travel arrangements. Written pledges are available from Ministry of Foreign Affairs at the following URIs: https://www.mofa.go.jp/files/100140086.pdf (for Japanese nationals); https://www.mofa.go.jp/files/100140087.pdf (for non-nationals)"
  },
  {
    "continent": "",
    "iso_alpha2": "KE",
    "name": "Kenya",
    "score": "Partially restricted",
    "updated": "enya&amp;item_index=26&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Kenya<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons arriving in Kenya must carry proof of a negative test result for COVID-19 issued no more than 96 hours prior to departure and performed by a testing provider recognized under the African Union's new Trusted Travel Initiative. Persons whose COVID-19 test results were not issued by an authorized testing provider must submit their results for certification prior to boarding transpiration bound for Kenya. Information about this procedure is available from the follow URL: https://globalhaven.org/All persons must fill out and submit a Travelers Health Surveillance Form online and receive a valid QR code to show upon arrival in Kenya. Persons exhibiting symptoms consistent with COVID-19 are subject to quarantine upon arrival. Travelers Health Surveillance Forms are available at the following URL: https://ears.health.go.ke/airline_registration/"
  },
  {
    "continent": "",
    "iso_alpha2": "KG",
    "name": "Kyrgyzstan",
    "score": "Partially restricted",
    "updated": "yrgyzstan&amp;item_index=28&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Kyrgyzstan<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From December 4, 2020, entry into Kyrgyzstan by foreign nationals is restricted to arrivals by air at Issyk-Kul International Airport (IKU), Manas International Airport (FRU), and Osh International Airport (OSS). All persons must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Persons lacking such proof must undergo testing upon arrival. All land border checkpoints are closed to foreign nationals.The Ministry of Foreign Affairs will suspend issuance of entry visas of all categories to foreign citizens and stateless persons for the period of the ban. The entry ban for foreigners will remain in effect until the government decree is canceled."
  },
  {
    "continent": "",
    "iso_alpha2": "KH",
    "name": "Cambodia",
    "score": "Partially restricted",
    "updated": "ambodia&amp;item_index=20&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Cambodia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >The Cambodian government has suspended the issuing of tourist visas, e-visas, visa-on-arrival, and all visa-free arrangements until further notice. Foreign nationals seeking to enter Cambodia must obtain a valid visa from a Cambodian embassy or consulate abroad prior to departure. Upon arrival, foreign nationals must present a valid medical certificate issued no more than 72 hours prior to departure attesting they have not tested positive for COVID-19. Foreign nationals must have proof of medical insurance valid for use in Cambodia for the duration of their intended stay with a coverage amount of least US$50,000. Alternatively, travelers may purchase a health insurance package upon arrival for US$90. All persons must undergo testing for COVID-19 upon arrival and again after 13 days in self-isolation. Should any passenger on an arriving flight test positive for COVID-19, all passengers on the same flight must undergo a 14-day quarantine in a designated facility. Otherwise, passengers will be permitted to self-isolate for 14 days in an appropriate accommodation. A deposit in the amount of US$2,000 must be paid upon arrival and will be used to cover expenses related to testing, quarantine, and any other health-related services. This policy does not apply to persons holding a diplomatic (category A) or official (category B) visa. A list of applicable services and fees is available from the Cambodian Ministry of Foreign Affairs at the following URL: https://www.mfaic.gov.kh/covid-19"
  },
  {
    "continent": "",
    "iso_alpha2": "KM",
    "name": "Comoros",
    "score": "Partially restricted",
    "updated": "omoros&amp;item_index=11&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Comoros<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From September 7, 2020, all persons arriving in Comoros must have proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test."
  },
  {
    "continent": "",
    "iso_alpha2": "KN",
    "name": "Saint Kitts and Nevis",
    "score": "Entry prohibited",
    "updated": "aint Kitts and Nevis&amp;item_index=21&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Saint Kitts and Nevis<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >All air and sea border checkpoints are closed to commercial traffic until further notice."
  },
  {
    "continent": "",
    "iso_alpha2": "KP",
    "name": "Democratic People's Republic of Korea",
    "score": "Entry prohibited",
    "updated": "emocratic People's Republic of Korea&amp;item_index=21&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Democratic People's Republic of Korea<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >All passenger air and rail connections with China are suspended. Arriving foreign nationals must undergo quarantine for up to 1 month."
  },
  {
    "continent": "",
    "iso_alpha2": "KR",
    "name": "South Korea",
    "score": "Partially restricted",
    "updated": "outh Korea&amp;item_index=3&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>South Korea<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Required Testing for Foreign Nationals All foreign nationals, regardless of origin, must carry proof of a negative result for COVID-19 using a polymerase chain reaction (PCR) test performed no more than 72 hours prior to departure by a hospital or medical services provider approved by the local Korean embassy or consulate. All travelers are strongly advised to contact their local Korean embassy or consulate regarding travel restrictions specific to their current location, including information regarding flight bans, testing requirements, and visa issuance.<br style=clear:both;/>Re-Entry Permit Required for Alien Registration Card Holders From June 1, 2020, persons holding an Alien Registration Card (ARC) must obtain a Re-Entry Permit prior to departure from South Korea if they intend to return. Failure to do so will result in cancellation of the Alien Registration. This policy does not apply to diplomats, government officials, or persons who hold Overseas Korean (F-4) status. To return to South Korea, persons holding a valid ARC must undergo testing for COVID-19 within 48 hours prior to departure and must present a medical certificate (written in English or Korean) showing their test results upon arrival in South Korea.<br style=clear:both;/>Fast-Track Immigration Clearance for Chinese Nationals From May 1, 2020, Chinese nationals traveling to South Korea for business purposes may qualify for special fast-track immigration clearance provided they hold proof of a negative test for COVID-19 performed no more than 72 hours prior to departure. They must again test negative for COVID-19 upon arrival in Korea before being exempted from the mandatory quarantine procedures described below. Persons using fast-track immigration clearance are subject to standard government surveillance measures in place to combat COVID-19.<br style=clear:both;/>Special Entry Procedures So-called special entry procedures are in place for all persons arriving in South Korea regardless of origin. All persons must proceed through immigration at their first port of entry in South Korea and may not connect to onward domestic flights. This policy does not apply to residents of Jeju Island or to special Transit Exclusive Domestic Flights connecting from Incheon International Airport (IIA) to Gimhae International Airport (PUS) in Busan. Individuals are allowed entry only after they provide verifiable contact information and an address within South Korea valid for the duration of their stay. All persons are required to install either the Self-quarantine Safety Protection App or the Mobile Self-diagnosis App on their phones and follow the instructions for documenting their health condition on a daily basis for 14 days. All persons arriving from the United States (including Korean nationals) must self-isolate and must get diagnostic tests within three days of commencing their quarantine period.<br style=clear:both;/>Symptomatic Passengers All persons (including Korean nationals) will go through diagnostic tests if they have fever or respiratory symptoms identified during the quarantine stage. Persons who test positive for COVID-19 will be transferred to a hospital or Living and Treatment Center (Community Treatment Center). Korean nationals or long-term foreign nationals who test negative will be placed under self-quarantine. Foreign nationals who are short-term will be placed under quarantine at designated facilities.<br style=clear:both;/>Asymptomatic Passengers Asymptomatic Korean nationals arriving from Europe and the United States will go into self-quarantine and get diagnostic tests at a health center within three days of arrival. Asymptomatic Korean nationals arriving from countries outside the European countries and the United States will go into self-quarantine and get diagnostic tests if they display any symptoms. Asymptomatic long-term foreign nationals arriving from the United States will be placed under self-quarantine and must get diagnostic tests within three days at a public health clinic. Asymptomatic foreign nationals for long-term and short-term stay arriving from Europe will get diagnostic tests at the airport. Afterwards, long-term foreign nationals will go into self-quarantine while short-term foreign nationals will be quarantined at designated facilities. Asymptomatic long-term stay foreign nationals arriving from countries other than European countries and the United States will go into self-quarantine and get diagnostic tests if they display any symptoms. Asymptomatic short-term foreign nationals arriving from countries outside the European continent will be placed under quarantine at designated facilities and get diagnostic tests if they display any symptoms."
  },
  {
    "continent": "",
    "iso_alpha2": "KW",
    "name": "Kuwait",
    "score": "Entry prohibited",
    "updated": "uwait&amp;item_index=27&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Kuwait<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Kuwait. Limited exemptions exist for certain relatives of Kuwaiti nationals, domestic employees traveling with their employers, and medical staff. More information is available at the following URL: https://corona.e.gov.kw/en"
  },
  {
    "continent": "",
    "iso_alpha2": "KZ",
    "name": "Kazakhstan",
    "score": "Entry prohibited",
    "updated": "azakhstan&amp;item_index=26&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Kazakhstan<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Kazakhstan until further notice. This policy does not apply to diplomats and members of international organizations. From April 1, 2020, all persons entering Kazakhstan from abroad will undergo laboratory tests for COVID-19. Those who test positive will be transferred to an infectious disease hospital for treatment. Those who test negative must self-isolate at home for 14 days. From April 4, 2020, Kazakhstan's borders with China, Kyrgyzstan, Russia, and Uzbekistan are closed.From April 1 to July 1, 2020, the Kazakh government has suspended its 72-hour visa-free transit policy. Nur-Sultan and Almaty International Airports have suspended international flights until further notice."
  },
  {
    "continent": "",
    "iso_alpha2": "LA",
    "name": "Laos",
    "score": "Entry prohibited",
    "updated": "aos&amp;item_index=29&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Laos<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >All border checkpoints are closed and all international flights are suspended. The Laotian government has suspended the issuing of new visas and visa-on-arrival services. This policy does not apply to persons deemed by the government to be experts, technicians, or foreign workers crucial for major projects. Such persons must apply for entry permission from a Laotian embassy or consulate abroad before departing for Laos. All persons seek to travel to Laos are advised to check with their local Laotian embassy or consulate regarding their eligibility for entry prior to making travel arrangements."
  },
  {
    "continent": "",
    "iso_alpha2": "LB",
    "name": "Lebanon",
    "score": "Partially restricted",
    "updated": "ebanon&amp;item_index=30&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Lebanon<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons, prior to boarding flights bound for Lebanon, must preregister online and obtain an approval notification for use at check-in. Additionally, all persons must have proof of a negative result for COVID-19 issued no more than 96 hours prior to departure using a polymerase chain reaction (PCR) test. Those lacking either approval notifications or PCR test results are prohibited from boarding. Prior to arrival, all persons must install the CovidLebTrack mobile application and complete an online health declaration. Upon arrival, all persons must undergo a 72-hour quarantine at a place of residence registered in the CovidLebTrack application. More information including links to preregistration forms is available at the following URL: https://www.mea.com.lb/english/covid19-and-travel/announcements/lebanon-entry-requirements"
  },
  {
    "continent": "",
    "iso_alpha2": "LC",
    "name": "Saint Lucia",
    "score": "Partially restricted",
    "updated": "aint Lucia&amp;item_index=22&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Saint Lucia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From February 10, 2021, all persons must carry proof of a negative result for COVID-19 issued no more than 5 days prior to departure using a polymerase chain reaction (PCR) test. This policy does not apply to children age 4 or younger. Additionally, all persons must submit a Travel Registration Form. More information is available at the following URL: https://www.stlucia.org/en/covid-19/"
  },
  {
    "continent": "",
    "iso_alpha2": "LI",
    "name": "Liechtenstein",
    "score": "Partially restricted",
    "updated": "iechtenstein&amp;item_index=28&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Liechtenstein<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Liechtenstein. This policy does not apply to persons (regardless of origin) entitled to freedom of movement in Switzerland. For all other foreign nationals, entry restrictions may apply. All persons must complete an electronic entry form prior to arrival. Persons arriving from countries or regions deemed by the Swiss Federal Office of Public Health to be at increased risk for COVID-19 infection must carry proof of a negative test result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Persons lacking such proof must undergo testing upon arrival. Additionally, all persons arriving from locations with an increased risk must undergo a 10-day quarantine. Additional information is available at the following URL: https://tourismus.li/en/our-country/about-liechtenstein/current-information-on-covid-19-in-the-principality-of-liechtenstein/"
  },
  {
    "continent": "",
    "iso_alpha2": "LK",
    "name": "Sri Lanka",
    "score": "Partially restricted",
    "updated": "ri Lanka&amp;item_index=40&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Sri Lanka<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All travelers must, prior to departure, apply online to Sri Lankan immigration authorities for an entry visa. Confirmation of a pre-booked quarantine hotel, prepayment for on-arrival polymerase chain reaction (PCR) tests for COVID-19, and proof of valid medical insurance with a minimum coverage amount of US$50,000 are required during the visa application process. More information is available at the following URL: https://www.srilanka.travel/helloagain/"
  },
  {
    "continent": "",
    "iso_alpha2": "LR",
    "name": "Liberia",
    "score": "Partially restricted",
    "updated": "iberia&amp;item_index=28&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Liberia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons must apply online for a Covid-19 Travel Certificate and pay a US$75 application fee prior to departure. Persons unable to submit payment electronically may do so upon arrival in Liberia. Additionally, all persons must undergo testing for COVID-19 upon arrival. Those who test negative must then undergo a 14-day home quarantine. Persons who test positive will be sent to designated locations for treatment. Travel certificate applications are available at the following URL: https://www.liberiacovidtravel.org/"
  },
  {
    "continent": "",
    "iso_alpha2": "LS",
    "name": "Lesotho",
    "score": "Entry prohibited",
    "updated": "esotho&amp;item_index=27&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Lesotho<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >Until Further notice, all borders are closed, all persons are not allowed to enter Lesotho, except for emergency. Every person shall be confined to his place of residence."
  },
  {
    "continent": "",
    "iso_alpha2": "LT",
    "name": "Lithuania",
    "score": "Partially restricted",
    "updated": "ithuania&amp;item_index=29&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Lithuania<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Lithuania. This policy does not apply to citizens and legal residents from countries or regions in the European Union, countries or regions associated with the Schengen Area, Andorra, Monaco, San Marino, United Kingdom, or Vatican City. Prior to boarding transportation bound for Lithuania, all persons must submit an online form to the National Public Health Center containing their personal information for contact tracing purposes. A confirmation QR code must be presented at the time of boarding. Forms are available online at the following URL: https://keleiviams.nvsc.lt/en/formPersons arriving from countries / regions considered by the Lithuanian government as being affected by COVID-19 must carry proof of a negative result for COVID-19 issued no more than 48 hours prior to departure and self-isolate for 10 days upon arrival. Additional information including a list of affected locations is available at the following URL: https://urm.lt/default/en/important-covid19"
  },
  {
    "continent": "",
    "iso_alpha2": "LU",
    "name": "Luxembourg",
    "score": "Partially restricted",
    "updated": "uxembourg&amp;item_index=30&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Luxembourg<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Luxembourg. This policy does not apply to citizens of countries or regions in the European Union, countries or regions associated with the Schengen Area, Andorra, Australia, Japan, Monaco, New Zealand, Rwanda, San Marino, Singapore, South Korea, Thailand, or Vatican City. All persons (regardless of origin) traveling to Luxembourg by air must present proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test or viral antigen test. Additionally, all persons (including transit passengers) arriving from outside the European area must undergo a PCR or antigen test upon arrival in Luxembourg. More information is available at the following URL: https://covid19.public.lu/en/travellers/visiting-luxembourg.html"
  },
  {
    "continent": "",
    "iso_alpha2": "LV",
    "name": "Latvia",
    "score": "Entry prohibited",
    "updated": "atvia&amp;item_index=27&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Latvia<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From February 11, 2021, foreign nationals are prohibited from entering Latvia. This policy provides exemptions for persons traveling for essential or urgent reasons from countries or regions in the European Union and countries or regions associated with the Schengen Area. All persons (including Latvian nationals) must preregister with Latvian authorities no more than 12 hours prior their intended arrival. All persons arriving from abroad must carry proof of a negative test result for COVID-19 issued no more than 72 hours prior to departure. Alternatively, persons may show other medical documentation issued no more than 72 hours prior to departure attesting the traveler is not currently infectious. Persons who, at any point within 90 days of their scheduled departure for the Latvia, tested positive for COVID-19 must present documentation from a recognized healthcare provider attesting they are not infectious. More information and registrations are available at the following URL: https://covidpass.lv/en/"
  },
  {
    "continent": "",
    "iso_alpha2": "LY",
    "name": "Libya",
    "score": "Entry prohibited",
    "updated": "ibya&amp;item_index=29&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Libya<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From March 16, 2020, all air, land, and sea border checkpoints are closed. A state of emergency is in effect."
  },
  {
    "continent": "",
    "iso_alpha2": "MA",
    "name": "Morocco",
    "score": "Entry prohibited",
    "updated": "orocco&amp;item_index=35&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Morocco<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >All air, land, and sea border checkpoints are closed.  This policy does not apply to shipments of cargo. A state of emergency is in effect nationwide until at least January 10, 2021."
  },
  {
    "continent": "",
    "iso_alpha2": "MD",
    "name": "Moldova",
    "score": "Partially restricted",
    "updated": "oldova&amp;item_index=32&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Moldova<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Persons in countries or regions deemed by the Moldovan Ministry of Health, Labor and Social Protection as being at high-risk for the transmission of COVID-19 are prohibited from entering Moldovia. Persons traveling from countries or regions deemed low-risk must undergo temperature screening upon arrival. Any person who has visited or transited through a high-risk location must complete a health questionnaire and sign a declaration stating they intend to comply with a mandatory 14-day self-isolation requirement. An official list of high-risk locations is available from Moldovan authorities at the following URL: https://msmps.gov.md/wp-content/uploads/2020/09/Lista-Tarilor_Zona-Rosie_11.09.2020-744x1024.jpg"
  },
  {
    "continent": "",
    "iso_alpha2": "ME",
    "name": "Montenegro",
    "score": "Partially restricted",
    "updated": "ontenegro&amp;item_index=33&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Montenegro<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. This policy does not apply to children age 4 or under. A nightly curfew is in effect nationwide from 21:00 (9:00 p.m.) to 05:00 (5:00 a.m.). More information is available at the following URL: https://www.gov.me/en/homepage/measures_and_recommendations/"
  },
  {
    "continent": "",
    "iso_alpha2": "MG",
    "name": "Madagascar",
    "score": "Entry prohibited",
    "updated": "adagascar&amp;item_index=30&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Madagascar<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From March 14, all international flights have been suspended. Cruise ships are also banned from entering ports in Madagascar.A nationwide curfew is in place until further notice, from July 9, 2020, the capital and Analamanga region has been in lockdown."
  },
  {
    "continent": "",
    "iso_alpha2": "MH",
    "name": "Marshall Islands",
    "score": "Entry prohibited",
    "updated": "arshall Islands&amp;item_index=6&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Marshall Islands<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >All persons are prohibited from entering the Marshall Islands until further notice."
  },
  {
    "continent": "",
    "iso_alpha2": "MK",
    "name": "North Macedonia",
    "score": "Normal",
    "updated": "orth Macedonia&amp;item_index=34&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>North Macedonia<span class=countryStatusGreen>Normal<div class=sc-3okj19-0 jJdyoA><div class=content >From July 1, 2020, airports have reopened and travelers may enter North Macedonia as normal."
  },
  {
    "continent": "",
    "iso_alpha2": "ML",
    "name": "Mali",
    "score": "Partially restricted",
    "updated": "ali&amp;item_index=32&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Mali<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From July 25, 2020, all persons traveling to Mali must complete an online health declaration and provide proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Persons who fail to provide such proof must, at their own expense, undergo testing and quarantine at a designated facility upon arrival. Health declarations forms are available from the following URLs: www.sante.gov.ml or www.anac-mali.org"
  },
  {
    "continent": "",
    "iso_alpha2": "MM",
    "name": "Myanmar",
    "score": "Entry prohibited",
    "updated": "yanmar&amp;item_index=33&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Myanmar<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >All international commercial flights are suspended and all land border checkpoints are closed. Persons seeking to enter Myanmar for official or urgent purposes should consult their location Myanmar embassy or consulate for information regarding testing and quarantine requirements. All persons (including Myanmar nationals) allowed to enter must undergo a 21-day quarantine at a designated facility followed by 7 days of self-isolation at home. The Myanmar government has suspended the issuing of visas to foreign nationals. This policy does not apply to accredited diplomats, United Nations officials, and crews of ships or aircraft traveling to and from Myanmar. All existing visa-free and visa-on-arrival arrangements are suspended."
  },
  {
    "continent": "",
    "iso_alpha2": "MN",
    "name": "Mongolia",
    "score": "Entry prohibited",
    "updated": "ongolia&amp;item_index=32&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Mongolia<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Mongolia. All cross-border commercial flights, passenger rail services, and passenger vehicular traffic are suspended."
  },
  {
    "continent": "",
    "iso_alpha2": "MO",
    "name": "Macau",
    "score": "Partially restricted",
    "updated": "acau&amp;item_index=7&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Macau<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content ><font face=-apple-system, BlinkMacSystemFont, Microsoft Yahei, emoji-one, sans-serif><span style=white-space: pre-wrap;>All non-residents arriving from overseas are prohibited from entering Macau SAR. This policy does not apply to residents of Hong Kong SAR, Mainland China, and Taiwan provided they have not traveled to any other country or region within 21 days of their arrival in Macau SAR. This policy also provides limited exemptions for non-resident foreigners depending on their circumstances and recent travel history. All persons arriving in Macau SAR from Hong Kong SAR must carry proof of a negative result for COVID-19 issued no more than 24 hours prior to departure using a nucleic acid test and must undergo a 21-day quarantine at a designated facility upon arrival followed by 7 days of self-health management during which they monitor their health status and minimize contact with other persons. All persons arriving from Mainland China must carry proof of a negative result for COVID-19 issued no more than 7 days prior to departure using a nucleic acid test. All persons arriving in Macau SAR from Taiwan must carry proof of a negative result for COVID-19 issued no more than 7 days prior to departure using a nucleic acid test and must undergo a 14-day quarantine at a designated facility upon arrival followed by 7 days of self-health management during which they monitor their health status and minimize contact with other persons. Additional information is available via the following URL: https://www.ssm.gov.mo/apps1/PreventCOVID-19/en.aspx#clg17049"
  },
  {
    "continent": "",
    "iso_alpha2": "MP",
    "name": "Northern Mariana Islands",
    "score": "Partially restricted",
    "updated": "orthern Mariana Islands&amp;item_index=26&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Northern Mariana Islands<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons (including residents) arriving from a country with an identified COVID-19 outbreak (including Guam, Hawaii, and the Continental United States) must self-isolate for 14 days. From March 31, 2020, a curfew is in effect."
  },
  {
    "continent": "",
    "iso_alpha2": "MR",
    "name": "Mauritania",
    "score": "Partially restricted",
    "updated": "auritania&amp;item_index=33&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Mauritania<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons must carry proof of a negative test result for COVID-19 issued no more than 5 days prior to departure using a polymerase chain reaction (PCR) test or antigen test. Upon arrival, all persons must undergo a 10-day quarantine. This policy does not apply to persons arriving from locations with confirmed cases of a new SARS-CoV-2 variant. Such persons will be isolated upon entry and transferred to a designated facility where they must undergo a 14-day quarantine. Persons who undergo a reverse transcription polymerase chain reaction (RT-PCR) test may be eligible for early release from quarantine upon confirmation of a negative test result. Persons who test positive will receive treatment according to current national health protocols. A nightly curfew is in effect nationwide from 20:00 (8:00 p.m.) to 06:00 (6:00 a.m.)."
  },
  {
    "continent": "",
    "iso_alpha2": "MT",
    "name": "Malta",
    "score": "Partially restricted",
    "updated": "alta&amp;item_index=31&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Malta<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content ><font color=#001000 face=Segoe UI, Arial, sans-serif>Foreign nationals are prohibited from entering Malta for non-essential purposes. This policy does not apply to lawful residents or persons traveling from the following countries or regions, provided such persons have not, within 14 days of their scheduled departure for Malta, visited or transited through any other country or region: the European Union, Andorra, Australia, Canada, Hong Kong SAR, Iceland, Indonesia, Japan, Jordan, Lebanon, Liechtenstein, Macau SAR, Mainland China, Monaco, Morocco, New Zealand, Norway, Rwanda, San Marino, South Korea, Switzerland, Taiwan, Thailand, Tunisia, Turkey, United Arab Emirates, Uruguay or Vatican City.<font color=#001000 face=Segoe UI, Arial, sans-serif><font color=#001000 face=Segoe UI, Arial, sans-serif>All persons arriving from countries or regions considered green by Maltese authorities may enter Malta without restriction. Before boarding flights bound for Malta, persons traveling from amber locations must show proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test and are subject to random tests for COVID-19 upon arrival. Persons who reside in red locations must spend at least 14 consecutive days prior to their intended departure within a location considered by Maltese authorities as part of the so-called safe corridor. Authorities further recommend such persons undergo a PCR test no more than 72 hours prior to departure. All persons traveling to Malta are required to complete a Public Health Travel Declaration Form. More information is available at the following URL: https://www.visitmalta.com/en/covid-19"
  },
  {
    "continent": "",
    "iso_alpha2": "MU",
    "name": "Mauritius",
    "score": "Partially restricted",
    "updated": "auritius&amp;item_index=34&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Mauritius<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons who, within 14 days of their scheduled departure, have visited or transited through South Africa or the United Kingdom are prohibited from entering Mauritius. All persons traveling to Mauritius (including infants and children) must carry proof of a negative result for COVID-19 issued no more than 7 days prior to departure from their last point of embarkation using a polymerase chain reaction (PCR) test. Additionally, all persons must show proof of a purchased travel package that includes a 14-day accommodation at a designated quarantine hotel. Travel package costs include a fee in the amount of RS13,500 for additional COVID-19 testing. All persons must undergo 3 post-arrival PCR tests at staggered intervals prior to being released from quarantine. Finally, upon arrival all persons must submit a Public Health COVID-19 Passenger Health Self-Declaration Form and a Passenger Locator Form. More information is available at the following URL: https://booking.mymauritius.travel/"
  },
  {
    "continent": "",
    "iso_alpha2": "MV",
    "name": "Maldives",
    "score": "Partially restricted",
    "updated": "aldives&amp;item_index=31&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Maldives<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Persons traveling for tourism must present proof of a negative result for COVID-19 issued no more than 96 hours prior to initial departure for the Maldives using a polymerase chain reaction (PCR) test. This policy does not apply to infants less than one year old. Travelers who, within 14 days of their intended departure, have a history of contact with a suspected or confirmed case of COVID- 19, or with persons who have fever or respiratory symptoms such as cough, sore throat, shortness of breath are advised not to travel to Maldives. Additional information is available at the following URL: https://visitmaldives.com/en/covid19-updates"
  },
  {
    "continent": "",
    "iso_alpha2": "MW",
    "name": "Malawi",
    "score": "Partially restricted",
    "updated": "alawi&amp;item_index=31&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Malawi<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From September 1, 2020, all persons traveling to Malawi must have proof of a negative test result for COVID-19 issued no more than 10 days prior to departure using a polymerase chain reaction (PCR) test. Travelers must undergo an additional PCR test upon arrival and all returning residents must self-isolate for 14 days."
  },
  {
    "continent": "",
    "iso_alpha2": "MX",
    "name": "Mexico",
    "score": "Normal",
    "updated": "exico&amp;item_index=2&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Mexico<span class=countryStatusGreen>Normal<div class=sc-3okj19-0 jJdyoA><div class=content >Persons traveling to Mexico via air are required to complete a Questionnaire of Identification of Risk Factors in Travelers. The form is available at: https://afac.hostingerapp.com/ . Mexico’s land border with the United States is closed all to non-essential travel."
  },
  {
    "continent": "",
    "iso_alpha2": "MY",
    "name": "Malaysia",
    "score": "Partially restricted",
    "updated": "alaysia&amp;item_index=9&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Malaysia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Reciprocal Green Lane for Singapore Residents From August 10, 2020, legal residents in Singapore may be eligible to travel to Malaysia for business or official travel for up to 14 days using a so-called Reciprocal Green Lane (RGL) scheme. Persons seeking to use the RGL must be sponsored by either a Malaysia-based company or a Malaysian government agency, which will file an application on their behalf for a MyTravelPass at least 10 business days prior to intended departure.Persons seeking to use the RGL cannot have traveled outside of Singapore during the 14 days prior to their scheduled departure for Singapore and must, at their own expense, obtain a certificate showing a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Travelers are required to produce this certificate along with their MyTravelPass and in order to enter Malaysia.RGL travelers must undergo an additional PCR test at their point of entry or within 24 hours of arrival in Malaysia and must be transported directly by the host company or government agency to a non-residential accommodation where they must self-isolate while awaiting their test results. Upon confirmation of a negative test result, the host company or government agency will ensure the traveler is transported to and from their workplace for the duration of the traveler's stay and will further ensure the traveler installs and uses the MySejahtera mobile application. Persons who test positive for COVID-19 must immediately seek necessary medical treatment from the Malaysian government.Periodic Commuting Arrangement for Singapore Residents From August 10, 2020, Singaporean nationals and permanent residents holding valid long-term Malaysian visas for business or work purposes may be eligible for a new Periodic Commuting Arrangement (PCA) scheme allowing travel via the Johor-Singapore Causeway and Malaysia-Singapore Second Link land border checkpoints. Malaysia-based employers must submit an application for a MyTravelPass to use the PCA on behalf of their employees. Applications must be submitted at least 10 business days prior to the employee's intended entry into Malaysia and employees must be willing to remain in Malaysia for at least 90 days before returning to Singapore. Persons using the PCA must install and use the MySejahtera mobile application. Upon arrival in Malaysia, they must self-isolate for 7 days under the terms of a modified Home Surveillance Order (HSO) and afterwards undergo a serological test for COVID-19 using a rapid test kit (RTK). Persons who test negative will be released from their HSO.All Others  Foreign nationals are prohibited from entering Malaysia. This policy does not apply to persons who hold a MyPR card, a Malaysia My Second Home (MM2H) pass, a valid student pass, a valid temporary employment pass, are the spouse or child of Malaysian nationals, or are a diplomat. All persons (including Malaysian nationals) returning from abroad are required to undergo testing for COVID-19 and a 10-day quarantine upon arrival. Persons who carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure for Malaysia using a reverse transcription polymerase chain reaction (RT-PCR) test may be eligible for a shorter 7-day quarantine. Non-nationals must register online and prepay in full for all required testing and quarantine services. Malaysian nationals will be charged a reduced rate. Additionally, all persons must download and sign a Letter of Undertaking and Indemnity for Persons under Surveillance (LoU). Travelers should consult their local Malaysian embassy or consulate for LoU templates and instructions. At least three days prior to departure, all persons must submit relevant documents (including a LoU) to a local Malaysian embassy or consulate for approval. Failure to submit documents may result in a denial of permission to board flights bound for Malaysia. Upon arrival, all persons are required install and use the MySejahtera mobile application to track and monitor their health status. Be advised, some state-level authorities in Malaysia have implemented additional policies and restrictions for persons arriving into their jurisdictions. Registration and prepayment information is available via the following URL: https://safetravel.myeg.com.my/"
  },
  {
    "continent": "",
    "iso_alpha2": "MZ",
    "name": "Mozambique",
    "score": "Partially restricted",
    "updated": "ozambique&amp;item_index=36&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Mozambique<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Persons traveling to Mozambique must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test performed in the country or region of departure. This policy does not apply to children 11 years of age or under. All persons who have had close contact with persons confirmed to have COVID-19 or who have tested positive themselves must undergo a 14-day quarantine. Most land border checkpoints are closed."
  },
  {
    "continent": "",
    "iso_alpha2": "NA",
    "name": "Namibia",
    "score": "Partially restricted",
    "updated": "amibia&amp;item_index=37&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Namibia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Persons arriving in Namibia must have proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Those with valid PCR test results are not subject to quarantine; however, they must undergo an additional PCR test on the 5th day following their arrival. Persons traveling to Namibia for tourism must hold medical insurance valid in Namibia with coverage sufficient for any unexpected health-related expenses. Additionally, they must complete a health declaration form and provide a full travel itinerary to airport officials upon arrival. All international flights are required to arrive at Hosea Kutako International Airport (WDH) in Windhoek. All land border checkpoints are closed except to persons holding a valid work permit. Heath declaration forms and additional information are available at the following URL: http://www.namibiatourism.com.na/page/tourism-revival-initiative"
  },
  {
    "continent": "",
    "iso_alpha2": "NE",
    "name": "Niger",
    "score": "Partially restricted",
    "updated": "iger&amp;item_index=38&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Niger<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons must present proof of a negative test result for COVID-19 issued no more than 72 hours prior to departure. Upon arrival, all persons must self-isolate for 7 days and undergo an additional test for COVID-19 on the 7th day. Persons who test negative will be released from self-isolation. Persons who test positive will be provided treatment in accordance with current national health protocols. This policy does not apply to persons who intend to remain in Niger for less than 14 days provided such persons are able to show a valid departure ticket. All land border checkpoints remain closed until further notice."
  },
  {
    "continent": "",
    "iso_alpha2": "NG",
    "name": "Nigeria",
    "score": "Partially restricted",
    "updated": "igeria&amp;item_index=39&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Nigeria<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From September 18, 2020, all persons arriving in Nigeria must provide proof of a negative result for COVID-19 issued no more than 120 hours prior to departure using a polymerase chain reaction (PCR) test. Results must be uploaded to the Nigeria International Travel Portal website prior to departure. Travelers must also register, pre-pay for a second PCR test to be performed upon arrival, and submit a Health Declaration / Self-Reporting form. Prior to boarding flights bound for Nigeria all persons will undergo a health screening. Those showing symptoms consistent with COVID-19 will not be permitted to board. Additional information and reporting forms are available at the following URL: https://covid19.ncdc.gov.ng/advisory/"
  },
  {
    "continent": "",
    "iso_alpha2": "NI",
    "name": "Nicaragua",
    "score": "Partially restricted",
    "updated": "icaragua&amp;item_index=19&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Nicaragua<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons traveling to Nicaragua must hold proof of a negative test result for COVID-19 issued no more than 72 hours prior to departure. Additionally, all persons between the ages of 1 and 60 must show an original certificate proving they were vaccinated against yellow fever was at least 10 days prior to scheduled departure. Upon arrival, travelers must undergo health screening. Persons exhibiting symptoms consistent with COVID-19 will be quarantined."
  },
  {
    "continent": "",
    "iso_alpha2": "NL",
    "name": "Netherlands",
    "score": "Partially restricted",
    "updated": "etherlands&amp;item_index=4&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Netherlands<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering the Netherlands for non-essential travel. This policy does not apply to nationals and residents from countries or regions in the European Union, countries or regions associated with the Schengen Area, Australia, New Zealand, Rwanda, Singapore, South Korea, or Thailand. Further exemptions exist for cross-border commuters, diplomats, elite athletes and their support staff, flight crews, key workers, members of the armed forces traveling to the Netherlands as part of their duties, persons who hold a long-stay visa, persons who hold a service passport traveling to the Netherlands as part of their duties, persons who hold a valid residence permit, persons who work in the energy or transport sectors, persons who work for international or humanitarian organizations, persons whose purpose of travel will have demonstrable value for the Dutch economy and Dutch society, persons with a compelling family interest, professional journalists, researchers, seafarers in possession of a seafarer's record book (excluding seafarers on commercial yachts and pleasure crafts), or seasonal workers. Be advised, some regional- and municipal-level authorities in the Netherlands have implemented additional policies and restrictions for persons arriving into their jurisdictions. A complete list of exempted categories and information about required documentation is available at the following URL: https://www.government.nl/topics/coronavirus-covid-19/visiting-the-netherlands-from-abroadAll persons (including Dutch nationals) traveling from a high-risk location must, regardless of their mode of transportation, present two separate, negative test results for COVID-19. One must be issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. The other must be issued no more than 4 hours prior to departure using a rapid antigen or a loop-mediated isothermal amplification (LAMP) test. This policy does not apply to persons traveling from Australia, Iceland, New Zealand, Rwanda, Singapore, South Korea, or Thailand. Additionally, all persons must self-isolate for 10 days upon arrival. This policy does not apply to cross-border commuters, students, persons engaged in the cross-border transportation of goods or passengers, and persons visiting a child, parent, partner, or spouse. More information is available at the following URL: https://www.government.nl/topics/coronavirus-covid-19/visiting-the-netherlands-from-abroad/mandatory-negative-test-results-and-declaration"
  },
  {
    "continent": "",
    "iso_alpha2": "NO",
    "name": "Norway",
    "score": "Entry prohibited",
    "updated": "orway&amp;item_index=35&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Norway<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From January 29, 2021, foreign nationals are prohibited from entering Norway. This policy does not apply to lawful foreign residents, transit passengers, persons with special reasons to enter Norway, persons traveling in order to have formalized contact with a parent or child, close family members of persons residing in Norway, journalists and other personnel on assignment for a foreign media institution, seafarers and aviation personnel, persons who perform commercial transport of goods and passengers, persons who work in critical public functions, and healthcare personnel from Sweden and Finland who work in the Norwegian health and care services. More information is available at the following URL: https://www.regjeringen.no/en/aktuelt/norway-introduces-its-strictest-entry-rules-since-march-2020/id2830390/"
  },
  {
    "continent": "",
    "iso_alpha2": "NP",
    "name": "Nepal",
    "score": "Partially restricted",
    "updated": "epal&amp;item_index=34&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Nepal<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons seeking to travel to Nepal for tourism must obtain either a valid tourist visa or pre-approval for a visa-on-arrival from a Nepali embassy or consulate abroad. This policy provides exemptions for diplomats, personnel working for international or certain non-governmental organizations, and their family members, persons who hold Non-Resident Nepali (NRN) status, foreign nationals with Nepali origins or family members, and trekkers and mountaineers who meet specific requirements. All persons traveling to Nepal must present proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. This policy does not apply to children under 5 years of age. All persons must undergo a 10-day quarantine upon arrival. Persons who elect to undergo an additional PCR test after 5 days in quarantine may be eligible for early release upon confirmation of a negative result. This policy does not apply to persons arriving from locations with confirmed cases of a new SARS-CoV-2 variant. Such persons must, at their own expense, undergo a full 10-day quarantine in a designated location. Persons seeking to enter Kathmandu Valley from other districts must hold proof of a recent negative PCR test result as well as authorization from Chief District Officer for Kathmandu Valley. Additional information for trekkers and mountaineers is available at the following URL: https://trade.welcomenepal.com/entry-protocol-for-mountaineering-expeditions-and-trekking-in-nepal/"
  },
  {
    "continent": "",
    "iso_alpha2": "NU",
    "name": "Niue",
    "score": "Entry prohibited",
    "updated": "iue&amp;item_index=8&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Niue<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From April 2 to August 31, 2020, foreign nationals are prohibited from entering Niue. This policy does not apply to residents who have lived in Niue for more than 12 months and residents who have lived continuously in Niue for at least 6 of the past 12 months, professionals, and technicians such as medical personnel who hold written permission from the Niue government. All persons arriving to Niue by flight must undergo a 14-day quarantine at a designated facility."
  },
  {
    "continent": "",
    "iso_alpha2": "NZ",
    "name": "New Zealand",
    "score": "Entry prohibited",
    "updated": "ew Zealand&amp;item_index=2&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>New Zealand<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering New Zealand. This policy does not apply lawful residents holding valid travel documents, partners or dependent children of New Zealand nationals or residents who hold a valid visa based on this status, Australian nationals or lawful permanent residents who ordinarily reside in New Zealand, and diplomats posted to New Zealand. All other non-nationals and non-residents who do not fall into one of the aforementioned categories must obtain approval from New Zealand immigration authorities prior to boarding flights bound for New Zealand. Separate restrictions apply to persons seeking to transit New Zealand for final destinations abroad. All travelers should consult the latest information regarding restrictions on transit prior to finalizing travel arrangements. All persons (including New Zealand nationals and transit passengers) must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR), loop-mediated isothermal amplification (LAMP), or antigen test. This policy provides exemptions for children under 2 years of age and persons traveling from the following locations: Antarctica, Australia, Cook Islands, Micronesia, Fiji, Kiribati, Marshall Islands, Nauru, New Caledonia, Niue, Palau, Samoa, Solomon Islands, Tokelau, Tonga, Tuvalu, Vanuatu, and Wallis and Futuna. All arriving persons (including New Zealand nationals) must undergo a 14-day quarantine at a designated facility upon arrival. This policy does not apply to persons arriving from the Cook Islands. Additional information and request forms for travel to New Zealand are available at the following URL: https://www.immigration.govt.nz/formshelp/request-for-travel-to-new-zealand"
  },
  {
    "continent": "",
    "iso_alpha2": "OM",
    "name": "Oman",
    "score": "Partially restricted",
    "updated": "man&amp;item_index=35&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Oman<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons must, prior to departure, preregister with Omani authorities and install the Tarassud mobile application. All travelers must carry proof written in Arabic or English of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test, and must have proof of valid medical insurance. Upon arrival, all persons must, at their own expense, undergo an additional PCR test and a 7-day quarantine followed by a third PCR test at the end of the quarantine period. During quarantine, all persons must wear an electronic monitoring bracelet connected to the Tarassud application. This policy provides some exceptions for diplomats and children under the age of 15. All land border checkpoints are closed until further notice. More information regarding registration and the Tarassud application are available from the following URLs: https://www.covid19.emushrif.om/traveler/travel https://tarassud.moh.gov.om/#/login"
  },
  {
    "continent": "",
    "iso_alpha2": "PA",
    "name": "Panama",
    "score": "Entry prohibited",
    "updated": "anama&amp;item_index=20&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Panama<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >All persons arriving in Panama are required to show proof of a negative test result for COVID-19 issued no more than 48 hours prior to departure using a polymerase chain reaction (PCR) or antigen test. Persons without such proof must, at their own expense, undergo a PCR test upon arrival followed by a 7-day quarantine at a designated location and an additional PCR test after 7 days."
  },
  {
    "continent": "",
    "iso_alpha2": "PE",
    "name": "Peru",
    "score": "Entry prohibited",
    "updated": "eru&amp;item_index=10&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Peru<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Peru for tourism. A daily curfew is in effect nationwide from 21:00 (9:00 p.m.) to 04:00 (4:00 a.m.)."
  },
  {
    "continent": "",
    "iso_alpha2": "PG",
    "name": "Papua New Guinea",
    "score": "Partially restricted",
    "updated": "apua New Guinea&amp;item_index=10&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Papua New Guinea<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons traveling to Papua New Guinea (including nationals) must arrive via air at Jacksons International Airport (POM) in Port Moresby. Traditional border checkpoints on routes from Australia, Indonesia, Micronesia, and the Solomon Islands are closed. In order to board a flight bound for Papua New Guinea, all persons must provide proof they have tested negative for detectable levels of COVID-19 within the previous 7 days and hold authorization from the Controller of the COVID-19 National Control Centre. Upon arrival, all persons must undergo quarantine at a designated facility in Port Moresby. This requirement does not apply to diplomats, who may self-isolate for 14-days at their place of residence."
  },
  {
    "continent": "",
    "iso_alpha2": "PH",
    "name": "Philippines",
    "score": "Partially restricted",
    "updated": "hilippines&amp;item_index=10&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Philippines<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From February 1, 2021, foreign nationals are prohibited from entering the Philippines. This policy does not apply to foreign spouses and children of Filipino nationals, foreign parents of Filipino minors or children with special needs, persons who hold an eligible long-term visa, diplomatic officials, persons who work for international organizations, foreign airline crew members, foreign seafarers holding a category 9(c) visa, or persons who previously held a Philippine passport traveling under the Balikbayan program, and the spouses and children of such persons.Foreign nationals permitted to enter the Philippines must hold a valid entry visa. This policy does not apply to persons traveling under the Balikbayan program. Foreign nationals must install the Traze contact tracing mobile application, have proof of a pre-booked accommodation of at least 7 nights in an accredited quarantine facility, and undergo testing for COVID-19 prior to the end of the quarantine period. All entry to the Philippines is subject to limitation regarding the maximum number of allowed inbound passengers at the specific arrival port on the scheduled arrival date. All travelers are encouraged to contact their local Philippine embassy or consulate in order to verify their entry eligibility prior to finalizing travel arrangements.Overseas Filipino Workers (OFWs) and persons traveling together as a family with at least 1 OFW must submit an electronic case investigation form (e-CIF) online prior to boarding flights bound for the Philippines. Non-OFWs and foreign nationals should consult their airline regarding the submission of an e-CIF. The e-CIF system for OFWs is available at the following URL: https://e-cif.redcross.org.ph/"
  },
  {
    "continent": "",
    "iso_alpha2": "PK",
    "name": "Pakistan",
    "score": "Partially restricted",
    "updated": "akistan&amp;item_index=36&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Pakistan<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From October 5, 2020, all persons arriving in Pakistan from abroad must carry proof of a negative result for COVID-19 issued no more than 96 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. This policy does not apply to persons arriving from certain countries or regions. Upon arrival, all persons must undergo health screening and provide contact information via the PassTrack mobile application on a web-based form. Additional information, including a list of locations exempted from testing requirements, is available at the following URL: http://covid.gov.pk/intl_travellers/current_policies"
  },
  {
    "continent": "",
    "iso_alpha2": "PL",
    "name": "Poland",
    "score": "Partially restricted",
    "updated": "oland&amp;item_index=36&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Poland<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Poland. This policy does not apply to nationals from countries or regions in the European Union, countries or regions associated with the Schengen Area, Australia, Canada, Georgia, Japan, New Zealand, South Korea, Thailand, or Tunisia. Further exemptions exist for certain categories of foreign nationals. Upon arrival, travelers must undergo a 10-day quarantine. This policy does not apply to persons carrying proof of a negative test result for COVID-19 issued no more than 48 hours prior to departure or to persons carrying proof of a completed COVID-19 vaccination regimen. Further exemptions exist for nationals from countries or regions in the European Union, countries or regions associated with the Schengen Area, and certain other, limited categories of persons. Additional information is available at the following URL: https://www.gov.pl/web/coronavirus/travel"
  },
  {
    "continent": "",
    "iso_alpha2": "PS",
    "name": "Palestine",
    "score": "Partially restricted",
    "updated": "alestine&amp;item_index=37&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Palestine<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From March 22, travelers from abroad will be quarantined at designated locations."
  },
  {
    "continent": "",
    "iso_alpha2": "PT",
    "name": "Portugal",
    "score": "Partially restricted",
    "updated": "ortugal&amp;item_index=5&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Portugal<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From February 14, 2021, foreign nationals are prohibited from entering Portugal. This policy does not apply to persons arriving from countries or regions in the European Union, countries or regions associated with the Schengen Area, Australia, Hong Kong SAR, Macau SAR, Mainland China, New Zealand, Rwanda, Singapore, South Korea, or Thailand. Persons seeking to travel to Portugal from any other country or region may do so only for essential purposes, which does not include tourism. All persons arriving by air must fill out a Passenger Locator Card for contact tracing purposes. All persons arriving by air from Australia, Hong Kong SAR, Macau SAR, Mainland China, New Zealand, Rwanda, Singapore, South Korea, Thailand, or locations where the current rate of COVID-19 infection is between 150 and 500 per 100,000 inhabitants must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. All persons arriving by air from locations where the current rate of COVID-19 infection exceeds 500 per 100,000 inhabitants must, in addition to a negative RT-PCR test, undergo a 14-day quarantine at their residence or a designated facility. This policy does not apply to persons traveling for essential reasons or persons holding proof they will remain within Portuguese jurisdiction for less than 48 hours. Further exemptions to testing requirements exist for children under 2 years of age. Portugal’s land border with Spain is closed to foreign nationals and cross-border passenger rail traffic is suspended. This policy does not apply to lawful residents entering at designated border checkpoints. All sea border checkpoints are closed to passenger traffic. More information about testing requirements is available at the following URL: https://imigrante.sef.pt/en/covid-19/faqs/#1596230931926-35f82bfa-7209"
  },
  {
    "continent": "",
    "iso_alpha2": "PW",
    "name": "Palau",
    "score": "Partially restricted",
    "updated": "alau&amp;item_index=9&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Palau<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From February 5 until June 30, 2020, Palau will prohibit entry of all travelers with travel history originating from or transiting through mainland China, Hong Kong and Macau within 14 days of their arrival in the country.Exemption may be made to this prohibition for Palauan citizens and residents, provided that such persons submit to a comprehensive health screening and agree to a 14-day self-quarantine upon arrival in Palau.Any person, including a crew member, a Palauan citizen, or a Palau resident, arriving into Palau at any point of entry is required to complete a health declaration form and to submit to all testing and quarantine procedures.All resident workers of Palau are advised to carry their worker’s permit and immigration entry permit while traveling.From February 1 to June 30, 2020, flights from mainland China (including Hong Kong, Macau) to Palau are suspended."
  },
  {
    "continent": "",
    "iso_alpha2": "PY",
    "name": "Paraguay",
    "score": "Partially restricted",
    "updated": "araguay&amp;item_index=9&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Paraguay<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From November 16, 2020, all persons arriving in Paraguay must have proof of a negative test result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. All persons must also carry proof of international medical insurance valid for use in Paraguay. This policy does not apply to travelers from countries or regions part of the Southern Common Market (Mercosur). Persons without such proof must undergo quarantine upon arrival."
  },
  {
    "continent": "",
    "iso_alpha2": "QA",
    "name": "Qatar",
    "score": "Entry prohibited",
    "updated": "atar&amp;item_index=38&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Qatar<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Qatar. Qatari nationals and Qatar ID (QID) holders returning from abroad must have a confirmed 14-day reservation at a government-approved quarantine hotel. Bookings should be made online at the Discover Qatar website. Failure to secure a booking prior to arrival may result in a denial of permission to enter Qatar. Persons holding a QID are advised not to book a quarantine package before receiving approval to return to Qatar. Additional information is available at the following URL: https://portal.www.gov.qa/wps/portal/qsports/home"
  },
  {
    "continent": "",
    "iso_alpha2": "RO",
    "name": "Romania",
    "score": "Partially restricted",
    "updated": "omania&amp;item_index=37&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Romania<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals and stateless persons are prohibited from entering Romania. This policy does not apply to citizens from countries and regions in the European Union, foreign nationals and their family members who legally reside in Romania, persons who hold a valid Romanian residence permit, and diplomats or staff of international organizations and humanitarian missions. All persons arriving from locations considered high-risk for COVID-19 transmission must carry proof of a negative test result for COVID-19 issued no more than 72 hours prior to departure. This policy does not apply to persons who have completed a full vaccination regimen or to children age 3 or under. Persons displaying symptoms consistent with COVID-19 must self-isolate for 14 days upon arrival. An offical list of high-risk locations is available at: http://www.cnscbt.ro/index.php/liste-zone-afectate-covid-19/ . All persons must submit the online health declaration form at the following URL: https://chestionar.stsisp.ro/start"
  },
  {
    "continent": "",
    "iso_alpha2": "RS",
    "name": "Serbia",
    "score": "Partially restricted",
    "updated": "erbia&amp;item_index=39&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Serbia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From January 14, 2021, all persons must present proof of a negative result for COVID-19 issued no more than 48 hours prior to departure using a polymerase chain reaction (PCR) test. This policy does not apply to persons traveling from Albania, Bosnia and Herzegovina, Bulgaria, Montenegro, or North Macedonia. Persons traveling from the United States may alternatively present results from an antigen test. Lawful residents who do not have proof of a negative test result must register with Serbian authorities self-isolate for 10 days upon arrival. Testing and self-isolation requirements do not apply to children under 12 years of age or transit passengers who will remain in Serbian jurisdiction for less than 12 hours. Information on registration is available from the following URL: https://www.zdravlje.gov.rs/index.php"
  },
  {
    "continent": "",
    "iso_alpha2": "RU",
    "name": "Russia",
    "score": "Partially restricted",
    "updated": "ussia&amp;item_index=38&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Russia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content ><span style=font-size: 14.6667px;>From February 20, 2021, foreign nationals are prohibited from entering Russia and land border checkpoints are closed to passenger transport with the exception of limited rail links to Belarus. This policy does not apply to persons arriving by air Armenia, Azerbaijan, Belarus, Cuba, Egypt, Ethiopia, Finland, Greece, India, Japan, Kazakhstan, Kyrgyzstan, Maldives, Qatar, Serbia, Seychelles, Singapore, South Korea, Switzerland, Tanzania, Turkey, United Arab Emirates, United Kingdom, Vietnam, or to certain categories of foreign nationals arriving via land, rail, or sea transport. Further exemptions exist for lawful residents, diplomats, airplane crew members, or those traveling for urgent business or medical reasons. Persons seeking to enter Russia must present documentation issued in either English or Russian showing a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Additionally, all persons, regardless of purpose, must carry proof of medical insurance valid for use in Russia for the entire duration of their intended stay. The minimum coverage amount should be US$35,000. Persons traveling to Russia for purposes of employment must undergo a 14-day quarantine upon arrival. Russian nationals returning from abroad are required to submit an online registration from, undergo a PCR test within 72 hours of arrival in Russia, and report their test results to national authorities. Registration forms are available at the following URL: https://www.gosuslugi.ru/"
  },
  {
    "continent": "",
    "iso_alpha2": "RW",
    "name": "Rwanda",
    "score": "Partially restricted",
    "updated": "wanda&amp;item_index=40&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Rwanda<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Persons traveling to Rwanda must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Upon arrival, all persons must, at their own expense, undergo an additional PCR test for COVID-19 at the cost of US$60. Additionally, all persons must self-isolate for 7 days at their home or a suitable accommodation and undergo a third test for COVID-19 at the end of the self-isolation period. This policy does not apply to business travelers intending to remain in Rwanda for less than 7 days or to foreign tourists visiting national parks. All persons must fill in and submit an online Passenger Locator Form at the following URL: https://travel.rbc.gov.rw/travel/A nightly curfew is in effect nationwide between 21:00 (9:00 p.m.) and 05:00 (5:00 a.m.) and several districts in Kigali are under confinement orders. Masks must be worn in public and all land border checkpoints remain closed."
  },
  {
    "continent": "",
    "iso_alpha2": "SA",
    "name": "Saudi Arabia",
    "score": "Partially restricted",
    "updated": "audi Arabia&amp;item_index=39&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Saudi Arabia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From January 3, 2021, all persons from countries or regions identified by the Saudi Ministry of Health as having confirmed cases of the new so-called VOC-202012/01 or 501Y.V2 variants of the SARS-CoV-2 virus are prohibited from entering Saudi Arabia. This policy does not apply to persons who can prove they underwent a 14-day quarantine in a safe country / region prior to departure for Saudi Arabia and who also carry proof of a negative result for COVID-19 using a polymerase chain reaction (PCR) test. Before boarding flights bound for Saudi Arabia, all persons aged 8 and above must show proof of a negative PCR test for COVID-19 issued no more than 72 hours prior to departure. Additionally, all persons must undergo quarantine upon arrival for between 3 and 7 days following by a PCR test. Persons with a travel history in locations known to have VOC-202012/01 or 501Y.V2 transmission may be required to undergo additional quarantine measures."
  },
  {
    "continent": "",
    "iso_alpha2": "SB",
    "name": "Solomon Islands",
    "score": "Entry prohibited",
    "updated": "olomon Islands&amp;item_index=12&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Solomon Islands<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From March 22, Non-Citizens of Solomon Islands will not be permitted to enter the country. Solomon Islands Citizens and residents who travelled through any country reporting cases of COVID-19 (Coronavirus) will be permitted to enter but will undergo mandatory strict quarantine for 14 days."
  },
  {
    "continent": "",
    "iso_alpha2": "SC",
    "name": "Seychelles",
    "score": "Partially restricted",
    "updated": "eychelles&amp;item_index=43&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Seychelles<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering the Seychelles. This policy does not apply to countries and regions designated by the Seychellois government as either Category 1 or Category 2. Persons traveling from Category 1 locations must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test performed by an accredited laboratory. Persons traveling from Category 2 locations must carry proof of a negative result for COVID-19 issued no more than 48 hours prior to departure using a PCR test performed by an accredited laboratory. Additionally, such persons must undergo a 10-day quarantine and an additional PCR test upon arrival. Further exemptions exist for persons who carry proof of a completed COVID-19 vaccination regimen. Such proof must be issued by a recognized national health authority and show the traveler has, at least 14 days prior to their scheduled departure for the Seychelles, received all necessary doses of one of the current, internationally-recognized vaccines for COVID-19. More information is available at the following URLs: https://advisory.seychelles.travel/http://tourism.gov.sc/ http://www.health.gov.sc/"
  },
  {
    "continent": "",
    "iso_alpha2": "SD",
    "name": "Sudan",
    "score": "Partially restricted",
    "updated": "udan&amp;item_index=48&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Sudan<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From September 1, 2020, all persons arriving in Sudan must have proof of a negative result for COVID-19 issued no more than 96 hours prior to departure using a polymerase chain reaction (PCR) test performed by a certified provider. This policy does not apply to children age 6 or under."
  },
  {
    "continent": "",
    "iso_alpha2": "SE",
    "name": "Sweden",
    "score": "Partially restricted",
    "updated": "weden&amp;item_index=42&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Sweden<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From February 6, 2021, foreign nationals are prohibited from entering Sweden for non-essential travel. This policy does not apply to persons traveling from countries or regions in the European Union (with the exception of Denmark) and countries or regions associated with the Schengen Area (with the exception of Norway). Foreign nationals seeking to enter Sweden must carry proof of a negative test result for COVID-19 issued no more than 48 hours prior to departure. Persons who regularly cross the border work must present a negative test result issued no more than 7 days prior to their arrival at a border checkpoint. More information is available at the following URL: https://polisen.se/en/the-swedish-police/the-coronavirus-and-the-swedish-police/travel-to-and-from-sweden/"
  },
  {
    "continent": "",
    "iso_alpha2": "SG",
    "name": "Singapore",
    "score": "Partially restricted",
    "updated": "ingapore&amp;item_index=2&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Singapore<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Air Travel Pass Available to Travelers from Select Locations Travelers departing from Australia, Brunei Darussalam, Mainland China, New Zealand, Taiwan, or Vietnam are permitted to enter Singapore for short-term visits including for tourism. Travelers must apply for an Air Travel Pass (ATP) at least 7 days and no more than 30 days prior to their intended arrival in Singapore and must remain entirely within one of the permitted departure locations for the 14 days prior to their scheduled departure.Travelers applying for an ATP must have proof of medical insurance valid for use in Singapore for the entire duration of their stay. The minimum coverage amount must be no less than S$30,000. Upon arrival, all persons must, at their own expense, undergo a polymerase chain reaction (PCR) test for COVID-19 and self-isolate for 1-2 days at a pre-booked, non-residential accommodation while awaiting their test results. All persons are required to install the TraceTogether mobile app for contact tracing purposes and submit their personal information electronically via SG Arrival Card system. Persons who hold a passport that requires a visa for travel to Singapore must separately obtain a valid visa prior to departure. An ATP is NOT a substitute for a required visa. Additional information including links to ATP applications are available at the following URL: https://safetravel.ica.gov.sg/arriving/overviewReciprocal Green Lane for Residents from Select Locations Residents from Brunei Darussalam and Mainland China (with exceptions) may be eligible to travel to Singapore for business or official travel using a so-called Reciprocal Green Lane (RGL) scheme. Persons seeking to use the RGL must be sponsored by either a Singapore-based company or a Singapore Government agency, which will file an application on their behalf for a SafeTravel Pass. Once approved, SafeTravel Pass holders may then apply for a standard travel visa (persons holding existing valid visas need not apply for a new visa). Only residents from the following locations in Mainland China are eligible to use the RGL: Chongqing Municipality, Guangdong Province, Jiangsu Province, Shanghai Municipality, Tianjin Municipality, and Zhejiang Province.Persons seeking to use the RGL cannot have traveled outside one of permitted departure locations during the 14 days prior to their scheduled departure for Singapore and must, at their own expense, obtain a certificate showing a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test performed by an accredited laboratory in the departure location. Travelers are required to produce this certificate along with their SafeTravel Pass, valid travel visa, and proof of a return ticket or other onward transportation in order to enter Singapore. From February 1, 2021, travelers applying to enter Singapore using the RGL must have proof of medical insurance valid for use in Singapore for the entire duration of their stay. The minimum coverage amount must be no less than S$30,000.Upon arrival, RGL travelers will undergo an additional PCR test at their own expense and will be transported by the host company or government agency to a non-residential accommodation where they must self-isolate while awaiting their test results. Upon confirmation of a negative test result, the host company or government agency will ensure the traveler is transported to and from their workplace for the duration of the traveler's stay in Singapore. The host company or government agency will further ensure the traveler installs and uses the TraceTogether mobile app for the duration of the traveler's stay in Singapore. RGL travelers are not permitted to use public transportation while in Singapore.Periodic Commuting Arrangement for Malaysian Residents Malaysian nationals and permanent residents holding valid Singapore work passes may be eligible for a new Periodic Commuting Arrangement (PCA) scheme allowing cross-border travel at the Johor-Singapore Causeway and Malaysia-Singapore Second Link. Singapore-based employers must submit an application to use the PCA on behalf of their employees. Applications must be submitted at least 7 days prior to the employee's intended entry into Singapore and employees must be willing to remain in Singapore for at least 90 days. Specific information requirements for submitting a PCA application are available at the following URL: https://safetravel.ica.gov.sg/pca/overviewPrior to arrival, persons using the PCA must complete an electronic Health Declaration Card (eHDC) found at the following URL: https://eservices.ica.gov.sg/sgarrivalcard . They must also install the TraceTogether, Homer, and WhatsApp mobile applications. Upon arrival, persons using the PCA must refrain from using public transportation and proceed directly to their registered accommodation where they must self-isolate for 7 days under the terms of their Stay Home Notice (SHN). During the self-isolation period, persons are only allowed to leave their SHN location to go to a designated testing facility to undergo a PCR swab test for COVID-19. During their stay, persons in Singapore under the PCA must abide by all prevailing local public health requirements and safe distancing measures. Persons using the PCA, or their employers, must agree to cover all costs associated with self-isolation and testing.All Others The following policies are in place:1) From January 24, 2021, all persons (including Singapore nationals and permanent residents) must, regardless of origin, undergo a polymerase chain reaction (PCR) test for COVID-19 upon arrival in Singapore. Additionally, all persons will be directed to either self-isolate for between 7 and 14 days at their place of residence or undergo a 14-day quarantine at a designated facility. All persons are subject to additional PCR testing requirements at the discretion of authorities in Singapore;2) All persons arriving in Singapore (regardless of origin) must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. This policy does not apply to Singaporean nationals or lawful permanent residents. All persons (including Singapore nationals and permanent residents) must submit a health declaration to immigration authorities upon arrival;3) Persons who, within 14 days of their scheduled departure for Singapore, have visited South Africa or the United Kingdom are prohibited from entering Singapore. This policy does not apply to Singapore nationals or permanent residents; however, such persons must undergo a PCR test for COVID-19 and self-isolate for 14 days upon arrival in Singapore;4) Persons who, for the 14 consecutive days prior to their departure for Singapore, have remained in either Australia, Brunei Darussalam, Mainland China, New Zealand, Taiwan, or Vietnam may apply for an Air Travel Pass (ATP) at least 7 days and no more than 30 days prior to their intended arrival in Singapore. Upon arrival, such persons must undergo testing for COVID-19; however, they are not required to self-isolate or undergo quarantine. Persons who test positive must undergo treatment at their own expense;5) All other short-term visitors, regardless of origin, are prohibited from entering or transiting through Singapore;6) All foreign nationals holding a Long-Term Pass issued by Immigration &amp; Checkpoints Authority (ICA) must obtain prior permission from the relevant government agency prior to departing for Singapore. This includes Long-Term Visit Pass (LTVP) or Student's Pass (STP), or In-Principle Approval (IPA) letters for LTVP or STP.Additional information is available from the following URL: https://safetravel.ica.gov.sg/arriving/overview"
  },
  {
    "continent": "",
    "iso_alpha2": "SI",
    "name": "Slovenia",
    "score": "Partially restricted",
    "updated": "lovenia&amp;item_index=41&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Slovenia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >The Slovenia government classifies countries / regions based on determinations by Slovenian authorities. Nationals and lawful residents from green locations may enter Slovenia without restriction and / or quarantine. Persons arriving from yellow locations must undergo a 10-day quarantine upon arrival. This policy does not apply to foreign nationals holding valid temporary or permanent residence in Slovenia, persons traveling from countries / regions in the European Union or countries / regions associated with the Schengen Area provided such persons can prove they have not visited any red locations. All persons arriving from red locations, regardless of their status, must undergo a 10-day quarantine upon arrival in Slovenia. Additional information and a current list of location designations is available at the following URL: https://www.gov.si/en/topics/coronavirus-disease-covid-19/border-crossing/From October 25, 2020, nightly restrictions on movement and public gatherings are in effect nationwide from 21:00 (9:00 p.m.) and 06:00 (6:00 a.m.). More information is available at the following URL: https://www.gov.si/en/topics/coronavirus-disease-covid-19/"
  },
  {
    "continent": "",
    "iso_alpha2": "SK",
    "name": "Slovakia",
    "score": "Partially restricted",
    "updated": "lovakia&amp;item_index=40&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Slovakia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons arriving from abroad must undergo 14-day self-isolation at home or in a suitable accommodation. This policy does not apply to persons who carry proof of a negative result for COVID-19 issued no more 72 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. Additional exemptions exist for other limited categories of persons depending on their purpose and travel history. All persons should register online with Slovak authorities prior to arrival. More information and links to registration forms are available at the following URL: https://korona.gov.sk/en/travelling-to-slovakia-and-covid19/"
  },
  {
    "continent": "",
    "iso_alpha2": "SL",
    "name": "Sierra Leone",
    "score": "Partially restricted",
    "updated": "ierra Leone&amp;item_index=44&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Sierra Leone<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From August 7, 2020, all persons must complete a health form, show proof of prepayment for COVID-19 tests to be carried out on arrival in Sierra Leona, and present proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Upon arrival, all persons are subject to both a PCR test and a rapid diagnostic test (RDT). Persons who test positive using the RDT will be quarantined at their own expense while awaiting their PCR test result. Persons who test positive using the PCR test will be contacted by health authorities regarding available treatment options. Prepayment instructions, health declaration forms, and additional information are available at the following URL: https://www.travel.gov.sl . All land border checkpoints remain closed to passenger traffic."
  },
  {
    "continent": "",
    "iso_alpha2": "SN",
    "name": "Senegal",
    "score": "Entry prohibited",
    "updated": "enegal&amp;item_index=42&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Senegal<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Senegal. This policy does not apply to persons arriving by air who hold a valid residence permit. Additional exemptions exist for persons who hold special authorization from the Senegalese government. All persons allowed entry to Senegal must present proof of a negative test result for COVID-19 issued no more than 5 days prior to departure. All land and sea border checkpoints are closed until further notice."
  },
  {
    "continent": "",
    "iso_alpha2": "SO",
    "name": "Somalia",
    "score": "Partially restricted",
    "updated": "omalia&amp;item_index=45&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Somalia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From August 3, 2020, all persons traveling to Somalia must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure. A nightly curfew is in effect in Mogadishu from 20:00 (8:00 p.m.) to 05:00 (5:00 a.m.) and all travel into the city is prohibited during those hours."
  },
  {
    "continent": "",
    "iso_alpha2": "SR",
    "name": "Suriname",
    "score": "Entry prohibited",
    "updated": "uriname&amp;item_index=11&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Suriname<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >All travel to Suriname is prohibited. All air, land, and sea border checkpoints are closed until further notice. A nightly curfew is in effect nationwide from 21:00 (9:00 p.m.) to 05:00 (5:00 a.m.)."
  },
  {
    "continent": "",
    "iso_alpha2": "SS",
    "name": "South Sudan",
    "score": "Entry prohibited",
    "updated": "outh Sudan&amp;item_index=47&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>South Sudan<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >Travelers from more than 70 coronavirus affected countries and regions will not be allowed entry. From March 23, all international passenger flights will be suspended and all borders will be closed, except for cargo and humanitarian missions. All land borders will be closed, except for cargo."
  },
  {
    "continent": "",
    "iso_alpha2": "ST",
    "name": "Sao Tome and Principe",
    "score": "Partially restricted",
    "updated": "ao Tome and Principe&amp;item_index=41&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Sao Tome and Principe<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons arriving in Sao Tome and Principe must have proof of a negative test result for COVID-19 issued no more than 72 prior to departure. Persons who test positive, the close contacts of such persons, and persons exhibiting symptoms consistent with COVID-19 must undergo quarantine upon arrival. Persons holding a passport from a country or region in Europe may travel to Sao Tome and Principe visa-free for up to 15 days."
  },
  {
    "continent": "",
    "iso_alpha2": "SV",
    "name": "El Salvador",
    "score": "Partially restricted",
    "updated": "l Salvador&amp;item_index=13&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>El Salvador<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons traveling to El Salvador must have proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. More information is available at the following URL: http://www.cepa.gob.sv/"
  },
  {
    "continent": "",
    "iso_alpha2": "SX",
    "name": "Sint Maarten",
    "score": "Entry prohibited",
    "updated": "int Maarten&amp;item_index=24&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Sint Maarten<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From March 30, 2020, all persons are prohibited from entering Sint Maarten. A curfew from 20:00 to 06:00 (8:00 p.m. to 6:00 a.m.) is in place."
  },
  {
    "continent": "",
    "iso_alpha2": "SY",
    "name": "Syria",
    "score": "Partially restricted",
    "updated": "yria&amp;item_index=41&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Syria<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From March 19, Citizens of 26 countries will be temporarily banned from entry, citizens of China, Italy, Iran, South Korea, Spain, Germany, France, the United States, Japan, Belgium, Australia, Norway, Denmark, Sweden and Finland will be banned from entry for two months, citizens of Qatar, Bahrain, UAE, Kuwait, Egypt, Iraq, Lebanon, Saudi Arabia, Algeria, Tunisia and Morocco will be banned from entry for one month. Travelers from other countries must be quarantined at home for 14 days after entry. Those with suspected symptoms will be transferred to designated locations for quarantine.From March 23, the Kassab port on the Syrian-Turkish border has been closed. From March 24, all crossing points have been closed for arrivals from Lebanon, Persons from Lebanon, including Syrian citizens, will be banned from entering, except for cargo vehicle driver who after health check.All international flights to and from Syria will be suspended from March 22."
  },
  {
    "continent": "",
    "iso_alpha2": "SZ",
    "name": "Eswatini",
    "score": "Partially restricted",
    "updated": "swatini&amp;item_index=19&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Eswatini<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Persons transiting Eswatini or who intend to cross land border checkpoints several times en route to Mozambique or South Africa may use their initial PCR test results for up to 14 days from the date of testing. All persons departing Eswatini by air must, before boarding aircraft bound for destinations abroad, show proof of a negative PCR test result issued no more than 72 hours prior to departure."
  },
  {
    "continent": "",
    "iso_alpha2": "TD",
    "name": "Chad",
    "score": "Partially restricted",
    "updated": "had&amp;item_index=10&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Chad<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From August 1, 2020, all persons traveling to Chad must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Persons intending to remain in Chad more than 7 days must self-isolate for the initial 7 days following arrival and afterwards undergo an additional PCR test for COVID-19. Persons intending to remain less than 7 days must provide their personal information to local authorities for contact tracing purposes."
  },
  {
    "continent": "",
    "iso_alpha2": "TG",
    "name": "Togo",
    "score": "Partially restricted",
    "updated": "ogo&amp;item_index=50&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Togo<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons arriving at Gnassingbe Eyadema International Airport (LFW) in Lome must carry proof of a negative result for COVID-19 issued no more than 7 days prior to departure using a polymerase chain reaction (PCR) test. Additionally, all persons must submit an Immigration and Health Declaration Form, install the Togo Safe mobile application, undergo an additional PCR test upon arrival, and self-isolate while awaiting their test results. All land border checkpoints are closed until further notice. More information is available at the following URL: https://voyage.gouv.tg<table border=0 cellpadding=0 cellspacing=0 style=width: 505pt; width=673>"
  },
  {
    "continent": "",
    "iso_alpha2": "TH",
    "name": "Thailand",
    "score": "Partially restricted",
    "updated": "hailand&amp;item_index=12&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Thailand<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are generally prohibited from entering Thailand unless they fall into one of the following categories:1) Persons directly permitted by the Prime Minister or a competent official appointed by the Prime Minister to resolve issues pertaining to a state of emergency in Thailand;2) Persons on diplomatic or consular missions or under the auspices of International Organizations or agencies, or government representatives performing official duties in Thailand to whom the Ministry of Foreign Affairs has given special permission, and their family members;3) Non-Thai nationals who are the spouse, parent, or child of a Thai national;4) Non-Thai nationals who hold a valid certificate of permanent residence in Thailand or who have received permission to reside in Thailand, and their family members;5) Non-Thai nationals holding work permits or who have been granted permission from Thai government agencies to work in Thailand, and their family members;6) Non-Thai nationals who are students at an educational institution approved by Thai authorities (with the exception of non-formal institutions under the law on private schools), and their parents or legal guardians;7) Non-Thai nationals seeking to enter Thailand for medical treatments unrelated to COVID-19;8) Non-Thai nationals permitted to enter Thailand under a special arrangement with a third-country or region, or who have received special permission from the Prime Minister. This may include travel for business and tourism. Persons traveling under categories 2 through 8 above must apply for a Certificate of Entry (COE) at a Thai embassy or consulate abroad prior to departing for Thailand. Additionally, all persons must install the ThailandPlus mobile application and register to obtain an associated QR code for use upon arrival. Foreign nationals not eligible for visa-free travel may now submit applications to their local Thai embassy or consulate for a Special Tourist Visa (STV), which allow for stays in Thailand of up to 90 days and may be extended twice. Persons holding an STV must also obtain a COE prior to departure. An STV is NOT a substitute for a COE. All travelers are advised to contact their local Thai embassy or consulate regarding specific requirements for entry into Thailand from their location. Applications for a COE are available online at the following URL: https://coethailand.mfa.go.th/All persons traveling to Thailand (including Thai nationals) must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test and hold medical insurance valid for use in Thailand with a minimum coverage amount of US$100,000. Foreign nationals arriving in Thailand must, at their own expense, undergo a 14-day quarantine at a designated facility and are expected to comply with all relevant pandemic control measures, including undergoing 3 separate tests for COVID-19. Commercial flights are operating on a semi-regular basis and the Thai government is organizing special repatriation flights for Thai nationals at regular intervals."
  },
  {
    "continent": "",
    "iso_alpha2": "TJ",
    "name": "Tajikistan",
    "score": "Entry prohibited",
    "updated": "ajikistan&amp;item_index=42&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Tajikistan<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From April 8, 2020, foreign nationals are prohibited from entering or exiting Tajikistan. This policy does not apply to diplomats and representatives of international organizations or financial institutions accredited in Tajikistan, or their family members.Persons granted entry to Tajikistan must self-isolate for 14 days under supervision of staff from the Ministry of Health and Social Protection."
  },
  {
    "continent": "",
    "iso_alpha2": "TL",
    "name": "Timor-Leste",
    "score": "Entry prohibited",
    "updated": "imor-Leste&amp;item_index=43&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Timor-Leste<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From April 4, 2020, foreign nationals are prohibited from entering Timor-Leste. This policy does not apply to persons born in Timor-Leste, resident citizens, legal representatives of minors who are Timorese nationals, persons working on oil rigs in the Timor Sea, and other persons specially designated by the Prime Minister whose entry is considered in the national interest. Persons engaged in the transport of goods must remain within the international zone at all airports, seaports, or land border checkpoints. All persons granted entry to Timor-Leste will be tested for COVID-19. Those testing positive will be placed in quarantine and isolated. All other persons must undergo a 14-day quarantine. All commercial flights are suspended."
  },
  {
    "continent": "",
    "iso_alpha2": "TM",
    "name": "Turkmenistan",
    "score": "Entry prohibited",
    "updated": "urkmenistan&amp;item_index=45&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Turkmenistan<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From March 20, 2020, all persons (including Turkmen nationals) are prohibited from entering or leaving Turkmenistan. This policy does not apply to diplomats and staff of international organizations, aviation, maritime, or railway crews, international freight drivers, or foreign nationals working in Turkmenistan provided they hold a “health clearance” issued by an authorized medical authority. Such clearance much include the following information in English, Russian, or Turkmen: legal name, gender, age, nationality, passport number, foreign residence address, contact phone number, travel history, date and purpose of entry, local residence address, and test results for COVID-19 issued no more than 24 hours prior to arrival."
  },
  {
    "continent": "",
    "iso_alpha2": "TN",
    "name": "Tunisia",
    "score": "Partially restricted",
    "updated": "unisia&amp;item_index=51&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Tunisia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From November 16, 2020, all persons arriving in Tunisia must have proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Upon arrival, all persons permitted to enter must undergo a 14-day quarantine at their residence or a designated hotel. Persons who elect to undergo an additional PCR test after 7 days in quarantine will be eligible to leave quarantine early provided they test negative. The Tunisian Ministry of Health may select certain arriving passengers to undergo rapid testing for COVID-19. All persons must comply with these and all other directives relating to testing for COVID-19 upon arrival in Tunisia."
  },
  {
    "continent": "",
    "iso_alpha2": "TO",
    "name": "Tonga",
    "score": "Entry prohibited",
    "updated": "onga&amp;item_index=13&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Tonga<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals are prohibited from entering Tonga. This policy does not apply to persons who hold a valid residency permit or a valid working visa, or to persons specifically approved by the Tongan Ministry of Health. Entry into Tonga is restricted to arrivals at Tongatapu. Travelers must register with the Ministry of Health Border Control Team and provide the following documentation: proof of a COVID-19 test, a completed Arrival Health Declaration card, and a medical report issued no more than 72 hours prior to departure. All persons must undergo a 14-day quarantine in Tongatapu and must comply with all directives issued by the Ministry of Health Border Control Team. All international cruise ships and yachts are prohibited from docking at any Tongan port until further notice. Arrival forms are available at the following URL: https://citizensregistration.gov.to/wp/"
  },
  {
    "continent": "",
    "iso_alpha2": "TR",
    "name": "Turkey",
    "score": "Partially restricted",
    "updated": "urkey&amp;item_index=44&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Turkey<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From January 25, 2021, persons traveling from Brazil, Denmark, South Africa, or the United Kingdom are prohibited from entering Turkey. Upon arrival in Turkey, all persons who, within 10 days of their scheduled departure, have visited Brazil, Denmark, South Africa, or the United Kingdom must undergo a 14-day quarantine in a designated location and a polymerase chain reaction (PCR) test for COVID-19. All persons arriving from abroad (including Turkish nationals) must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a PCR test. Persons lacking such proof are prohibited from boarding flights bound for Turkey. All travelers are advised to contact their local Turkish embassy or consulate regarding current travel restrictions prior to finalizing travel plans."
  },
  {
    "continent": "",
    "iso_alpha2": "TT",
    "name": "Trinidad and Tobago",
    "score": "Entry prohibited",
    "updated": "rinidad and Tobago&amp;item_index=25&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Trinidad and Tobago<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From March 23, 2020, all border checkpoints are closed and all persons (including nationals) are prohibited from entering Trinidad and Tobago. This policy does not apply to vessels transporting cargo."
  },
  {
    "continent": "",
    "iso_alpha2": "TW",
    "name": "Taiwan",
    "score": "Partially restricted",
    "updated": "aiwan&amp;item_index=11&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Taiwan<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From March 1, 2021, all non-Taiwanese residents are prohibited from entering Taiwan. This policy does not apply to persons holding an Alien Residential Certificate (ARC), persons traveling for diplomatic or official business, persons traveling to fulfill contractual obligations, persons traveling for special humanitarian reasons, persons who are the spouse or underage child of a Taiwanese resident, persons holding permission to enter in order to receive medical care, persons holding special approval to enter for reasons other than tourism or regular social visits, or persons transiting via Taoyuan International Airport (TPE) on flights operated by the same airline group and who remain within Taiwan for no more than 8 hours.Residents of Hong Kong SAR and Macao SAR may enter Taiwan if they hold an ARC, are traveling for humanitarian or emergency reasons, are the spouse or the underage child of a Taiwanese resident, are traveling to fulfill contractual obligations, are traveling as part of internal transfers within multinational enterprises, are a student holding approval from the Ministry of Education, are a healthcare professional holding approval from the Ministry of Health and Welfare, or obtain permission under special programs. Residents of Mainland China may enter Taiwan if they hold an ARC, are the spouse or underage child of a Taiwanese resident, are a student holding approval from the Ministry of Education, are a healthcare professional holding approval from the Ministry of Health and Welfare, or obtain permission under special programs.Upon arrival, all persons (including Taiwanese residents and transit passengers) must present a certificate showing a negative result for COVID-19 issued no more than 72 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. This policy does not apply persons traveling to Taiwan for necessary and short-term official business or business purposes approved by the Taiwan Central Epidemic Command Center (CECC), persons traveling from locations where self-paid COVID-19 tests are not available, and persons traveling for special humanitarian reasons or emergency situations. In all cases of exemption, travelers must sign an affidavit attesting to their purpose and produce supporting documentation. Such persons may be asked to undergo COVID-19 testing at their own expense in Taiwan. Additionally upon arrival, all persons (including Taiwanese residents) must undergo a 14-day home quarantine. This policy does not apply to persons who, within 14 days of their arrival in Taiwan, have traveled to Brazil, Eswatini, South Africa, or the United Kingdom. Such persons must undergo a 14-day quarantine at a designated facility. Persons seeking to enter Taiwan for short-term business purposes may be eligible to apply for shortened quarantine periods depending on their recent travel history.All persons arriving in Taiwan are required to submit a health declaration via the mobile website of the Quarantine System of Entry prior to boarding flights bound for Taiwan. Confirmation of this declaration is required upon entry. Health declaration forms are available online at the following URL: https://hdhq.mohw.gov.tw/"
  },
  {
    "continent": "",
    "iso_alpha2": "TZ",
    "name": "Tanzania",
    "score": "Partially restricted",
    "updated": "anzania&amp;item_index=49&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Tanzania<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons arriving in Tanzania are subject to enhanced screening for COVID-19. Persons displaying symptoms consistent with COVID-19 are subject to additional testing requirements."
  },
  {
    "continent": "",
    "iso_alpha2": "UA",
    "name": "Ukraine",
    "score": "Partially restricted",
    "updated": "kraine&amp;item_index=44&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Ukraine<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From September 28, 2020, all persons traveling from a country or region classified by the Ukrainian Ministry of Health as green may enter Ukraine provided they carry proof of health insurance valid for use in Ukraine and sufficient to cover any expenses related to observation and treatment for COVID-19. Persons traveling from red locations must install the Dii Vdoma mobile application and do one of the following: 1) undergo quarantine at a designated location, 2) self-isolate for 14 days in a suitable accommodation registered in the Dii Vdoma app, or 3) undergo a polymerase chain reaction (PCR) test for COVID-19 upon arrival in Ukraine. Additional information including a list of persons not subject to quarantine requirements is available at the following URL: https://visitukraine.today/"
  },
  {
    "continent": "",
    "iso_alpha2": "UG",
    "name": "Uganda",
    "score": "Partially restricted",
    "updated": "ganda&amp;item_index=52&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Uganda<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From October 1, 2020, foreign nationals traveling to Uganda for business or tourism must have proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. All tour operators and domestic hosts shall ensure travelers arriving from abroad do not have contact with local Ugandans. Tourists are required to proceed directly from the airport to their destination or to a designated transit hotel. Ugandan nationals returning from abroad with proof of a negative PCR test result must provide their contact information to the Ministry of Health for contact tracing purposes."
  },
  {
    "continent": "",
    "iso_alpha2": "US",
    "name": "United States",
    "score": "Partially restricted",
    "updated": "nited States&amp;item_index=3&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>United States<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Foreign nationals who have visited any of the following countries or regions within 14 days of their arrival in the United States are prohibited from entering: Austria, Belgium, Brazil, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Mainland China, Malta, Monaco, Netherlands, Norway, Poland, Portugal, San Marino, Slovakia, Slovenia, South Africa, Spain, Sweden, Switzerland, Vatican City, and the United Kingdom. From January 26, 2021, all persons traveling to the United States (including US nationals) must present proof of a negative result for COVID-19 issued no more than 3 days to departure using a nucleic acid or antigen test. Alternatively, persons who, at any point within 90 days of their scheduled departure for the United States, tested positive for COVID-19 may present documentation of recovery for travel to the United States. This must include proof of the positive test result along with a certificate from a recognized healthcare provider attesting that the traveler is not currently exhibiting symptoms consistent with COVID-19 is and cleared for travel. All travelers must additionally sign a form attesting that the information provided to airline staff is truthful and accurate to the best of the traveler's knowledge. Persons lacking such proof are prohibited from boarding flights bound for the United States. More information including post-travel recommendations is available via the following URL: https://www.cdc.gov/coronavirus/2019-ncov/travelers/testing-international-air-travelers.htmlThe United States government has mostly suspended the issuing of new visas and all US land border checkpoints with Canada and Mexico are closed to non-essential traffic. Additional restrictions are in place for persons holding special category visas including H-1B, H-2B, J-1, and L-1 visas. All travelers are encouraged to contact their local US embassy or consulate prior to finalizing travel arrangements. When arriving into or traveling within the United States, all persons must wear masks covering their mouth and nose while aboard any conveyance or at any transportation hub. Be advised, various state and local authorities in the United States have implemented additional policies and restrictions for persons arriving into their jurisdictions."
  },
  {
    "continent": "",
    "iso_alpha2": "UY",
    "name": "Uruguay",
    "score": "Entry prohibited",
    "updated": "ruguay&amp;item_index=12&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Uruguay<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From February 1, 2021, foreign nationals are prohibited from entering Uruguay. This policy does not apply to lawful foreign residents. Additional exemptions exist for diplomats accredited to the Uruguayan government or to international organizations based in Uruguay, persons engaged in the transport of goods, merchandise, correspondence, supplies, or humanitarian and health aid. All persons permitted to enter Uruguay must present proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Upon arrival, all persons must self-isolate for 7 days."
  },
  {
    "continent": "",
    "iso_alpha2": "UZ",
    "name": "Uzbekistan",
    "score": "Partially restricted",
    "updated": "zbekistan&amp;item_index=47&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Uzbekistan<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >From December 21, 2020, foreign nationals who, within 14 days of their intended arrival, have visited any of the following locations are prohibited from entering Uzbekistan: Australia, Austria, Denmark, Germany, Italy, Netherlands, South Africa, and the United Kingdom. Persons arriving by air from China, Finland, Hungary, Japan, Latvia, Malaysia, South Korea, or Thailand may enter Uzbekistan without restriction. This policy does not apply to persons currently exhibiting symptoms consistent with COVID-19. Persons arriving by air from Azerbaijan, Belarus, the European Union (with the exception of Austria, Denmark, Germany, Italy, and the Netherlands), or the United Arab Emirates must present a certificate in English or Russian showing a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Persons without such a certificate must undergo testing at the own expense upon arrival. All persons arriving from these locations must undergo temperature screening and a 14-day self-isolation upon arrival. Persons arriving by air from any other location must present a certificate showing a negative PCR test result for COVID-19 and self-isolate for 14 days upon arrival. Persons entering Uzbekistan via land border checkpoints must present a certificate showing a negative PCR test result for COVID-19 and submit a self-isolation questionnaire. Persons without such a certificate must undergo testing at the own expense followed by quarantine. Additional information is available at the following URL: https://uzbekistan.travel/en/o/covid-19-in-uzbekistan/"
  },
  {
    "continent": "",
    "iso_alpha2": "VC",
    "name": "Saint Vincent and the Grenadines",
    "score": "Partially restricted",
    "updated": "aint Vincent and the Grenadines&amp;item_index=23&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Saint Vincent and the Grenadines<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >All persons arriving from locations considered high-risk for COVID-19 transmission must carry proof of a negative result for COVID-19 issued no more than 5 days prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. All travelers are required to complete an online Pre-Arrival Travel Form prior to arrival in St. Vincent and the Grenadines. Upon arrival, all persons must undergo an additional RT-PCR test and a 5-day quarantine in a designated location at their own expense. Additional information, including a list of approved quarantine accommodations, is available at the following URL: http://health.gov.vc/health/index.php/covid-19-protocols-documents . Pre-Arrival Travel Forms are available at the following URL: https://stv.servicedx.com/formmgmt/travelform"
  },
  {
    "continent": "",
    "iso_alpha2": "VE",
    "name": "Venezuela",
    "score": "Entry prohibited",
    "updated": "enezuela&amp;item_index=13&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Venezuela<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From March 12, all the country will be in quarantine. All International Flights have been suspended. All travelers have to self-quarantine for 14 days after entry. From July 15, 2020, the Venezuelan government announced the implementation of strict level 1 radical quarantine measures across the country, requiring all citizens to be isolated at home."
  },
  {
    "continent": "",
    "iso_alpha2": "VN",
    "name": "Vietnam",
    "score": "Entry prohibited",
    "updated": "ietnam&amp;item_index=13&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Vietnam<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content ><span style=font-family: Arial; font-size: 15px; white-space: pre-wrap; display: inline !important;>From February 2, 2021, foreign nationals are prohibited from entering Vietnam. This policy does not apply to foreign experts, investors, and persons traveling for official or diplomatic purposes, or to the family members of such persons. Foreign nationals permitted to enter Vietnam must submit an online health declaration and, upon arrival, undergo a medical check and a 21-day quarantine. Travelers should carry international health insurance with coverage valid in Vietnam; otherwise, the local organization sponsoring the traveler is required to cover all costs associated with the treatment for COVID-19 should it become necessary. The sponsoring organization is likewise responsible for all expenses relating to quarantine, transportation, and COVID-19 testing for foreign nationals entering Vietnam at their invitation. Health declaration forms are available at the following URL: https://tokhaiyte.vn/"
  },
  {
    "continent": "",
    "iso_alpha2": "VU",
    "name": "Vanuatu",
    "score": "Entry prohibited",
    "updated": "anuatu&amp;item_index=14&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Vanuatu<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >All border checkpoints are closed to foreign nationals and all international flights are suspeded until further notice."
  },
  {
    "continent": "",
    "iso_alpha2": "WS",
    "name": "Samoa",
    "score": "Entry prohibited",
    "updated": "amoa&amp;item_index=11&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Samoa<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >All border checkpoints are closed. Persons seeking to travel to Samoa should contact Samoan health authorities at least 21 days prior to their intended departure in order to obtain permission to travel to Samoa. Applications will be considered on a case-by-case basis. Prior to departure, all persons must have the following documentation: 1) a negative result for COVID-19 issued no more than 72 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test, 2) results from a serological test for COVID-19 antibodies issued no more than 5 days prior to departure (this requirement does not apply to persons whose journeys originate in America Samoa or New Zealand), and 3) a completed medical clearance form signed no more than 72 hours prior to initial departure. Upon arrival, travelers may have to undergo at least a 21-day quarantine in a designated facility. More information, including instructions for contacting health authorities, is available at the following URL: https://www.health.gov.ws/"
  },
  {
    "continent": "",
    "iso_alpha2": "YE",
    "name": "Yemen",
    "score": "Entry prohibited",
    "updated": "emen&amp;item_index=48&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Yemen<span class=countryStatusRed>Entry prohibited<div class=sc-3okj19-0 jJdyoA><div class=content >From March 17, all air flights from and to all Yemeni airports, all land entrances should be closed except for commercial, relief and humanitarian shipping."
  },
  {
    "continent": "",
    "iso_alpha2": "ZA",
    "name": "South Africa",
    "score": "Partially restricted",
    "updated": "outh Africa&amp;item_index=46&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>South Africa<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Travelers arriving by air are restricted to the following airports: Cape Town International Airport (CPT), King Shaka International Airport (DUR), and O.R. Tambo International Airport (JNB). All persons must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Upon arrival, all persons must, at their own expense, undergo an additional antigen test for COVID-19. Persons who test positive must undergo quarantine at their own expense. Land border checkpoints are partially restricted. More information is available at the following URL: https://sacoronavirus.co.za/"
  },
  {
    "continent": "",
    "iso_alpha2": "ZM",
    "name": "Zambia",
    "score": "Partially restricted",
    "updated": "ambia&amp;item_index=53&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Zambia<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Persons arriving in Zambia must carry proof of a negative result for COVID-19 issued no more than 7 days prior to departure using a polymerase chain reaction (PCR) test. Additionally, travelers must complete a medical questionnaire and undergo screening for COVID-19. Persons exhibiting symptoms consistent with COVID-19 must undergo testing and quarantine at a designated location. All persons seeking to travel to Zambia may submit a visa application online at the following URL: https://eservices.zambiaimmigration.gov.zm/#/home"
  },
  {
    "continent": "",
    "iso_alpha2": "ZW",
    "name": "Zimbabwe",
    "score": "Partially restricted",
    "updated": "imbabwe&amp;item_index=54&amp;pageid=10650038313 data-ubt-vars-traceid=130323><div class=country_title><span class=countryName>Zimbabwe<span class=countryStatusYellow>Partially restricted<div class=sc-3okj19-0 jJdyoA><div class=content >Travelers must carry proof of a negative result for COVID-19 issued no more than 48 hours prior to departure using a polymerase chain reaction (PCR) test. Persons who lack such proof or who are exhibiting symptoms consistent with COVID-19 must undergo testing and a 14-day quarantine in a dedicated facility. Upon arrival, all persons must self-isolate for 14-days at their residence or a suitable location. Persons seeking to depart Zimbabwe must show proof of a negative PCR test result issued no more than 72 hours prior to their scheduled departure.]"
  }
]
