[
  {
    "code":"AD",
    "iso_alpha2": "AD",
    "continent": "EU",
    "name": "Andorra",
    "score": "2.8 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 12.05.2020 please see  () regulations for france or spain, whichever is transited to enter andorra.  "
  },
  {
    "code":"AE",
    "iso_alpha2": "AE",
    "continent": "AS",
    "name": "United Arab Emirates",
    "score": "3.1 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 24.07.2020 1. passengers are not allowed to enter. - this does not apply to nationals of united arab emirates.  - this does not apply to residents of united arab emirates. - this does not apply to passengers traveling as tourists to dubai (dxb). - this does not apply to nationals of bahrain, kuwait, oman and saudi arabia with a united arab emirates identity card arriving at dubai (dxb). 2. all evacuation flights must have pax app data and crew app data; all ferry flights must have crew app data. 3. residents of united arab emirates: - must have a resident entry permit obtained before departure at <a href=https://smartservices.ica.gov.ae/echannels/web/client/default.html>https://smartservices.ica.gov.ae/echannels/web/client/default.html</a> ; and - are subject to medical screening and quarantine; and 4. a completed self-declaration health form must be presented upon arrival at dubai (dxb). 5. passengers traveling as tourists arriving at dubai (dxb) must have: - health insurance, and - a medical certificate with a negative  () pcr test result issued at most 96 hours before arrival. if they don't have the certificate, they are subject to a pcr test on arrival. if the test result is positive, they are subject to quarantine for 14 days. 6. passengers arriving at dubai (dxb) must download and register the  dxb smart app. 7. passengers arriving at abu dhabi (auh) must have: - an ica approval obtained at <a href=https://smartservices.ica.gov.ae/echannels/web/client/default.html#/login>https://smartservices.ica.gov.ae/echannels/web/client/default.html#/login</a> , and - a medical certificate with a negative  () pcr test result issued at most 72 hours before departure. the certificate must be issued by an approved lab listed on <a href=https://screening.purehealth.ae/>https://screening.purehealth.ae</a> . 8. passengers and airline crew arriving at abu dhabi (auh) are subject to medical screening and quarantine.  "
  },
  {
    "code":"AF",
    "iso_alpha2": "AF",
    "continent": "AS",
    "name": "Afghanistan",
    "score": "5 (Extreme Warning)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 25.06.2020 Flights to Afghanistan restarted.  "
  },
  {
    "code":"AG",
    "iso_alpha2": "AG",
    "continent": "NA",
    "name": "Antigua and Barbuda",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 10.07.2020 1. passengers arriving in antigua and barbuda:  - are subject to medical screening; and - must present a completed health declaration form. 2. passengers and airline crew staying overnight in transit are subject to self-isolation. 3. passengers must have a medical certificate with a negative  () test result issued at most 7 days before departure.  "
  },
  {
    "code":"AI",
    "iso_alpha2": "AI",
    "continent": "NA",
    "name": "Anguilla",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 01.07.2020 Airports in Anguilla are closed.   "
  },
  {
    "code":"AL",
    "iso_alpha2": "AL",
    "continent": "EU",
    "name": "Albania",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 02.07.2020   () entry regulations lifted on 1 july 2020.   "
  },
  {
    "code":"AM",
    "iso_alpha2": "AM",
    "continent": "AS",
    "name": "Armenia",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 17.04.2020  1. Passengers are not allowed to enter Armenia. - This does not apply to: - nationals and residents of Armenia; - immediate family members of nationals of Armenia; - diplomats and their immediate family members. 2. Passengers who are allowed to enter Armenia are subject to a 14 day quarantine.  "
  },
  {
    "code":"AO",
    "iso_alpha2": "AO",
    "continent": "AF",
    "name": "Angola",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 25.06.2020  1. Flights to Angola are suspended. - This does not apply to humanitarian flights. 2. Passengers and airline crew are subject to quarantine for 14 days.  "
  },
  {
    "code":"AR",
    "iso_alpha2": "AR",
    "continent": "SA",
    "name": "Argentina",
    "score": "3.1 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 21.07.2020 1. Passengers are not allowed to enter. - This does not apply to nationals and residents of Argentina. 2. Flights to Argentina are suspended until 2 August 2020. - This does not apply to repatriation and medical flights. 3. Nationals and residents of Argentina are subject to quarantine for 14 days.  "
  },
  {
    "code":"AS",
    "iso_alpha2": "AS",
    "continent": "OC",
    "name": "American Samoa",
    "score": "4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 18.03.2020 1.nationals of the usa and residents of samoa (american) who transited or have been in arizona, california, florida, georgia, hawaii, illinois, massachusetts, new hampshire, new york, north carolina, oregon, rhode island, texas, washington or wisconsin, are subject to public health screening and might be medically or home quarantined.  2.entry permits, issued by samoa (american) instead of visas, are suspended.  - this does not apply to residents of samoa (american) with residence permit or an immigration board approval. 3.passengers arriving from samoa must: - obtain a health clearance from ministry of health (moh) 3 days prior to arrival;  - present a completed “dot travel declaration form upon arrival. 4.passengers who transited or have been in countries affected by  (), when arriving from hawaii, must:  -spend 14 days in hawaii; and -obtain a health clearance 3 days before arrival in samoa (american); and -present a completed “dot travel declaration form upon arrival; and -provide itinerary upon arrival.  "
  },
  {
    "code":"AT",
    "iso_alpha2": "AT",
    "continent": "EU",
    "name": "Austria",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 27.07.2020 1. Passengers are not allowed to enter. - This does not apply to: - nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland and their family members; - British nationals and their family member; - passengers arriving from Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland, United Kingdom or Vatican City (Holy See); - passengers with a D visa issued by Austria; - passengers departing immediately; - passengers traveling on business; - passengers visiting their life partner. 2. Passengers are subject to self-quarantine for 10 days. A list of quarantine exemptions can be found at <a href=http://www.bmk.gv.at/en/service/entry-requirements.html>www.bmk.gv.at/en/service/entry-requirements.html</a>  3. Passengers traveling on business must have a medical certificate issued at most 72 hours before arrival which confirms a negative SARS-CoV-2-test result. More details can be found at: <a href=http://www.bmk.gv.at/en/service/entry-requirements.html>www.bmk.gv.at/en/service/entry-requirements.html</a>  4. Flights from Albania, Belarus, Bosnia and Herzegovina, Bulgaria, China (People's Rep.), Egypt, Iran, Kosovo (Rep.), Montenegro, North Macedonia (Rep.), Portugal, Romania, Russian Fed., Serbia, Sweden, Ukraine and the United Kingdom are suspended.  "
  },
  {
    "code":"AU",
    "iso_alpha2": "AU",
    "continent": "OC",
    "name": "Australia",
    "score": "2.7 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 17.07.2020 1. passengers are not allowed to enter australia.  - this does not apply to nationals of australia. - this does not apply to the immediate family members of nationals of australia.  - this does not apply to permanent residents of australia and their immediate family members.  - this does not apply to nationals of new zealand residing in australia. 2. passengers are required to quarantine for 14 days at the first point of entry. 3. airline crew are subject to self-isolation until their next flight. 4. passengers transiting through australia for 8 to 72 hours, are subject to quarantine until their departing flight. 5. flights to melbourne (mel) are suspended. 6. passengers who are allowed to enter australia must request an exemption before departure at <a href=https://immi.homeaffairs.gov.au/help-support/departmental-forms/online-forms/19-enquiry-form>https://immi.homeaffairs.gov.au/help-support/departmental-forms/online-forms/19-enquiry-form</a>.  "
  },
  {
    "code":"AW",
    "iso_alpha2": "AW",
    "continent": "NA",
    "name": "Aruba",
    "score": "2.5 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 14.07.2020 1. passengers arriving from argentina, belize, bolivia, brazil, chile, colombia, costa rica, dominican rep., ecuador, el salvador, french guiana, guatemala, guyana, haiti, honduras, mexico, nicaragua, panama, paraguay, peru, suriname, uruguay or venezuela are not allowed to enter. 2. a completed health assessment form must be submitted on <a href=http://www.edcardaruba.aw/>www.edcardaruba.aw</a> at most 72 hours before departure. a travel authorization must be presented at time of check-in. 3. passengers must have a medical certificate with a negative  () pcr test result issued at most 72 hours before departure. the test must be uploaded at <a href=http://www.edcardaruba.aw/>www.edcardaruba.aw</a> at most 12 hours before departure. passengers without a medical certificate with a negative  () pcr test result must take the test on arrival at their own expense and are subject to quarantine for 1 day. - this does not apply to: - passengers younger than 15 years; - passengers departing on the same calendar day;  - residents of aruba, bonaire and curacao if traveling from bonaire or curacao; - passengers arriving from the us states of alabama, arizona, arkansas, california, colorado, florida, georgia, idaho, iowa, kansas, louisiana, mississippi, nevada, north carolina, ohio, oklahoma, oregon, south carolina, south dakota, tennessee, texas, utah, wisconsin and wyoming. 4. passengers arriving from the us states of alabama, arizona, arkansas, california, colorado, florida, georgia, idaho, iowa, kansas, louisiana, mississippi, nevada, north carolina, ohio, oklahoma, oregon, south carolina, south dakota, tennessee, texas, utah, wisconsin and wyoming must have a medical certificate with a negative  () pcr test result issued at most 72 hours before departure. the test must be uploaded at <a href=http://www.edcardaruba.aw/>www.edcardaruba.aw</a> at most 12 hours before departure. they are not allowed to take the test on arrival. - this does not apply to passengers younger than 15 years.  5. passengers must have a health insurance purchased before departure and available at <a href=http://www.edcardaruba.aw/>www.edcardaruba.aw</a>. this does not apply to: - residents of aruba, bonaire and curacao; - passengers departing on the same calendar day;  - passengers with a diplomatic passport; - dutch military personnel, their spouse and children.  6. passengers are subject to medical screening.  "
  },
  {
    "code":"AZ",
    "iso_alpha2": "AZ",
    "continent": "AS",
    "name": "Azerbaijan",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 09.07.2020  1. passengers are not allowed to enter until 1 august 2020. - this does not apply to nationals and residents of azerbaijan. 2. passengers must have a medical certificate with a negative  () test result issued at most 48 hours before departure. 3. nationals of azerbaijan arriving without a medical certificate with a negative  () test result are subject to quarantine for 14 days. 4. a completed self-isolation form must be presented upon arrival.  5. suspension of e-visa issuance and visa on arrival facilities.  "
  },
  {
    "code":"BA",
    "iso_alpha2": "BA",
    "continent": "EU",
    "name": "Bosnia and Herzegovina",
    "score": "3.7 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 17.07.2020  1. passengers are not allowed to enter bosnia and herzegovina.  - this does not apply to: - nationals and residents of bosnia and herzegovina; - nationals of croatia, montenegro and serbia; - spouses and children of nationals of bosnia and herzegovina; - nationals of austria, belgium, bulgaria, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden and switzerland; - passengers with a residence permit issued by austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden and switzerland; - passengers with a multiple-entry schengen visa issued by austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden and switzerland; - passengers returning via bosnia and herzegovina to their country of residence. they must have a permit issued by the competent authority of bosnia and herzegovina; - passengers traveling on business with an invitation issued by a company based in bosnia and herzegovina. they must have a certificate with a negative  () test result issued at most 48 hours before arrival;  - nato military. 2. nationals of austria, belgium, bulgaria, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden and switzerland must have a medical certificate with a negative  () test result issued at most 48 hours before departure. 3. passengers with a residence permit issued by austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden and switzerland must have a medical certificate with a negative  () test result issued at most 48 hours before departure. 4. passengers with a multiple-entry schengen visa issued by austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden and switzerland must have a medical certificate with a negative  () test result issued at most 48 hours before departure.  "
  },
  {
    "code":"BB",
    "iso_alpha2": "BB",
    "continent": "NA",
    "name": "Barbados",
    "score": "2.8 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 13.07.2020 1. bridgetown (bgi) airport reopens. 2. passengers must complete an embarkation/disembarkation (ed) form 24 hours before arrival. the form can be obtained before departure at <a href=http://www.travelform.gov.bb/>www.travelform.gov.bb</a> . 3. passengers who have not obtained a medical certificate with a negative  () pcr test result at most 72 hours before departure are subject to medical screening and quarantine. 4. passengers are subject to medical screening and quarantine.  "
  },
  {
    "code":"BD",
    "iso_alpha2": "BD",
    "continent": "AS",
    "name": "Bangladesh",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 06.07.2020 1. suspension of visa on arrival facilities. -this does not apply to passengers traveling on business with a return/onward ticket. they must: - have a confirmation letter issued by the bangladesh board of investment (boi). the letter must contain a boi registration number. the accredited inviting organization must notify the immigration authorities prior to arrival, and - have a medical certificate with a negative  () test result issued at most 72 hours before arrival. 2. flights from bahrain, bhutan, hong kong (sar china), india, kuwait, maldives, nepal, oman, saudi arabia, singapore and thailand to bangladesh are suspended. 3. passengers with a visa must have a medical certificate with a negative  () test result issued at most 72 hours before departure. - this does not apply to passengers with a diplomatic or an official passport and their family members. - this does not apply to passengers with a laissez-passer and their family members. 4. a completed health declaration form must be presented upon arrival. 5. passengers are subject to medical screening and quarantine.  "
  },
  {
    "code":"BE",
    "iso_alpha2": "BE",
    "continent": "EU",
    "name": "Belgium",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 14.07.2020 1. Passengers are not allowed to enter. This does not apply to: - passengers arriving from EEA Member States or Switzerland; - nationals of Andorra, Monaco, Montenegro, North Macedonia (Rep.), San Marino, Serbia, Switzerland, Vatican City (Holy See) and EEA Member States;  - passengers with a British passport with nationality “British Citizen, “British Overseas Territories Citizen issued by Gibraltar and British Passports with a Certificate of Entitlement to the Right of Abode issued by the United Kingdom;  - passengers with a long-term residence permit or a long term D visa issued by EEA Member States, Switzerland or the United Kingdom, returning via Belgium to their country of residence; - family members of nationals of EEA Member States and Switzerland;  - family members of British nationals; - military personnel. 2. A completed Health Declaration Form must be presented upon arrival. The form can be found at <a href=https://dofi.ibz.be/sites/dvzoe/FR/Documents/BELGIUM_PassengerLocatorForm.PDF>https://dofi.ibz.be/sites/dvzoe/FR/Documents/BELGIUM_PassengerLocatorForm.PDF</a> . 3. Passengers are subject to medical screening and quarantine.  "
  },
  {
    "code":"BF",
    "iso_alpha2": "BF",
    "continent": "AF",
    "name": "Burkina Faso",
    "score": "3.9 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 23.06.2020 1. Passengers are not allowed to enter. - This does not apply to nationals and residents of Burkina Faso. - This does not apply to humanitarian, medevac and repatriation flights. 2. Passengers are subject to quarantine for 14 days.  "
  },
  {
    "code":"BG",
    "iso_alpha2": "BG",
    "continent": "EU",
    "name": "Bulgaria",
    "score": "3.6 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 23.07.2020 1. passengers are not allowed to enter. -this does not apply to: - nationals of algeria, andorra, australia, austria, belgium, bulgaria, canada, croatia, cyprus, czechia, denmark, estonia, finland, france, georgia, germany, greece, hungary, iceland, ireland (rep.), italy, japan, korea (rep.), latvia, liechtenstein, lithuania, luxembourg, malta, monaco, morocco, netherlands, new zealand, norway, poland, portugal, romania, rwanda, san marino, slovakia, slovenia, spain, sweden, switzerland, thailand, tunisia, ukraine, uruguay and vatican city (holy see); - passengers with a british passport; - family members of nationals of bulgaria; - passengers with a residence permit issued by austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland or united kingdom, and their family members; - nationals of albania, bosnia and herzegovina, kosovo (rep.), montenegro, north macedonia (rep.), serbia and turkey returning via bulgaria to their country of residence; - passengers with an alien's passport issued by estonia and latvia; - military personnel. 2. all passports and national id cards issued to nationals of bulgaria and which have expired on 13 march 2020 or later, are considered valid with a prolongation of 6 months. this is due to the  () pandemic. 3. passengers must have a medical certificate with a negative  () pcr test result issued at most 72 hours before departure. - this does not apply to passengers arriving from algeria, andorra, australia, austria, belgium, canada, croatia, cyprus, czechia, denmark, estonia, finland, france, georgia, germany, greece, hungary, iceland, ireland (rep.), italy, japan, korea (rep.), latvia, liechtenstein, lithuania, luxembourg, malta, monaco, morocco, netherlands, new zealand, norway, poland, romania, rwanda, san marino, slovakia, slovenia, spain, switzerland, thailand, tunisia, ukraine, united kingdom, uruguay, vatican city (holy see). 4. passengers are subject to quarantine for 14 days if they do not have a have a medical certificate with a negative  () pcr test result issued at most 72 hours before departure.  "
  },
  {
    "code":"BH",
    "iso_alpha2": "BH",
    "continent": "AS",
    "name": "Bahrain",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 22.07.2020  1. Suspension of visa on arrival facilities. - This does not apply to passengers with a diplomatic, official, service or United Nations passport. 2. Passengers are not allowed to enter. - This does not apply to: - nationals and residents of Bahrain; - nationals of Kuwait, Oman, Saudi Arabia and United Arab Emirates; - passengers with an e-visa obtained before departure; - military personnel. 3. Passengers are subject to medical screening upon arrival and to quarantine for 10 days. 5. Border crossing on the causeway is suspended.  "
  },
  {
    "code":"BI",
    "iso_alpha2": "BI",
    "continent": "AF",
    "name": "Burundi",
    "score": "4.8 (Extreme Warning)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 27.07.2020 Flights to Burundi are suspended. - This does not apply to humanitarian and medevac flights.   "
  },
  {
    "code":"BJ",
    "iso_alpha2": "BL",
    "continent": "NA",
    "name": "Saint Barthélemy",
    "score": "4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 24.06.2020  Passengers are subject to medical screening at their own expense.  "
  },
  {
    "code":"BM",
    "iso_alpha2": "BM",
    "continent": "NA",
    "name": "Bermuda",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 23.07.2020 1. passengers must complete an online travel authorization and present the confirmation before departure. 2. passengers aged 10 years and older not residing in bermuda: - must have a medical certificate with a negative  () pcr test result issued at most 7 days before departure; and - are subject to a pcr test on arrival and quarantine until test results are ready. 3. residents of bermuda are subject to medical screening and quarantine. for more details, please refer to the website <a href=https://www.gov.bm/-travellers>https://www.gov.bm/-travellers</a> .  "
  },
  {
    "code":"BN",
    "iso_alpha2": "BN",
    "continent": "AS",
    "name": "Brunei",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 20.04.2020  1. passengers are not allowed to transit or enter brunei darussalam. - this does not apply to nationals and residents of brunei darussalam. 2. all visa exemptions and visa on arrival are temporarily suspended. 3. all visa issued to passengers are temporarily suspended. 4. special consideration is only given by the brunei immigration department which is subject to the affairs of interest to brunei darussalam by applying to the brunei immigration department by downloading the form provided on the department’s website at <a href=http://www.immigration.gov.bn/>www.immigration.gov.bn</a> . passengers with a special consideration are subject to  () testing that has a cost of bnd1000.  "
  },
  {
    "code":"BO",
    "iso_alpha2": "BO",
    "continent": "SA",
    "name": "Bolivia",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 17.07.2020 1. passengers and airline crew are not allowed to enter bolivia until 31 july 2020. - this does not apply to nationals and residents of bolivia.  - this does not apply to airline crew of airlines of bolivia or humanitarian flights. 2. nationals and residents of bolivia are subject to quarantine. 3. airline crew who are allowed to enter must have a medical certificate with a negative  () test result.  "
  },
  {
    "code":"BQ",
    "iso_alpha2": "BO",
    "continent": "SA",
    "name": "Bolivia",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 23.07.2020 1. Passengers are not allowed to enter until 1 August 2020. - This does not apply to residents of Bonaire, St. Eustatius and Saba. - This does not apply to passengers arriving from Aruba, Belgium, Curacao, France, Germany, Luxembourg, Netherlands or St. Maarten. - This does not apply passengers traveling as students.  2. Flights to Bonaire, St. Eustatius and Saba are suspended.  - This does not apply to flights arriving from Aruba, Belgium, Curacao, France, Germany, Luxembourg, Netherlands or St. Maarten. - This does not apply to repatriation and medical flights. 3. Passengers are subject to quarantine. - This does not apply to passengers arriving from Aruba, Belgium, Curacao, France, Germany, Luxembourg, Netherlands or St. Maarten. 4. A completed Health Declaration Form must be presented to immigration upon arrival. The form can be obtained at <a href=https://bonairepublichealth.org/en/form>https://bonairepublichealth.org/en/form</a>.   "
  },
  {
    "code":"BR",
    "iso_alpha2": "BR",
    "continent": "SA",
    "name": "Brazil",
    "score": "3.6 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 27.07.2020 1. passengers are not allowed to enter. this does not apply to: - nationals and residents of brazil; - passengers traveling on business; - merchant seamen; - immediate family member or a curator of a national of brazil. spouses of a national of brazil must have a brazilian marriage certificate. if the certificate is not issued by brazil, it must be apostilled by a consulate. a non-official translation in portuguese is also required. 2. passengers must have a medical certificate with a negative  () test result. this does not apply to: - nationals and residents of brazil; - merchant seamen; - passengers with a diplomatic or official passport; - passengers with a diplomatic or official visa. 3. passengers can only land at brasilia (bsb), rio de janeiro (gig), sao paulo guarulhos (gru) or sao paulo viracopos (vcp).  "
  },
  {
    "code":"BS",
    "iso_alpha2": "BS",
    "continent": "NA",
    "name": "Bahamas",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 27.07.2020 1. passengers must complete a bahamas health visa application at <a href=http://www.travel.gov.bs/>www.travel.gov.bs</a> before departure. they must upload their negative  () rt-pcr test result or select relevant exemption category, and provide their contact information. passengers must present the approved bahamas health visa application at check-in and upon arrival. 2. passengers must have a negative  () rt-pcr test result from a sample dated 10 days or less before arrival. - this does not apply to passengers who are 10 years and younger. 3. passengers are subject to medical screening on arrival and quarantine with monitoring for 14 days. 4. airline crew staying overnight must complete a bahamas health visa application at travel.gov.bs before departure. they must present the approved bahamas health visa application and employment identification upon arrival.  "
  },
  {
    "code":"BT",
    "iso_alpha2": "BT",
    "continent": "AS",
    "name": "Bhutan",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 20.04.2020 1. visa on arrival is suspended. 2. passengers with a visa, work permit or other immigration permits issued by bhutan and airline crew are not allowed to enter bhutan if they arrive from or have visited or transited through a  () affected country. 3. airline crew are subject to thermal screening on arrival.  "
  },
  {
    "code":"BW",
    "iso_alpha2": "BW",
    "continent": "AF",
    "name": "Botswana",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 04.06.2020 Airports in Botswana are closed.  "
  },
  {
    "code":"BY",
    "iso_alpha2": "BY",
    "continent": "EU",
    "name": "Belarus",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 09.07.2020 1. A completed awareness questionnaire must be presented upon arrival. - This does not apply to passengers in transit. 2. Passengers are subject to quarantine for 14 days. - This does not apply to passengers arriving from Albania, Algeria, Andorra, Australia, Austria, Belgium, Bosnia and Herzegovina, Bulgaria, Canada, China (People's Rep.), Croatia, Cuba, Cyprus, Czechia, Denmark, Egypt, Estonia, Finland, France, Georgia, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Israel, Italy, Japan, Kazakhstan, Korea (Rep.), Latvia, Lebanon, Liechtenstein, Lithuania, Luxembourg, Malaysia, Malta, Mauritius, Moldova (Rep.), Monaco, Montenegro, Netherlands, New Zealand, North Macedonia (Rep.), Norway, Poland, Portugal, Romania, San Marino, Serbia, Singapore, Slovakia, Slovenia, Spain, Sweden, Switzerland, Thailand, Tunisia, Turkey, USA, United Arab Emirates, United Kingdom or Viet Nam.  "
  },
  {
    "code":"BZ",
    "iso_alpha2": "BZ",
    "continent": "NA",
    "name": "Belize",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 28.07.2020  Airports in Belize are closed until 14 August 2020. - This does not apply to nationals and residents of Belize. Effective 15 August 2020: 1. Airports in Belize reopen. 2. Passengers must download the 'Belize Health App' at most 72 hours before arrival. They must complete the required information before boarding. 3. Passengers are subject to medical screening and quarantine for 14 days.  "
  },
  {
    "code":"CA",
    "iso_alpha2": "CC",
    "continent": "SA",
    "name": "Cocos Islands",
    "score": "0 (Information not available)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 13.07.2020 1. Passengers are not allowed to enter Canada. -This does not apply to:  - nationals of Canada; - permanent residents of Canada; - passengers arriving from the USA traveling for a purpose other than tourism; - immediate family members of a national of a permanent resident of Canada. They must be traveling for a purpose other than tourism; - passengers who do not need to obtain a temporary resident visa, and their immediate family members. They must be traveling for a purpose other than tourism; - nationals of France who reside in Saint-Pierre-et-Miquelon and have been only in Saint-Pierre-et-Miquelon, the USA or Canada in the past 14 days. They must be traveling for a purpose other than tourism; - Indians under the Indian Act; - students; - merchant seamen. 2. Passengers must arrive at Calgary (YYC), Montreal (YUL), Toronto (YYZ) or Vancouver (YVR). 3. Passengers are subject to quarantine for 14 days. 4. Passports issued to nationals of North Macedonia (Rep.) which have expired on 18 March 2020 or later, are considered valid until 31 July 2020.  "
  },
  {
    "code":"CD",
    "iso_alpha2": "CD",
    "continent": "AF",
    "name": "Democratic Republic of the Congo",
    "score": "3.9 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 22.04.2020 1. Flights to Congo (Dem. Rep.) are suspended. - This does not apply to pre-approved repatriation flights. 2. Passengers and airline crew must go through medical screening upon arrival and present a completed Health Sanitary Card provided by Health Authorities.  "
  },
  {
    "code":"CF",
    "iso_alpha2": "CF",
    "continent": "AF",
    "name": "Central African Republic",
    "score": "5 (Extreme Warning)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 16.07.2020 1. bangui (bgf) is closed until 13 september 2020.  - this does not apply to emergency, humanitarian, medevac and repatriation flights. 2. airline crew are subject to quarantine until their next flight. 3. passengers arriving from a country with local transmission of  () are subject to quarantine for 21 days. effective 14 september 2020: 1. bangui (bgf) airport reopens. 2. passengers and airline crew are subject to medical screening and quarantine.  "
  },
  {
    "code":"CG",
    "iso_alpha2": "CG",
    "continent": "AF",
    "name": "Republic of the Congo",
    "score": "2.8 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 26.03.2020 Airports in Congo are closed.  "
  },
  {
    "code":"CH",
    "iso_alpha2": "CH",
    "continent": "EU",
    "name": "Switzerland",
    "score": "4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 23.07.2020 1. Passengers are not allowed to enter. -This does not apply to: - nationals of EEA Member States and Switzerland; - British nationals; - passengers arriving from Schengen Member States; - passengers arriving directly from Algeria, Andorra, Australia, Bulgaria, Canada, Croatia, Cyprus, Georgia, Ireland (Rep.), Japan, Korea (Rep.), Monaco, Morocco, New Zealand, Romania, Rwanda, San Marino, Thailand, Tunisia, Uruguay and Vatican City (Holy See); - family members of nationals of EEA Member States. They must present proof of their relationship; - family members of British nationals. They must present proof of their relationship; - residents of Liechtenstein and Switzerland; - residents of Schengen Member States returning directly via Switzerland to their country of residence; - passengers with a D visa issued by Switzerland; - passengers with a Schengen C visa issued by Switzerland after 16 March 2020. 2. Passengers are not allowed to transit if arriving from a non-Schengen Member State to another Schengen Member State. -This does not apply to: - nationals of EEA Member States and Switzerland; - British nationals; - passengers arriving directly from Algeria, Andorra, Australia, Bulgaria, Canada, Croatia, Cyprus, Georgia, Ireland (Rep.), Japan, Korea (Rep.), Monaco, Morocco, New Zealand, Romania, Rwanda, San Marino, Thailand, Tunisia, Uruguay and Vatican City (Holy See); - family members of nationals of EEA Member States and Switzerland; - family members of British nationals; - residents of EEA Member States and Switzerland; - passengers with a D visa issued by Switzerland; - passengers with a Schengen C visa issued by Switzerland after 16 March 2020. 3. Passengers who have been in the following countries in the past 14 days are subject to quarantine for 10 days: Argentina, Armenia, Azerbaijan, Bahrain, Bolivia, Bosnia and Herzegovina, Brazil, Cape Verde, Chile, Colombia, Costa Rica, Dominican Rep., Ecuador, El Salvador, Eswatini, Guatemala, Honduras, Iraq, Israel, Kazakhstan, Kyrgyzstan, Kosovo (Rep.), Kuwait, Luxembourg, Maldives, Mexico, Moldova (Rep.), Montenegro, North Macedonia (Rep.), Oman, Palestinian Territory, Panama, Peru, Qatar, Russian Fed., Saudi Arabia, Serbia, South Africa, Suriname, Turks and Caicos Isl. United Arab Emirates and USA.  "
  },
  {
    "code":"CI",
    "iso_alpha2": "CI",
    "continent": "AF",
    "name": "Ivory Coast",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 13.07.2020 1. Flights to Cote d'Ivoire restarted 2. A completed Health Declaration Form must be submitted before departure at <a target=_blank href=https://deplacement-aerien.gouv.ci>https://deplacement-aerien.gouv.ci</a> .   "
  },
  {
    "code":"CK",
    "iso_alpha2": "CK",
    "continent": "OC",
    "name": "Cook Islands",
    "score": "4.5 (Extreme Warning)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 18.06.2020  Passengers are not allowed to enter. - This does not apply to Cook Islanders, passengers with a residence permit or an entry permit issued by the Cook Isl. They must have stayed in New Zealand for 30 consecutive days before they enter the Cook. Isl.  "
  },
  {
    "code":"CL",
    "iso_alpha2": "CL",
    "continent": "SA",
    "name": "Chile",
    "score": "3.6 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 16.07.2020  1. passengers are not allowed to enter until 31 july 2020. - this does not apply to nationals and residents of chile. 2. nationals and residents of chile are subject to quarantine for 14 days. 3. a completed affidavit for travellers to prevent  diseases () must be submitted before departure at <a href=https://www.c19.cl/formularios.html>https://www.c19.cl/formularios.html</a> .  "
  },
  {
    "code":"CM",
    "iso_alpha2": "CM",
    "continent": "AF",
    "name": "Cameroon",
    "score": "3.1 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 22.07.2020 1. flights to cameroon are suspended. - this does not apply to humanitarian, medevac and repatriation flights. 2. passengers are not allowed to enter. - this does not apply to nationals and residents of cameroon. 3. passengers arriving in cameroon: - are subject to medical screening; and - are subject to quarantine for 14 days; and - must have a medical certificate with a negative  () test result issued at most 72 hours before departure. 4. airline crew are subject to medical screening and quarantine until their next scheduled flight. .   "
  },
  {
    "code":"CN",
    "iso_alpha2": "CN",
    "continent": "AS",
    "name": "China",
    "score": "4.1 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 22.07.2020 1. the mainland of china has decided to temporarily suspend the entry into the mainland of china by foreign nationals holding visas or residence permits still valid to the time of this announcement, effective from 00:00 local time, 28 march 2020. entry by foreign nationals with apec business travel cards will be suspended as well. - policies including port visas, 24/72/144-hour visa-free transit policy, hainan 30-day visa-free policy, 15-day visa-free policy specified for foreign cruise-group-tour through shanghai port, guangdong 144-hour visa-free policy specified for foreign tour groups from hong kong or macao sar, and guangxi 15-day visa-free policy specified for foreign tour groups of asean countries will also be temporarily suspended. entry with diplomatic, service, courtesy or c visas will not be affected.  - foreign nationals coming to the mainland of china for necessary economic, trade, scientific or technological activities or out of emergency humanitarian needs may apply for visas at chinese embassies or consulates.  - entry by foreign nationals with visas issued after 28 march 2020 will not be affected. 2. passengers arriving at beijing (pek), guangzhou (can), shanghai hongqiao (sha), shanghai pudong (pvg), shenzhen (szx) or xiamen (xmn) are subject to medical screening and quarantine for 14 days. 3. airline crew of foreign airlines: - are not required to undergo nucleic acid test if they have a short stay after landing then depart immediately, and do not leave apron during the transition; or - shall receive nucleic acid test in the first port of entry if they need to enter the country to rest or continue to operate domestic routes. the test results will be confirmed by the local government in accordance with the requirements of epidemic prevention management. only if the test results are negative, crews can continue the operations; or - are allowed to return to their home country for isolation treatment when agreed by the local joint control mechanism, if they are symptomatic, in close contact with infected persons or tested positive. airlines and crews shall make all commitments to bear their responsibilities and also carry out strict protections. 4. a completed “health declaration form must be presented upon arrival. the form can be obtained before departure at <a href=http://health.customsapp.com/>http://health.customsapp.com/</a> . 5. nationals of china (people's rep.) arriving from australia, austria, belgium, brazil, canada, czechia, denmark, france, germany, iran, ireland (rep.), israel, italy, korea (rep.), malaysia, netherlands, norway, philippines, portugal, russian fed., spain, sweden, switzerland, thailand, turkey, united kingdom and usa must declare their health status for 14 days in the wechat mimi program fang yi jian kang ma guo ji ban. a green qr code generated from the program must be presented before departure. 6. the implementation of the new  certificate requirement depends on the chinese embassy in each country. the testing capabilities in each country are still being evaluated. as soon as the specific implementation measures are known, timatic will be updated.  "
  },
  {
    "code":"CO",
    "iso_alpha2": "CO",
    "continent": "SA",
    "name": "Colombia",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 01.07.2020 1. flights to colombia are suspended until 31 august 2020. - this does not apply to humanitarian flights. 2. passengers are not allowed to enter or transit colombia. - this does not apply to: - nationals and residents of colombia; - passengers with a diplomatic passport. 3. passengers are subject to quarantine for 14 days. 4. airline crew are subject to quarantine until their next flight.  5. a “control preventivo contra el  must be completed prior to arrival.  "
  },
  {
    "code":"CR",
    "iso_alpha2": "CR",
    "continent": "NA",
    "name": "Costa Rica",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 28.07.2020 1. passengers are not allowed to enter until 1 august 2020. - this does not apply to nationals of costa rica. - this does not apply to passengers who have left costa rica before 25 march 2020 and have: - permanent residence in costa rica; or - temporary residence in costa rica; or - special category (categoria especial); or - non-resident subcategory stay (no residente subcategoria estancia). 2. nationals and residents of costa rica are subject to isolation for 14 days. 3. an epidemiological form must be completed at <a target=_blank href=https://ccss.now.sh/>https://ccss.now.sh/</a> before departure. effective 1 august 2020: 1. nationals and residents of austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden and switzerland arriving from austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland or united kingdom are allowed to enter. 2. british nationals arriving from austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland or united kingdom are allowed to enter. 3. nationals and residents of canada arriving from canada are allowed to enter.  4. passengers arriving in costa rica must: - have a medical certificate with a negative  () test result issued at most 48 hours before departure; and - have a medical insurance issued by an insurance company of cost rica. this does not apply to nationals and residents of costa rica.  "
  },
  {
    "code":"CU",
    "iso_alpha2": "CU",
    "continent": "NA",
    "name": "Cuba",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 01.07.2020 1. Flights to Cuba are suspended. - This does not apply to humanitarian flights. - This does not apply to flights landing in Cayo Coco (CCC), Cayo Largo del Sur (CYO) or Santa Clara (SNU). 2. Passengers are subject to quarantine for 14 days. - This does not apply to passengers arriving in Cayo Coco (CCC), Cayo Largo del Sur (CYO) or Santa Clara (SNU).  "
  },
  {
    "code":"CV",
    "iso_alpha2": "CV",
    "continent": "AF",
    "name": "Cape Verde",
    "score": "2.8 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 27.07.2020 1. Flights to Cape Verde are suspended. - This does not apply to medevac, repatriation and humanitarian flights. 2. Airline crew are subject to quarantine until their next flight.  "
  },
  {
    "code":"CW",
    "iso_alpha2": "CX",
    "continent": "OC",
    "name": "Christmas Island",
    "score": "0 (Information not available)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 22.06.2020 1. Passengers are not allowed to enter and transit. - This does not apply to passengers with a residence permit issued by Curacao. - This does not apply to passengers arriving from Aruba, Bonaire, St. Eustatius and Saba and St. Maarten. 2. Passengers arriving from Aruba, Bonaire, St. Eustatius and Saba and St. Maarten must complete a health declaration form on arrival. They are subject to medical screening. 3. Passengers arriving from Aruba, Bonaire, St. Eustatius and Saba and St. Maarten must have an insurance to cover medical expenses in Curacao.   "
  },
  {
    "code":"CY",
    "iso_alpha2": "CY",
    "continent": "EU",
    "name": "Cyprus",
    "score": "2.6 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 23.07.2020 1. passengers are not allowed to enter.  - this does not apply to passengers arriving from algeria, andorra, australia, austria, belgium, bulgaria, canada, china (people's rep.), croatia, czechia, denmark, estonia, finland, france, georgia, germany, greece, hungary, iceland, ireland (rep.), italy, japan, korea (rep.), latvia, liechtenstein, lithuania, macao (sar china), malta, morocco, netherlands, new zealand, norway, poland, rwanda, san marino, slovakia, slovenia, spain, switzerland, thailand, tunisia, uruguay or vatican city (holy see). - this does not apply to residents of cyprus. - this does not apply to family members of nationals of cyprus, if the national of cyprus resides in cyprus, arriving from a country other than algeria, andorra, australia, austria, belgium, bulgaria, canada, china (people's rep.), croatia, czechia, denmark, estonia, finland, france, georgia, germany, greece, hungary, iceland, ireland (rep.), italy, japan, korea (rep.), latvia, liechtenstein, lithuania, macao (sar china), malta, morocco, netherlands, new zealand, norway, poland, rwanda, san marino, slovakia, slovenia, spain, switzerland, thailand, tunisia, uruguay or vatican city (holy see). 2. passengers who have been in a country other than algeria, andorra, australia, austria, belgium, bulgaria, canada, china (people's rep.), croatia, czechia, denmark, estonia, finland, france, georgia, germany, greece, hungary, iceland, ireland (rep.), italy, japan, korea (rep.), latvia, liechtenstein, lithuania, macao (sar china), malta, morocco, netherlands, new zealand, norway, poland, rwanda, san marino, slovakia, slovenia, spain, switzerland, thailand, tunisia, uruguay or vatican city (holy see) in the past 14 days are not allowed to enter.  - this does not apply to residents of cyprus. - this does not apply to family members of nationals of cyprus, if the national of cyprus resides in cyprus. 3. passengers must have a cyprus flight pass obtained before departure at <a target=_blank href=https://www.cyprusflightpass.gov.cy/>https://www.cyprusflightpass.gov.cy</a> . 4. passengers arriving from algeria, andorra, australia, belgium, bulgaria, china (people's rep.), croatia, czechia, france, georgia, italy, macao (sar china), morocco, netherlands, rwanda, san marino, spain, thailand, tunisia, uruguay or vatican city (holy see) must have a medical certificate stating a negative  () test result issued at most 72 hours before departure. - residents of cyprus are subject to a  () test if they do not have this medical certificate. - family members of nationals of cyprus, if the national of cyprus resides in cyprus, are subject to a  () test if they do not have this medical certificate. 5. passengers arriving from italy must: - have a medical certificate stating a negative  () test result issued at most 72 hours before departure; or - be tested for  () upon arrival. 6. nationals and residents of cyprus arriving from a country other than algeria, andorra, australia, austria, belgium, bulgaria, canada, china (people's rep.), croatia, czechia, denmark, estonia, finland, france, georgia, germany, greece, hungary, iceland, ireland (rep.), italy, japan, korea (rep.), latvia, liechtenstein, lithuania, macao (sar china), malta, morocco, netherlands, new zealand, norway, poland, rwanda, san marino, slovakia, slovenia, spain, switzerland, thailand, tunisia, uruguay or vatican city (holy see) are subject to a  () test and self-isolation for 14 days.. 7. family members of nationals of cyprus, if the national of cyprus resides in cyprus, arriving from a country other than algeria, andorra, australia, austria, belgium, bulgaria, canada, china (people's rep.), croatia, czechia, denmark, estonia, finland, france, georgia, germany, greece, hungary, iceland, ireland (rep.), italy, japan, korea (rep.), latvia, liechtenstein, lithuania, macao (sar china), malta, morocco, netherlands, new zealand, norway, poland, rwanda, san marino, slovakia, slovenia, spain, switzerland, thailand, tunisia, uruguay or vatican city (holy see) are subject to a  () test and self-isolation for 14 days. 8. a completed passenger locator form must be presented upon arrival.  "
  },
  {
    "code":"CZ",
    "iso_alpha2": "CZ",
    "continent": "EU",
    "name": "Czech Republic",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 20.07.2020 1. Passengers are not allowed to enter.  - This does not apply to: - nationals of Czechia;  - British nationals and nationals of Andorra, Australia, Austria, Belgium, Bulgaria, Canada, Croatia, Cyprus, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, New Zealand, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland, Thailand and Vatican City (Holy See); - passengers with a residence permit issued by Czechia; - passengers with a long-term residence permit issued by Andorra, Australia, Austria, Belgium, Bulgaria, Canada, Croatia, Cyprus, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, New Zealand, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland, Thailand, United Kingdom and Vatican City (Holy See); - spouses of British nationals or of nationals of Andorra, Monaco, San Marino, Switzerland, Vatican City (Holy See) and an EEA Member State residing in Czechia; - passengers younger than 21 years who are children of British nationals or of nationals of Andorra, Monaco, San Marino, Switzerland, Vatican City (Holy See) and an EEA Member State residing in Czechia; - passengers with a D visa issued by Czechia; - passengers with a C visa issued by Czechia after 11 May 2020; - passengers who are unmarried partners of nationals of Czechia. They must have a confirmation of their relationship issued by the Ministry of Foreign Affairs of Czechia.   "
  },
  {
    "code":"DE",
    "iso_alpha2": "DE",
    "continent": "EU",
    "name": "Germany",
    "score": "3.1 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 21.07.2020 1. Passengers are not allowed to enter. This does not apply to: - passengers arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom; - nationals of Germany; - passengers with a residence permit issued by Germany; - residents of Australia, Canada, Georgia, New Zealand, Thailand and Uruguay; - passengers with a D Visa issued by Germany; - husband, wife, child and registered partner of nationals or residents of Germany; - nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland and their family members returning via Germany to their country of residence; - British nationals and their family members returning via Germany to their country of residence; - military personnel; - merchant seamen; - passengers traveling as students if they cannot complete their study outside Germany. 2. Passengers are not allowed to transit if arriving from a non-Schengen Member State to another Schengen Member State. This does not apply to: - nationals of EEA Member States and Switzerland; - British nationals; - family members of nationals of EEA Member States and Switzerland; - family members of British nationals; - residents of EEA Member States and Switzerland; - residents of Australia, Canada, Georgia, New Zealand, Thailand and Uruguay; - military personnel; - merchant seamen. 3. For more information, please refer to the website <a href=https://www.bundespolizei.de/Web/DE/04Aktuelles/01Meldungen/2020/03/200317_faq.html;jsessionid=97A3BB54ABD2E6A6A7D1D39F30BEC55C.2_cid324?nn=5931604#doc13824392bodyText2>https://www.bundespolizei.de/Web/DE/04Aktuelles/01Meldungen/2020/03/200317_faq.html;jsessionid=97A3BB54ABD2E6A6A7D1D39F30BEC55C.2_cid324?nn=5931604#doc13824392bodyText2</a> . 4. Passengers are subject to quarantine for 14 days.   "
  },
  {
    "code":"DJ",
    "iso_alpha2": "DJ",
    "continent": "AF",
    "name": "Djibouti",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 27.07.2020 1. Flights to Djibouti restarted. 2. Passengers are subject to medical screening on arrival.  "
  },
  {
    "code":"DK",
    "iso_alpha2": "DK",
    "continent": "EU",
    "name": "Denmark",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 27.07.2020 1. passengers are not allowed to enter. -this does not apply to: - nationals and residents of denmark; - residents of andorra, australia, austria, belgium, bulgaria, canada, croatia, cyprus, czechia, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, japan, korea (rep.), latvia, liechtenstein, lithuania, luxembourg, malta, monaco, netherlands, new zealand, norway, poland, romania, san marino, slovakia, slovenia, spain, switzerland, thailand, united kingdom and vatican city (holy see) traveling as tourists. they must have proof of confirmed accommodation for at least 6 nights; - residents of the blekinge, halland, jamtland harjedalen, kalmar, kronoberg, orebro, ostergotland, skane, sormland, uppsala, varmland and vasterbotten regions in sweden traveling as tourists. they must have proof of confirmed accommodation for at least 6 nights; - spouse, partner, parent or child of nationals of denmark residing in denmark;  - spouse, partner, parent or child of nationals of denmark not residing in denmark. they must travel together; - spouse, partner, parent or child of residents of denmark; - passengers returning directly via denmark to their country of residence; - passengers traveling on business; - passengers traveling as students; - merchant seamen. 2. for more information, please refer to the website <a href=https://politi.dk/en/-in-denmark/travelling-in-or-out-of-denmark/entry-into-denmark>https://politi.dk/en/-in-denmark/travelling-in-or-out-of-denmark/entry-into-denmark</a> .  "
  },
  {
    "code":"DM",
    "iso_alpha2": "DM",
    "continent": "NA",
    "name": "Dominica",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 22.07.2020 1.passengers are not allowed to enter until 7 august 2020. - this does not apply to nationals of dominica. 2. passengers arriving in dominica: - must present a travel clearance obtained before departure at <a href=http://dom19.dominica.gov.dm/>http://dom19.dominica.gov.dm/</a> ; and - are subject to medical screening and quarantine.  "
  },
  {
    "code":"DO",
    "iso_alpha2": "DO",
    "continent": "NA",
    "name": "Dominican Republic",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 02.07.2020 1. Flights to Dominican Rep. restarted. 2. Passengers are subject to medical screening and must have a completed health declaration form.</p><p/>"
  },
  {
    "code":"DZ",
    "iso_alpha2": "DZ",
    "continent": "AF",
    "name": "Algeria",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 21.07.2020 Flights to Algeria are suspended. - This does not apply to medevac and repatriation flights.  "
  },
  {
    "code":"EC",
    "iso_alpha2": "EC",
    "continent": "SA",
    "name": "Ecuador",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 08.07.2020  1. passengers must have a medical certificate with a negative  () test result issued at most 7 days before departure. passengers are subject to quarantine for 14 days at their own expense if they do not have this medical certificate. 2. passengers are subject to medical screening and self-quarantine for 14 days. 3. a completed declaracion de salud del viajero and formulario migratorio especial must be presented upon arrival.  "
  },
  {
    "code":"EE",
    "iso_alpha2": "EE",
    "continent": "EU",
    "name": "Estonia",
    "score": "2.7 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 17.07.2020 1. passengers are not allowed to enter. -this does not apply to:  - nationals and residents of estonia, latvia and lithuania; - parent, child or spouse of nationals or residents of estonia; - passengers arriving from austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland or united kingdom. they must have no symptoms of illness and have stayed in those countries in the last 14 days; - residents of algeria, australia, canada, georgia, japan, korea (rep.), montenegro, morocco, new zealand, rwanda, serbia, thailand, tunisia or uruguay; - passengers who are entering estonia in order to go back home. they must not show any symptoms of  (); - passengers traveling as students in estonia. 2. passengers are subject to self-isolation for 14 days. a list of self-isolation exemptions can be found at <a href=https://vm.ee/en/information-countries-and-self-isolation-requirements-passengers>https://vm.ee/en/information-countries-and-self-isolation-requirements-passengers</a>.  "
  },
  {
    "code":"EG",
    "iso_alpha2": "EH",
    "continent": "AF",
    "name": "Western Sahara",
    "score": "0 (Information not available)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 01.07.2020  1. Flights to Egypt restarted. 2. A completed Public Health Card must be presented to immigration upon arrival. 3. Passengers must have an insurance to cover medical expenses in Egypt. - This does not apply to nationals and residents of Egypt.  "
  },
  {
    "code":"ER",
    "iso_alpha2": "ER",
    "continent": "AF",
    "name": "Eritrea",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 02.04.2020 Asmara (ASM) is closed.  "
  },
  {
    "code":"ES",
    "iso_alpha2": "ES",
    "continent": "EU",
    "name": "Spain",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 23.07.2020 1. Passengers are not allowed to enter until 31 July 2020.  This does not apply to: - nationals and residents of Spain; - passengers arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Sweden or Switzerland; - residents of Andorra, Bulgaria, Croatia, Cyprus, Monaco, Romania, San Marino, Vatican City (Holy See) or a Schengen Member States arriving from a country other than Bulgaria, Croatia, Cyprus, Romania or a Schengen Member State returning via Spain to their country of residence; - residents of Andorra, Australia, Canada, Georgia, Japan, Korea (Rep.), Monaco, New Zealand, Rwanda, San Marino, Thailand, Tunisia, United Kingdom, Uruguay or Vatican City (Holy See), if arriving from the country of residence; - passengers with a long-term visa issued by a Schengen Member State returning via Spain to their country of residence; - students with a medical insurance. They are allowed to travel to the country of their studies 15 days before the start of the academic course; - merchant seamen; - military personnel; - immediate family members of a national of an EU Member State traveling together or traveling to join the national of an EU Member State; - immediate family members of a British national traveling together or traveling to join the British national 2. A completed Health Control Form must be presented upon arrival. 3. Residency permits and D visas that expired between 14 December 2019 and 21 June 2020 are accepted for entry. Effective 31 July 2020: Passengers must complete an FCS Health Control Form at <a target=_blank href=https://www.spth.gob.es/>https://www.spth.gob.es/</a> . A  code generated from the completed form must be presented upon arrival.   "
  },
  {
    "code":"ET",
    "iso_alpha2": "ET",
    "continent": "AF",
    "name": "Ethiopia",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 23.07.2020 1. passengers must have a medical certificate with a negative  () rt-pcr test result issued at most 5 days before arrival starting from the time sample is given. they are subject to self-isolation for 14 days. 2. passengers without a  () rt-pcr test result are subject to medical screening and quarantine for 14 days partially at their own expense.  "
  },
  {
    "code":"FI",
    "iso_alpha2": "FI",
    "continent": "EU",
    "name": "Finland",
    "score": "2.8 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 27.07.2020 1. Passengers are not allowed to enter until 25 August 2020. -This does not apply to: - nationals of Finland and their family members; - passengers with a residence permit issued by Finland;  - passengers arriving from Andorra, Belgium, Cyprus, Denmark, Estonia, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Malta, Netherlands, Norway, San Marino, Slovakia and Vatican City (Holy See); - residents of Georgia, Japan, Korea (Rep.), New Zealand, Rwanda, Thailand, Tunisia and Uruguay, when arriving from Georgia, Japan, Korea (Rep.), New Zealand, Rwanda, Thailand, Tunisia or Uruguay; - nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland and their family members, residing in Finland or returning via Finland to their country of residence; - British nationals and their family members residing in Finland or returning via Finland to their country of residence; - residents of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland and United Kingdom, returning via Finland to their country of residence; - passengers arriving from Bulgaria, Croatia, Monaco, Romania, United Kingdom or Schengen Member States traveling on business; - passengers studying in Finland, if arriving from Bulgaria, Croatia, Monaco, Romania, United Kingdom or Schengen Member States; - military personnel. 2. For more information, please refer to the website <a href=https://www.raja.fi/current_issues/guidelines_for_border_traffic>https://www.raja.fi/current_issues/guidelines_for_border_traffic</a> .  "
  },
  {
    "code":"FJ",
    "iso_alpha2": "FJ",
    "continent": "OC",
    "name": "Fiji",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 30.03.2020  1. Passengers and airline crew are not allowed to enter Fiji.  - This does not apply to nationals of Fiji. 2. Nationals of Fiji must go into quarantine for a period of 14 days.  "
  },
  {
    "code":"FK",
    "iso_alpha2": "FK",
    "continent": "SA",
    "name": "Falkland Islands",
    "score": "4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 12.06.2020  1. Passengers are not allowed to enter.  - This does not apply to passengers with Falkland Isl. (Malvinas) status and residents of Falkland Isl. (Malvinas). 2. Passengers with Falkland Isl. (Malvinas) status and residents of Falkland Isl. (Malvinas) are subject to quarantine for 14 days.  "
  },
  {
    "code":"FM",
    "iso_alpha2": "FO",
    "continent": "EU",
    "name": "Faroe Islands",
    "score": "0 (Information not available)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 31.03.2020  1. passengers traveling to the state of chuuk must self-quarantine for 14 days in a  () free country before departure. 2. passengers and airline crew must go through medical screening upon arrival.  3. passengers are not allowed to enter the state of pohnpei. - this does not apply to residents of pohnpei. - this does not apply to medical and technical personnel. 4. passengers traveling to the state of pohnpei must have a medical certificate and must be quarantined for 14 days. 5. passengers traveling to the state of chuuk will be quarantined for 14 days.  "
  },
  {
    "code":"FR",
    "iso_alpha2": "FR",
    "continent": "EU",
    "name": "France",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 22.07.2020 1. passengers are not allowed to enter. - this does not apply to: - nationals of france, if not arriving from french guiana or mayotte, and their spouses and children; - british nationals and nationals of andorra, monaco, san marino, switzerland, vatican city (holy see) and an eea member state if not arriving from french guiana or mayotte; and their spouses and children; - passengers arriving from andorra, australia, canada, georgia, japan, korea (rep.), monaco, morocco, new-zealand, rwanda, san marino, switzerland, thailand, tunisia, united kingdom, uruguay, vatican city (holy see) or an eea member state; - passengers with a residence permit issued by andorra, monaco, san marino, switzerland, united kingdom, vatican city (holy see) or an eea member state if not arriving from french guiana or mayotte; - merchant seamen if not arriving from french guiana or mayotte;  - students if not arriving from french guiana or mayotte.  2. a completed international travel certificate must be presented prior to boarding and to immigration upon arrival or when transiting france. the certificate can be obtained at consulates or at <a href=https://www.interieur.gouv.fr>https://www.interieur.gouv.fr</a>.  - this does not apply to passengers arriving from andorra, australia, canada, georgia, japan, korea (rep.), monaco, morocco, new-zealand, rwanda, san marino, switzerland, thailand, tunisia, united kingdom, uruguay, vatican city (holy see) or an eea member state. 3. passengers are subject to quarantine or isolation.  4. passengers must complete a declaration on honor to state that they do not have symptoms of  ().  "
  },
  {
    "code":"GA",
    "iso_alpha2": "GA",
    "continent": "AF",
    "name": "Gabon",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 06.07.2020 1. passengers arriving from austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland and united kingdom are not allowed to enter. - this does not apply to nationals and residents of gabon. 2. passengers must have a medical certificate with a negative  () test result issued at most 5 days before arrival.  3. passengers are subject to self- isolation for 14 days.  "
  },
  {
    "code":"GB",
    "iso_alpha2": "GB",
    "continent": "EU",
    "name": "United Kingdom",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 10.07.2020 1. passengers are subject to self-isolation for 14 days. a list of self-isolation exemptions can be found at <a target=_blank href=https://www.gov.uk/guidance/--travel-corridors#updates-to-the-travel-corridor-list>https://www.gov.uk/guidance/--travel-corridors#updates-to-the-travel-corridor-list</a> .  2. a completed public health passenger locator form must be presented to immigration upon arrival. the form can be obtained before departure at <a target=_blank href=https://visas-immigration.service.gov.uk/public-health-passenger-locator-form>https://visas-immigration.service.gov.uk/public-health-passenger-locator-form</a>.  "
  },
  {
    "code":"GD",
    "iso_alpha2": "GD",
    "continent": "NA",
    "name": "Grenada",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 15.07.2020  1. airports in grenada reopened. 2. passengers and airline crew are not allowed to enter. - this does not apply to passengers and airline crew arriving from antigua and barbuda, bahamas, barbados, belize, dominica, guyana, haiti, jamaica, montserrat, st. kitts and nevis, st. lucia, st. vincent and the grenadines, suriname or trinidad and tobago.  - this does not apply to passengers traveling on repatriation and medevac flights. - effective 1 august 2020, this does not apply to passengers and airline crew arriving from austria, belgium, bulgaria, canada, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, ireland (rep.), italy, latvia, lithuania, luxembourg, malta, netherlands, poland, portugal, romania, slovakia, slovenia, spain, sweden or united kingdom. 3. passengers and airline crew: - must present a health declaration form to the immigration upon arrival. the form can be obtained before departure at <a href=https://19.gov.gd/>https://19.gov.gd/</a>; - must install the grenada's contact tracing app at <a href=https://19.gov.gd/>https://19.gov.gd/</a> in their personal device;  - are subject to medical screening upon arrival;  - are subject to quarantine. more information can be found at <a href=https://19.gov.gd/>https://19.gov.gd/</a>. 4. effective 1 august 2020, passengers and airline crew must have a medical certificate with a negative  () pcr test result issued at most 7 days before arrival.  - this does not apply to passengers and airline crew traveling from antigua and barbuda, bahamas, barbados, belize, dominica, guyana, haiti, jamaica, montserrat, st. kitts and nevis, st. lucia, st. vincent and the grenadines, suriname or trinidad and tobago. 5. effective 1 august 2020, passengers and airline crew must have a travel insurance or declare they will cover the cost of treatments and isolation.  - this does not apply to nationals of grenada and to passengers and airline crew traveling from antigua and barbuda, bahamas, barbados, belize, dominica, guyana, haiti, jamaica, montserrat, st. kitts and nevis, st. lucia, st. vincent and the grenadines, suriname or trinidad and tobago.   "
  },
  {
    "code":"GE",
    "iso_alpha2": "GE",
    "continent": "AS",
    "name": "Georgia",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 27.07.2020 1. Flights to Georgia are suspended until 31 August 2020. -This does not apply to: - flights from Estonia, France, Germany, Latvia and Lithuania; - humanitarian, medevac and repatriation flights. 2. Passengers are not allowed to enter Georgia.  -This does not apply to: - nationals and residents of Croatia, Cyprus, Georgia, Greece, Iceland, Italy, Luxembourg, Netherlands, Poland, Portugal, Romania, Slovenia, Spain and Sweden; - nationals and residents of Estonia, France, Germany, Latvia and Lithuania arriving directly from Estonia, France, Germany, Latvia or Lithuania. 3. Passengers are subject to medical screening on arrival. 4. Nationals and residents of Croatia, Cyprus, Georgia, Greece, Iceland, Italy, Luxembourg, Netherlands, Poland, Portugal, Romania, Slovenia, Spain and Sweden are subject to quarantine for 14 days. 5. Passengers must complete a form 48 hours before arrival at <a href=https://registration.gov.ge/pub/form/7_protocol_for_arrivals_in_georgia/kcjcpx/>https://registration.gov.ge/pub/form/7_protocol_for_arrivals_in_georgia/kcjcpx/</a> .  - This does not apply to nationals of Georgia.  "
  },
  {
    "code":"GF",
    "iso_alpha2": "GG",
    "continent": "EU",
    "name": "Guernsey",
    "score": "0 (Information not available)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 29.07.2020  1. a completed international travel certificate must be presented prior to boarding and to immigration upon arrival or when transiting french guiana. the certificate can be obtained at consulates or at <a target=_blank href=https://www.interieur.gouv.fr/>https://www.interieur.gouv.fr</a>.  2. passengers must go through a medical examination upon arrival and are subject to quarantine for a period of 14 days. - this does not apply to healthcare professionals related to  ().  "
  },
  {
    "code":"GH",
    "iso_alpha2": "GH",
    "continent": "AF",
    "name": "Ghana",
    "score": "3.6 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 29.07.2020 Flights to Ghana are suspended until 13 August 2020. - This does not apply to humanitarian, medevac and repatriation flights. 2. Passengers are subject to medical screening and quarantine. 3. Airline crew are subject to quarantine until their next flight.  "
  },
  {
    "code":"GI",
    "iso_alpha2": "GI",
    "continent": "EU",
    "name": "Gibraltar",
    "score": "4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 23.06.2020  () entry regulations lifted on 21 june 2020.  "
  },
  {
    "code":"GL",
    "iso_alpha2": "GL",
    "continent": "NA",
    "name": "Greenland",
    "score": "4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 24.04.2020 please see  () regulations for denmark.  "
  },
  {
    "code":"GM",
    "iso_alpha2": "GM",
    "continent": "AF",
    "name": "Gambia",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 10.06.2020 Flights to Gambia are suspended. - This does not apply to humanitarian, medevac and repatriation flights.  "
  },
  {
    "code":"GN",
    "iso_alpha2": "GN",
    "continent": "AF",
    "name": "Guinea",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 27.07.2020  1. conakry (cky) airport reopened. 2. nationals of austria, belgium, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, slovakia, slovenia, spain, sweden and switzerland are not allowed to enter. - this does not apply to passengers with a residence permit issued by guinea. 3. passengers must have a medical certificate with a negative  () test result issued at most 5 days before arrival. 4. passengers are subject to medical screening and quarantine for 14 days.  "
  },
  {
    "code":"GP",
    "iso_alpha2": "GP",
    "continent": "NA",
    "name": "Guadeloupe",
    "score": "4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 29.07.2020  1. passengers arriving from brazil, india, israel, russian fed., turkmenistan or usa are not allowed to enter.  - this does not apply to passengers who reside in french west indies. 2. passengers must have a medical certificate with a negative  () test result issued at most 72 hours before departure. - this does not apply to passengers who reside in french west indies or french guiana.  3. passengers are subject to medical screening and quarantine for 7 days. 4. a completed international travel certificate must be presented prior to boarding and to immigration upon arrival or when transiting french west indies. the certificate can be obtained at consulates or at <a target=_blank href=https://www.interieur.gouv.fr/>https://www.interieur.gouv.fr</a>.  </p><p> "
  },
  {
    "code":"GQ",
    "iso_alpha2": "GQ",
    "continent": "AF",
    "name": "Equatorial Guinea",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 30.06.2020 1. flights to equatorial guinea restarted. 2. passengers and airline crew must have a medical certificate with a negative  () pcr test result issued at most 48 hours before arrival.  3. passengers and airline crew without a medical certificate with a negative  () pcr test result are subject to medical screening and quarantine.  "
  },
  {
    "code":"GR",
    "iso_alpha2": "GS",
    "continent": "AN",
    "name": "South Georgia and the South Sandwich Islands",
    "score": "0 (Information not available)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 28.07.2020 1. passengers are not allowed to enter until 31 july 2020. -this does not apply to: - nationals of austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden and switzerland and their family members; - british nationals and their family members; - nationals of algeria, australia, canada, georgia, japan, korea (rep.), montenegro, morocco, new zealand, rwanda, thailand, tunisia and uruguay; - residents of algeria, australia, canada, georgia, japan, korea (rep.), montenegro, morocco, new zealand, rwanda, thailand, tunisia and uruguay; - passengers with a residence permit issued by greece. a certificate of application for renewal of a residence permit is not accepted; - passengers with a residence permit issued by austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland or the united kingdom; - passengers with a long term visa issued by austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland or the united kingdom; - nationals of north macedonia (rep.) returning via thessaloniki (skg) to continue by road to north macedonia (rep.). their trip must be prearranged by the authorities; - military personnel. 2. passengers are subject to medical screening and quarantine for 1 or 14 days. 3. flights from turkey are suspended until 31 july 2020. - this does not apply to humanitarian, medevac, military and repatriation flights. 4. passengers must complete a passenger locator form (plf) at least 24 hours before check-in at <a href=https://travel.gov.gr/#/>https://travel.gov.gr/#/</a> . a qr code generated from the completed form must be presented upon arrival. 5. passengers arriving from albania and north macedonia (rep.) must arrive at athens (ath). 6. until 4 august 2020, passengers arriving from bulgaria or romania must have a medical certificate with a negative  () pcr test result issued at most 72 hours before arrival. - this does not apply to nationals of greece and passengers with a residence permit issued by greece.  "
  },
  {
    "code":"GT",
    "iso_alpha2": "GT",
    "continent": "NA",
    "name": "Guatemala",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 19.06.2020  Airports in Guatemala are closed until 15 August 2020.  - This does not apply to humanitarian, military or ambulance flights. Passengers are subject to quarantine for 7 days.  "
  },
  {
    "code":"GU",
    "iso_alpha2": "GU",
    "continent": "OC",
    "name": "Guam",
    "score": "4.5 (Extreme Warning)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 24.07.2020 1. Passengers are subject to medical screening and quarantine for 14 days. A list of quarantine exemptions can be found at <a href=https://guamrecovery.com/jic-release-no-235-list-of-low-risk-areas-for-quarantine-protocol-effective-july-24-2020/>https://guamrecovery.com/jic-release-no-235-list-of-low-risk-areas-for-quarantine-protocol-effective-july-24-2020/</a> . 2. Airline crew are subject to quarantine until their next flight.  "
  },
  {
    "code":"GW",
    "iso_alpha2": "GW",
    "continent": "AF",
    "name": "Guinea-Bissau",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 13.07.2020 Flights to Guinea-Bissau are suspended.  - This does not apply to humanitarian, medevac and repatriation flights.  "
  },
  {
    "code":"GY",
    "iso_alpha2": "GY",
    "continent": "SA",
    "name": "Guyana",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 02.07.2020 1. airports in guyana are closed until 31 july 2020. - this does not apply to medevac and repatriation flights. 2. passengers must have a medical certificate with a negative  () test result.  "
  },
  {
    "code":"HK",
    "iso_alpha2": "HK",
    "continent": "AS",
    "name": "Hong Kong",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 27.07.2020 1. passengers are not allowed to enter. -this does not apply to: - passengers with a hong kong sar, china passport; - passengers with a british passport with nationality british national (overseas) with the right of abode in hong kong sar, china; - residents of hong kong sar, china with a permanent identity card; - residents of hong kong sar, china with an identity card accompanied by a valid study visa; - residents of hong kong sar, china with an identity card accompanied by a visa with permission to remain extended until. they must enter within the validity of the permitted stay; - passengers with a residence or study visa issued by hong kong sar, china; - passengers with a certificate of entitlement issued by hong kong sar, china; - passengers who are arriving from the mainland of china, chinese taipei or macao (sar china) and have not been outside the mainland of china, chinese taipei and macao (sar china) in the past 14 days; - crew members of aircraft who need to commute to and from foreign places for performance of necessary duties or crew members of goods vessels; - passengers with a diplomatic, an official or a service passport traveling on duty; - spouses and minor children of hong kong sar, china residents. 2. passengers are subject to medical screening and quarantine for 14 days. 3. passengers and airline crew must present a completed health declaration form to the department of health. 4. passengers transiting through hong kong, sar china must have a connecting flight booked on the same ticket. 5. passengers are not allowed to transit via hong kong, sar china from/to the mainland of china. - this does not apply to passengers with a diplomatic passport. 6. passengers who have been in bangladesh, india, indonesia, nepal, pakistan, philippines or south africa in the past 14 days must have: - a medical certificate with a negative  () nucleic acid test result issued at most 72 hours before departure. the certificate must be in chinese or english, and have the name and identity card or passport number of the passenger; and - the original report for the nucleic acid test. the report must have the name and identity card or passport number of the passenger; and - a letter in chinese or english issued by the relevant authority certifying that the test laboratory is recognized and approved by the government; and - a confirmed booking in chinese or english of an accommodation in hong kong for 14 days or more.  - this does not apply to passengers in transit. 7. effective 29 july 2020, passengers who have been in kazakhstan or usa in the past 14 days must have: - a medical certificate with a negative  () nucleic acid test result issued at most 72 hours before departure. the certificate must be in chinese or english, and have the name and identity card or passport number of the passenger; and - the original report for the nucleic acid test. the report must have the name and identity card or passport number of the passenger; and - a letter in chinese or english issued by the relevant authority certifying that the test laboratory is recognized and approved by the government; and - a confirmed booking in chinese or english of an accommodation in hong kong for 14 days or more.  - this does not apply to passengers in transit.  "
  },
  {
    "code":"HN",
    "iso_alpha2": "HN",
    "continent": "NA",
    "name": "Honduras",
    "score": "3.7 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 22.04.2020 Airports in Honduras are closed. - This does not apply to humanitarian flights with an authorization issued 24h before departure by the Secretariat of tourism or Secretariat for foreign relations and international cooperation of Honduras.  "
  },
  {
    "code":"HR",
    "iso_alpha2": "HR",
    "continent": "EU",
    "name": "Croatia",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 17.07.2020 1. passengers are not allowed to enter. this does not apply to: - nationals of austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden and switzerland and their family members; - british nationals and their family members; - passengers with a long term residence permit or a long term d visa issued by austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland or united kingdom;  - passengers entering croatia to transit by land to a third country. they must prove that they can enter the destination country; - passengers traveling as tourists with a confirmation of accommodation booking; - passengers traveling on business with an invitation letter from a company in croatia; - passengers with a diplomatic passport traveling on duty; - passengers traveling as students; - military personnel. 2. passports and national id cards issued to nationals of croatia which expired on 11 march 2020 or later are considered valid. 3. passengers are subject to medical screening and self-isolation for 14 days. a list of self-isolation exemptions can be found at <a href=https://www.koronavirus.hr/recommendations-and-instructions-for-crossing-the-state-border/736>https://www.koronavirus.hr/recommendations-and-instructions-for-crossing-the-state-border/736</a>. 4. for more information, please refer to the website <a href=https://mup.gov.hr/uzg-/english/286212>https://mup.gov.hr/uzg-/english/286212</a>.  "
  },
  {
    "code":"HT",
    "iso_alpha2": "HT",
    "continent": "NA",
    "name": "Haiti",
    "score": "4.4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 30.06.2020  1. Flights to Haiti restarted. 2. Passengers are subject to medical screening. 3. A completed Health Declaration Form must be presented to immigration upon arrival.  "
  },
  {
    "code":"HU",
    "iso_alpha2": "HU",
    "continent": "EU",
    "name": "Hungary",
    "score": "2.7 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 20.07.2020 1. passengers are not allowed to enter. - this does not apply to: - nationals of hungary, and their family members; - passengers arriving from andorra, austria, belgium, bulgaria, china (people’s rep.), croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, iceland, ireland (rep.), italy, japan, korea (rep.), latvia, liechtenstein, lithuania, luxembourg, malta, monaco, netherlands, norway, poland, portugal, romania, russian fed., san marino, serbia, slovakia, slovenia, spain, sweden, switzerland, usa, united kingdom or vatican city (holy see);  - passengers with a permanent residence permit issued by hungary, and their family members; - passengers with a signed and stamped letter issued by the deputy-chief officer of the national police. 2. passengers are subject to medical screening and quarantine for 14 days. - this does not apply to: - nationals of hungary, and their family members; - passengers arriving from andorra, austria, belgium, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, iceland, ireland (rep.), italy, korea (rep.), latvia, liechtenstein, lithuania, luxembourg, malta, monaco, netherlands, poland, san marino, slovakia, slovenia, spain, switzerland or vatican city (holy see); - passengers with 2 separate medical certificates with a negative  () pcr test result issued at most 5 days before arrival. 3. airline crew are subject to medical screening and quarantine until their next scheduled flight. </p> "
  },
  {
    "code":"ID",
    "iso_alpha2": "ID",
    "continent": "AS",
    "name": "Indonesia",
    "score": "4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 10.07.2020  1. passengers are not allowed to enter and transit. - this does not apply to nationals of indonesia. - this does not apply to passengers with a temporary stay permit (itas) or permanent stay permit (itap). - this does not apply to passengers with a diplomatic or a service visa. - this does not apply to passengers with a diplomatic or service stay permit. - this does not apply to passengers with a visa issued after 31 march 2020. 2. passengers and airline crew must have a medical certificate with a negative  () pcr test result issued at most 7 days before arrival. 3. passengers without a medical certificate with a negative  () pcr test result are subject to medical screening and quarantine for 14 days. 4. airline crew without a medical certificate with a negative  () pcr test result are subject to medical screening and quarantine until their next flight. 5. deadhead crew will be given an entry stamp. they must: - have a valid crew id card or crew member certificate;  - provide written notification to immigration officer proving they will be on duty on the return flight. the notification must be received by immigration officer minimum 24 hours from arrival.  "
  },
  {
    "code":"IE",
    "iso_alpha2": "IE",
    "continent": "EU",
    "name": "Ireland",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 27.07.2020 1. Passengers arriving in Ireland (Rep.): - must complete a Public Health Passenger Locator Form; and - are subject to self-isolation for 14 days. A list of quarantine exemptions can be found at <a href=https://www.dfa.ie/travel/>https://www.dfa.ie/travel/</a> . This does not apply to passengers with a diplomatic passport. 2. Suspension of the visa exemption for passengers with a short stay visa issued by the United Kingdom.  "
  },
  {
    "code":"IL",
    "iso_alpha2": "IM",
    "continent": "EU",
    "name": "Isle of Man",
    "score": "0 (Information not available)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 29.06.2020 1. Passengers are not allowed to enter and transit.  - This does not apply to nationals of Israel. - This does not apply to residents of Israel. 2. Passengers are subject to quarantine for 14 days. 3. A completed Health Declaration Form must be presented upon arrival.  "
  },
  {
    "code":"IN",
    "iso_alpha2": "IN",
    "continent": "AS",
    "name": "India",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 17.07.2020 1. Flights to India are suspended until 31 July 2020. - This does not apply to relief, repatriation and humanitarian flights.  2. Passengers are not allowed to enter. This does not apply to: - nationals of India; - residents of India; - passengers with an Overseas Citizen of India (OCI) card or booklet; - students if one of the parents is a national of India or OCI card holder; - minors if one of the parents is a national of India or OCI card holder; - spouses of nationals of India; - single parents of a minor who is national of India or OCI card holder; - passengers returning from a neighboring country via India to their country of residence; - passengers with diplomatic, official, UN/International Organizations or project visas. 3. Visas and e-visas issued before 30 June 2020 are invalidated.  This does not apply to: - Diplomatic, official, UN/International Organizations or project visas/all category of Employment visas; - airline crew; - Business visa (excluding B-3 visa for sports). 4. Passengers arriving in India: - are subject to medical screening and quarantine for 14 days; and - must install Arogya Setu in their personal device; and - must present a completed Self-declaration form.  "
  },
  {
    "code":"IQ",
    "iso_alpha2": "IQ",
    "continent": "AS",
    "name": "Iraq",
    "score": "4.7 (Extreme Warning)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 13.07.2020 Flights to Iraq are suspended. - This does not apply to emergency, humanitarian, medevac, military and repatriation flights.  "
  },
  {
    "code":"IR",
    "iso_alpha2": "IR",
    "continent": "AS",
    "name": "Iran",
    "score": "4.6 (Extreme Warning)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 27.07.2020 1. suspension of visa on arrival facilities for passengers traveling as tourists. 2. e-visas can be obtained before departure at <a href=http://e_visa.mfa.ir/en/>http://e_visa.mfa.ir/en/</a> . passengers must have a confirmation email. 3. passengers must have a medical certificate with a negative  () pcr test result issued at most 96 hours before arrival. 4. nationals of iran arriving without a negative  () pcr test result are subject to medical screening and quarantine for 14 days at their own expense. 5. passengers are subject to medical screening and quarantine at their own expense. 6. a completed self-declaration form concerning  () must be presented upon arrival.  "
  },
  {
    "code":"IS",
    "iso_alpha2": "IS",
    "continent": "EU",
    "name": "Iceland",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 20.07.2020 1. passengers are not allowed to enter iceland.  -this does not apply to: - nationals of andorra, monaco, san marino, switzerland, vatican city (holy see) and eea member states; - british nationals;  - passengers with a residence permit issued by andorra, monaco, san marino, switzerland, vatican city (holy see) or an eea member state; - family members of nationals of andorra, monaco, san marino, switzerland, vatican city (holy see) and eea member states; - family members of british nationals; - residents of algeria, australia, canada, georgia, japan, korea (rep.), morocco, new zealand, rwanda, thailand, tunisia and uruguay arriving from their country of residence; - military personnel traveling on duty. 2. passengers traveling through iceland to another schengen member state must have a written confirmation of their permission to enter the other schengen member state. 3. passengers are subject to medical screening and quarantine for 14 days. a list of quarantine exemptions can be found at <a href=https://www..is/categories/tourists-travelling-to-iceland>https://www..is/categories/tourists-travelling-to-iceland</a>. 4. passengers must complete the preregistration for visiting iceland at <a target=_blank href=http://visit..is/>http://visit..is/</a> before departure.  "
  },
  {
    "code":"IT",
    "iso_alpha2": "JE",
    "continent": "EU",
    "name": "Jersey",
    "score": "0 (Information not available)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 24.07.2020 1. passengers are not allowed to enter until 31 july 2020. - this does not apply to: - nationals or residents of italy; - passengers arriving from algeria, andorra, australia, austria, belgium, bulgaria, canada, croatia, cyprus, czechia, denmark, estonia, finland, france, georgia, germany, greece, hungary, iceland, ireland (rep.), japan, korea (rep.), latvia, liechtenstein, lithuania, luxembourg, malta, monaco, montenegro, morocco, netherlands, new zealand, norway, poland, portugal, romania, rwanda, serbia, slovakia, slovenia, spain, sweden, switzerland, thailand, tunisia, united kingdom or uruguay; - passengers traveling on business; - passengers returning via italy to their country of residence. 2. passengers and airline crew who have transited through or have been in armenia, bahrain, bangladesh, bosnia and herzegovina, brazil, chile, dominican rep., kosovo (rep.), kuwait, moldova (rep.), montenegro, north macedonia (rep.), oman, panama, peru or serbia in the past 14 days are not allowed to enter and transit.  this does not apply to: - nationals of and family members of nationals of andorra, monaco, san marino, switzerland, vatican city (holy see) and eea member states who were residing in italy before 16 july 2020; - british nationals and family members of british nationals who were residing in italy before 16 july 2020; - airline crew arriving from bosnia and herzegovina, kosovo (rep.), montenegro, north macedonia (rep.) and serbia. 3. residence permits issued by italy which have expired between 31 january and 31 july 2020, are considered valid until 31 august 2020. 4. passengers must present a completed self-declaration form to the transporting carrier and must communicate their entry to the department of prevention at local health units (asl) of the entrance district. - this does not apply to passengers arriving from andorra, austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), latvia, liechtenstein, lithuania, luxembourg, malta, monaco, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland or united kingdom.  5. passengers arriving in sardinia must present a completed health declaration form upon arrival. the form can be obtained at <a href=https://sus.regione.sardegna.it/sus/19/regimbarco/init>https://sus.regione.sardegna.it/sus/19/regimbarco/init</a> . 6. passengers arriving in calabria must present a completed health declaration form upon arrival. the form can be obtained at <a href=https://home.r19.it/>https://home.r19.it/</a> . 7. passengers arriving in puglia must present a completed health declaration form upon arrival. the form can be obtained at  <a href=https://www.regione.puglia.it/web/salute-sport-e-buona-vita/-/riapertura-delle-regioni-regole-per-gli-spostamenti-da-e-per-la-puglia>https://www.regione.puglia.it/web/salute-sport-e-buona-vita/-/riapertura-delle-regioni-regole-per-gli-spostamenti-da-e-per-la-puglia</a> . 8. passengers arriving in sicily must present a completed health declaration form upon arrival. the form can be obtained at <a href=https://www.lasicilia.it/userupload/moduloregione.pdf>https://www.lasicilia.it/userupload/moduloregione.pdf</a> . 9. passengers are subject to quarantine for 14 days. a list of quarantine exemptions can be found at <a href=https://www.esteri.it/mae/en/ministero/normativaonline/decreto-iorestoacasa-domande-frequenti/focus-cittadini-italiani-in-rientro-dall-estero-e-cittadini-stranieri-in-italia.html>https://www.esteri.it/mae/en/ministero/normativaonline/decreto-iorestoacasa-domande-frequenti/focus-cittadini-italiani-in-rientro-dall-estero-e-cittadini-stranieri-in-italia.html</a>. 10. flights from armenia, bahrain, bangladesh, bosnia and herzegovina, brazil, chile, dominican rep., kosovo (rep.), kuwait, moldova (rep.), montenegro, north macedonia (rep.), oman, panama, peru and serbia are suspended.  "
  },
  {
    "code":"JM",
    "iso_alpha2": "JM",
    "continent": "NA",
    "name": "Jamaica",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 15.07.2020 1. passengers must have a travel authorization obtained before departure at <a href=https://www.visitjamaica.com/>https://www.visitjamaica.com/</a> . - this does not apply to residents of jamaica.  3. residents of jamaica must have a travel authorization obtained before departure at <a href=https://jam19.moh.gov.jm/immigration.html>https://jam19.moh.gov.jm/immigration.html</a> . 4. passengers are subject to medical screening and quarantine.  "
  },
  {
    "code":"JO",
    "iso_alpha2": "JO",
    "continent": "AS",
    "name": "Jordan",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 29.07.2020  flights to jordan are suspended until 4 august 2020. - this does not apply to humanitarian, medevac and repatriation flights. effective 5 august 2020: 1. passengers are not allowed to enter. - this does not apply to: - nationals and residents of jordan; - passengers arriving from austria, canada, china (people's rep.), chinese taipei, cyprus, denmark, estonia, georgia, germany, iceland, ireland (rep.), italy, latvia, lithuania, malaysia, malta, new zealand, norway, switzerland or thailand. they must have been in one of these countries in the past 14 days. 2. passengers must have a medical certificate with a negative  () pcr test result issued at most 72 hours before arrival. another pcr test will be done on arrival. - this does not apply to passengers who are 5 years and younger.  3. passengers must have a full medical insurance coverage for the duration of their stay. - this does not apply to nationals and residents of jordan. 4. passengers must complete the electronic application form at most 24 hours before departure. they will receive a qr acceptance code. 5. airline crew are subject to quarantine until their next flight.  "
  },
  {
    "code":"JP",
    "iso_alpha2": "JP",
    "continent": "AS",
    "name": "Japan",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 24.07.2020 1. Passengers who have transited through or have been in Afghanistan, Albania, Algeria, Andorra, Antigua and Barbuda, Argentina, Armenia, Australia, Austria, Azerbaijan, Bahamas, Bahrain, Bangladesh, Barbados, Belarus, Belgium, Bolivia, Bosnia and Herzegovina, Botswana, Brazil, Brunei Darussalam, Bulgaria, Cameroon, Canada, Cape Verde, Central African Rep., Chile, China (People's Rep.), Chinese Taipei, Comoros, Congo, Congo (Dem. Rep.), Colombia, Costa Rica, Cote d'Ivoire, Croatia, Cuba, Cyprus, Czechia, Denmark, Djibouti, Dominica, Dominican Rep., Ecuador, Egypt, El Salvador, Equatorial Guinea, Estonia, Eswatini, Finland, France, Gabon, Georgia, Germany, Ghana, Greece, Grenada, Guatemala, Guinea, Guinea-Bissau, Guyana, Haiti, Honduras, Hong Kong (SAR China), Hungary, Iceland, India, Indonesia, Iran, Iraq, Ireland (Rep.), Israel, Italy, Jamaica, Kazakhstan, Kenya, Korea (Rep.), Kosovo (Rep.), Kuwait, Kyrgyzstan, Latvia, Lebanon, Liberia, Libya, Liechtenstein, Lithuania, Luxembourg, Madagascar, Macao (SAR China), Malaysia, Maldives, Malta, Mauritania, Mauritius, Mexico, Moldova (Rep.), Monaco, Montenegro, Morocco, Namibia, Nepal, Netherlands, New Zealand, Nicaragua, North Macedonia (Rep.), Norway, Oman, Pakistan, Palestinian Territory, Panama, Paraguay, Peru, Philippines, Poland, Portugal, Qatar, Romania, Russian Fed., San Marino, Sao Tome and Principe, Saudi Arabia, Senegal, Serbia, Sierra Leone, Singapore, Slovakia, Slovenia, Somalia, South Africa, Spain, St. Kitts and Nevis, St. Vincent and the Grenadines, Sudan, Suriname, Sweden, Switzerland, Tajikistan, Thailand, Turkey, Uruguay, USA, Ukraine, United Arab Emirates, United Kingdom, Uzbekistan, Vatican City (Holy See), Venezuela or Viet Nam in the past 14 days are not allowed to enter. -This does not apply to: - nationals of Japan; - spouses or children of nationals of Japan if they can prove it; - residents of Japan with “Permanent Resident, Spouse or Child of Japanese National, Spouse or Child of Permanent Resident or Long Term Resident, who have departed Japan with Re-entry Permission by 2 April 2020; - residents of Japan with “Permanent Resident, Spouse or Child of Japanese National, Spouse or Child of Permanent Resident or Long Term Resident, who have departed Japan with Re-entry Permission between 3 April and 28 April 2020 and have only been in Afghanistan, Antigua and Barbuda, Argentina, Azerbaijan, Bahamas, Bangladesh, Barbados, Belarus, Cape Verde, Colombia, Djibouti, Dominican Rep., El Salvador, Equatorial Guinea, Gabon, Ghana, Guinea, Guinea Bissau, Honduras, India, Kazakhstan, Kuwait, Kyrgyzstan, Mexico, Maldives, Oman, Pakistan, Peru, Qatar, Russian Fed., Sao Tome and Principe, Saudi Arabia, South Africa, St. Kitts and Nevis, Tajikistan, United Arab Emirates, Ukraine or Uruguay; - residents of Japan with “Permanent Resident, Spouse or Child of Japanese National, Spouse or Child of Permanent Resident or Long Term Resident, who have departed Japan with Re-entry Permission between 29 April and 15 May 2020 and have only been in Afghanistan, Argentina, Azerbaijan, Bahamas, Bangladesh, Cape Verde, Colombia, El Salvador, Equatorial Guinea, Gabon, Ghana, Guinea, Guinea Bissau, Honduras, India, Kazakhstan, Kyrgyzstan, Mexico, Maldives, Pakistan, South Africa, Sao Tome and Principe, Tajikistan or Uruguay; - residents of Japan with “Permanent Resident, Spouse or Child of Japanese National, Spouse or Child of Permanent Resident or Long Term Resident, who have departed Japan with Re-entry Permission between 16 May and 26 May 2020 and have only been in Afghanistan, Argentina, Bangladesh, El Salvador, Ghana, Guinea, India, Kyrgyzstan, Pakistan, South Africa or Tajikistan; - residents of Japan with “Permanent Resident, Spouse or Child of Japanese National, Spouse or Child of Permanent Resident or Long Term Resident, who have departed Japan with Re-entry Permission between 27 May and 30 June 2020 and have only been in Algeria, Cameroon, Central African Rep., Costa Rica, Cuba, Eswatini, Georgia, Grenada, Guatemala, Guyana, Haiti, Iraq, Jamaica, Lebanon, Mauritania, Nicaragua, Senegal or St. Vincent and the Grenadines; - residents of Japan with “Permanent Resident, Spouse or Child of Japanese National, Spouse or Child of Permanent Resident or Long Term Resident, who have departed Japan with Re-entry Permission between 1 July and 23 July 2020 and have only been in Botswana, Comoros, Congo, Kenya, Liberia, Libya, Madagascar, Namibia, Nepal, Palestine, Paraguay, Sierra Leone, Somalia, Sudan, Suriname, Uzbekistan or Venezuela; - passengers with a Special Permanent Residence Permit. However, they must have a Re-entry Permit from a regional immigration officer; - US military personnel; - civilian personnel of the US armed forces in Japan and their dependents. 2. A completed Quarantine Questionnaire must be presented upon arrival. 3. Passengers and airline crew are subject to medical screening. 4. Visa exemption for passengers with passengers with a British passport, Hong Kong (SAR China) passport, Macao (SAR China) passport is suspended. 5. Visa exemption for nationals of Andorra, Argentina, Austria, Bahamas, Barbados, Belgium, Brunei Darussalam, Bulgaria, Costa Rica, Croatia, Czechia, Cyprus, Denmark, Dominican Rep., El Salvador, Estonia, Finland, France, Germany, Greece, Guatemala, Honduras, Hungary, Iceland, Indonesia, Iran, Ireland (Rep.), Israel, Italy, Korea (Rep.), Latvia, Lesotho, Liechtenstein, Lithuania, Luxembourg, Malaysia, Malta, Mexico, Monaco, Netherlands, Norway, Peru, Poland, Portugal, Romania, San Marino, Singapore, Slovakia, Slovenia, Spain, Suriname, Sweden, Switzerland, Thailand, Tunisia, United Arab Emirates, Uruguay and Vatican City (Holy See) is suspended. 6. Visa exemption for nationals of Azerbaijan, Bangladesh, Cambodia, Colombia, Georgia, India, Kazakhstan, Lao People's Dem. Rep., Mongolia, Myanmar, Nauru, Oman, Pakistan, Palau, Papua New Guinea, Paraguay, Qatar, Samoa, Solomon Isl., Turkmenistan, Ukraine, Uzbekistan and Viet Nam with a diplomatic, official or service passport is suspended. 7. Visa exemption granted to passengers with an APEC Business Travel Card issued by Brunei Darussalam, China (People's Rep.), Hong Kong (SAR China), Indonesia, Korea (Rep.), Malaysia, Mexico, Papua New Guinea, Peru, Philippines, Russian Fed., Singapore, Thailand or Viet Nam, is suspended. 8. Nationals of China (People's Rep.) with a passport issued in Hubei Province or Zhejiang Province (China People's Rep.) are not allowed to enter Japan.  - This does not apply when passengers can prove that they have not been in Hubei Province and Zhejiang Province the last 14 days.  9. Passengers who were in the cruise ship 'Westerdam' are not allowed to enter Japan. - This does not apply to nationals of Japan.  10. Visas issued on or before 8 March 2020 by the Embassies, Consulates-General and Consulate of Japan in China (People's Rep.), Hong Kong (SAR China), Korea (Rep.) or Macao (SAR China) are invalidated. 11. Visas issued on or before 20 March 2020 by the Embassies, Consulates-General and Consulate of Japan in Andorra, Austria, Belgium, Bulgaria, Croatia, Czechia, Cyprus, Denmark, Egypt, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland, United Kingdom or Vatican City (Holy See) are invalidated.  12. Visas issued on or before 27 March 2020 by the Embassies, Consulates-General and Consulate of Japan in Bahrain, Brunei Darussalam, Congo (Dem. Rep.), Indonesia, Israel, Malaysia, Philippines, Qatar, Singapore, Thailand or Viet Nam are invalidated.  13. Visas issued on or before 2 April 2020 by the Embassies, Consulates-General and Consulate of Japan in Afghanistan, Algeria, Angola, Antigua and Barbuda, Argentina, Azerbaijan, Bahamas, Bangladesh, Barbados, Belarus, Belize, Benin, Bhutan, Botswana, Burkina Faso, Burundi, Cambodia, Cameroon, Cape Verde, Central African Rep., Chad, Colombia, Comoros, Congo, Cook Isl., Costa Rica, Cuba, Djibouti, Dominican Rep., El Salvador, Equatorial Guinea, Eritrea, Eswatini (Swaziland), Ethiopia, Fiji, Gabon, Gambia, Georgia, Ghana, Grenada, Guatemala, Guinea, Guinea-Bissau, Guyana, Haiti, Honduras, India, Iraq, Jamaica, Jordan, Kazakhstan, Kenya, Kiribati, Kyrgyzstan, Kuwait, Lao People's Dem. Rep., Lebanon, Lesotho, Liberia, Libya, Madagascar, Malawi, Maldives, Mali, Marshall Isl., Mauritania, Mexico, Micronesia (Federated States), Mongolia, Mozambique, Myanmar, Namibia, Nauru, Nepal, Nicaragua, Niger, Nigeria, Niue, Oman, Pakistan, Palau, Palestinian Territory, Papua New Guinea, Paraguay, Peru, Russian Fed., Rwanda, Samoa, Sao Tome and Principe, Saudi Arabia, Senegal, Seychelles , Sierra Leone, Solomon Isl., Somalia, South Africa, South Sudan, Sri Lanka, St. Kitts and Nevis, St. Lucia, St. Vincent and the Grenadines, Sudan, Suriname, Syria, Tajikistan, Tanzania, Timor-Leste, Togo, Tonga, Trinidad and Tobago, Tunisia, Turkmenistan, Tuvalu, Uganda, Ukraine, United Arab Emirates, Uruguay, Uzbekistan, Vanuatu, Venezuela, Yemen, Zambia or Zimbabwe are invalidated. 14. Passengers transiting through Tokyo (NRT) must transit on the same calendar day.  "
  },
  {
    "code":"KE",
    "iso_alpha2": "KE",
    "continent": "AF",
    "name": "Kenya",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 08.07.2020  1. Flights to Kenya are suspended. - This does not apply to humanitarian, medevac repatriation and medevac flights. 2. Passengers are subject to quarantine at their own expense.  3. Airline crew are subject to self-isolation for the duration of their rest period.  "
  },
  {
    "code":"KG",
    "iso_alpha2": "KG",
    "continent": "AS",
    "name": "Kyrgyzstan",
    "score": "2.6 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 20.03.2020  Flights to Kyrgyzstan are suspended.  "
  },
  {
    "code":"KH",
    "iso_alpha2": "KH",
    "continent": "AS",
    "name": "Cambodia",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 02.07.2020 1. all visa exemptions, visas on arrival and e-visas are suspended. - this does not apply to passengers with a diplomatic visa (visa a) or an official visa (visa b) issued by cambodia.  2. passengers must have a medical certificate with a negative  () test result issued at most 72 hours before arrival. - this does not apply to nationals of cambodia. - this does not apply to passengers with a diplomatic visa (visa a) or an official visa (visa b) issued by cambodia. 3. passengers must have a proof of insurance policy with a minimum value of usd 50,000. they must deposit usd 3,000 at a designated bank on arrival. - this does not apply to nationals of cambodia.  - this does not apply to passengers with a diplomatic visa (visa a) or an official visa (visa b) issued by cambodia. - this does not apply to nationals of cambodia with a foreign passport and a visa k entry permit issued by cambodia. 4. passengers are subject to medical screening and quarantine for 14 days.  "
  },
  {
    "code":"KI",
    "iso_alpha2": "KI",
    "continent": "OC",
    "name": "Kiribati",
    "score": "2.5 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 07.07.2020  Tarawa (TRW) is closed.  "
  },
  {
    "code":"KM",
    "iso_alpha2": "KM",
    "continent": "AF",
    "name": "Comoros",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 12.06.2020  1. flights to comoros are suspended. 2. passengers must have a medical certificate with a negative  () test result issued before arrival.  "
  },
  {
    "code":"KN",
    "iso_alpha2": "KN",
    "continent": "NA",
    "name": "Saint Kitts and Nevis",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 12.04.2020 Airports in St. Kitts and Nevis are closed.  "
  },
  {
    "code":"KP",
    "iso_alpha2": "KP",
    "continent": "AS",
    "name": "North Korea",
    "score": "4.3 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 06.02.2020  1. Passengers traveling as tourists are not allowed to enter.  2. Passengers traveling on business or duty must spend 14 days in quarantine upon arrival.  "
  },
  {
    "code":"KR",
    "iso_alpha2": "KR",
    "continent": "AS",
    "name": "South Korea",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 24.07.2020 1. short-term visas (type c-1 and c-3) issued on or before 5 april are no longer valid. 2. visa exemptions for 90 nationalities with a normal passport are temporarily suspended. - this does not apply to airline crew. - this does not apply to passengers with an apec business travel card.  3. korean visas issued by the wuhan consulate in the hubei province are no longer valid. 4. visitors who have been in the hubei province (china people's rep.) in the past 14 days are not allowed to transit or enter korea (rep.).  5. nationals of china (people’s rep.) with a passport issued in the hubei province are not allowed to transit or enter korea (rep.). 6. passengers arriving from china (people's rep) must have a visa issued by korea (rep.) to transit through korea (rep.).  - this does not apply to nationals of albania, andorra, barbados, dominica, guyana, ireland (rep.), korea (rep.), malta, mexico, monaco, nicaragua, palau, san marino, slovenia, st. kitts and nevis, st. vincent and the grenadines, usa, vatican city (holy see) and venezuela.  - this does not apply to passengers with a british passport. - this does not apply to passengers with a diplomatic, consular, official, service or special passport. 7. passengers are subject to quarantine for 14 days and to a pcr test for  (). - this does not apply to nationals of china (people's rep.) traveling on business under the fast lane program and their accompanying family members. they must: - self-monitor their health conditions minimum 14 days before departure and hold a medical certificate to prove  () negative testing result issued at most 72 hours before departure, and - be tested on  () upon arrival. they must stay at designated quarantine facilities for 1 or 2 days until a negative test result is obtained. 8. nationals and residents of korea (rep.) are required to install 'self-quarantine safety protection mobile app'.  9. passengers and airline crew must install 'self-diagnosis mobile app' in their personal device and a completed health declaration form and a special quarantine declaration form must be presented to the quarantine desk upon arrival. 10. all flights must arrive at incheon international airport (icn) between 5:00 and 20:00. 11. passengers with a re-entry permit issued by korea (rep.) who left korea (rep.) after 1 june 2020 must have a medical certificate. the certificate must: - be issued by a local authorized medical institute at most 48 hours before departure; and - be written in english or korean; and  - include the date of examination, and the presence or absence of fever, cough, chills, headache, difficulty of breathing, muscle pain and pulmonary symptoms; and  - be signed by a medical examiner. - this does not apply to passengers with status diplomats (a-1), government officials (a-2, a-3) or overseas korean (f-4). 12. nationals of mongolia are not allowed to transit if they depart from mongolia or travel onward to mongolia.  - this does not apply to airline crew. 13. nationals of russian fed. are not allowed to transit if they depart from russian fed. or travel onward to russian fed.  - this does not apply to airline crew. 14. nationals of thailand are not allowed to transit if they depart from thailand or travel onward to thailand.  - this does not apply to airline crew. 15. passengers with a visa on an expired passport must present a printed visa grant notice and the expired passport to the immigration upon arrival. 16. passengers who have been in bangladesh, kazakhstan, kyrgyzstan, pakistan, philippines or uzbekistan in the past 14 days must have a medical certificate with a negative  () pcr test result issued at most 48 hours before departure. the certificate must be in english. - this does not apply to nationals of korea (rep.). 17. merchant seamen with a visa must have a medical certificate with a negative  () pcr test result issued at most 48 hours before departure. the certificate must be in english and the passengers must have two copies of the certificate.  "
  },
  {
    "code":"KW",
    "iso_alpha2": "KW",
    "continent": "AS",
    "name": "Kuwait",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 27.07.2020 Passengers are not allowed to enter. -This does not apply to: - nationals of Kuwait and their first degree family members. They must have a OK TO TRAVEL authorization obtained from the state of Kuwait embassy; - passengers with a residence permit issued by the Ministry of Health in Kuwait, and their first degree family members; - passengers with an expired residence permit issued under the sponsorship of the Ministry of Health in Kuwait, and their first degree family members; - domestic workers if accompanied by a national of Kuwait. They must have a OK TO TRAVEL authorization obtained from the state of Kuwait embassy; - passengers with a diplomatic passport or UN passport, members of UNESCO with prior approval from the government authorities.  "
  },
  {
    "code":"KY",
    "iso_alpha2": "KY",
    "continent": "NA",
    "name": "Cayman Islands",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 14.05.2020 Flights to Grand Cayman (GCM) are suspended. - This does not apply to emergency, repatriation and Medevac flights. They must obtain a prior approval from the Civil Aviation in Cayman Isl.  "
  },
  {
    "code":"KZ",
    "iso_alpha2": "KZ",
    "continent": "AS",
    "name": "Kazakhstan",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 15.07.2020  1. airports are closed for international flights. - this does not apply to flights arriving from china (people's rep.), georgia, japan, korea (rep.), thailand or turkey. - this does not apply to repatriation and evacuation flights. - this does not apply to flights of airlines of kazakhstan. 2. passengers are not allowed to transit or enter kazakhstan. - this does not apply to: - nationals and residents of kazakhstan; - passengers arriving from china (people's rep.), georgia, japan, korea (rep.), thailand or turkey; - spouses of nationals of kazakhstan; - passengers with a birth certificate stating kazakhstan as a place of birth; - passengers traveling on business to tengiz field. 3 . passengers arriving from turkey must: - have a medical certificate stating a negative  () test result issued at most 5 days before arrival; or - be tested for  () at most 48 hours after arrival.  "
  },
  {
    "code":"LA",
    "iso_alpha2": "LA",
    "continent": "AS",
    "name": "Laos",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 02.07.2020 1. flights to lao people's dem. rep. are suspended until 31 july 2020. - this does not apply to humanitarian, medevac and repatriation flights. 2. passengers must have a medical certificate with a negative  () test result issued at most 72 hours before departure. 3. a completed health declaration form must be presented upon arrival.  4. passengers are subject to medical screening and quarantine for 14 days.  5. airline crew are subject to medical screening and quarantine until their next flight.   "
  },
  {
    "code":"LB",
    "iso_alpha2": "LB",
    "continent": "AS",
    "name": "Lebanon",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 23.07.2020  1. flights to lebanon restarted. 2. passengers must have a medical certificate with a negative  () pcr test result issued at most 96 hours before arrival. - this does not apply to passengers younger than 12 years.  3. passengers without a medical certificate with a negative  () pcr test result are subject to medical screening. - this does not apply to passengers younger than 12 years. 4. passengers transiting through beirut (bey) to syria must have a medical certificate with a negative  () pcr test result issued at most 96 hours before departure. - this does not apply to passengers younger than 12 years.  5. passengers transiting through beirut (bey) to syria must have a pre-approval from the syrian authorities. - this does not apply to nationals of syria.  - this does not apply to passengers with a travel document for palestinian refugees (document de voyage pour les refugies palestiniens) issued by syria. 6. a health declaration form must be completed online at <a href=https://arcg.is/0gadng>https://arcg.is/0gadng</a> .  "
  },
  {
    "code":"LC",
    "iso_alpha2": "LC",
    "continent": "NA",
    "name": "Saint Lucia",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 14.07.2020 1. airports in st. lucia reopened. 2. a completed pre-arrival registration form must be presented upon arrival. the form can be obtained at <a href=https://www.stlucia.org/en//>https://www.stlucia.org/en//</a> .  3. passengers must have a medical certificate with a negative  () pcr test result issued at most 7 days before departure.  - this does not apply to passengers arriving from anguilla, antigua and barbuda, aruba, bahamas, barbados, bermuda, bonaire, st. eustatius and saba, curacao, dominica, grenada, montserrat, st. barthelemy, st. kitts and nevis, st. maarten, st. vincent and grenadines, trinidad and tobago, turks and caicos isl. or virgin isl. (british). 4. passengers arriving without a medical certificate with a negative  () pcr test result are subject to medical screening and quarantine at their own cost.  - this does not apply to passengers arriving from anguilla, antigua and barbuda, aruba, bahamas, barbados, bermuda, bonaire, st. eustatius and saba, curacao, dominica, grenada, montserrat, st. barthelemy, st. kitts and nevis, st. maarten, st. vincent and grenadines, trinidad and tobago, turks and caicos isl. or virgin isl. (british). 5. airline crew are subject to medical screening.  "
  },
  {
    "code":"LI",
    "iso_alpha2": "LI",
    "continent": "EU",
    "name": "Liechtenstein",
    "score": "2.8 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 03.06.2020 1. Passengers are not allowed to enter. - This does not apply to nationals or residents of Switzerland or Liechtenstein. - This does not apply to passenger with a cross-border commuter permit who are entering Switzerland for work, with a C-visa issued by Switzerland for the purpose of business meetings as specialists in the field of health or official visit of great importance, with a D-visa issued by Switzerland or who have an assurance of a residence permit. - This does not apply to passengers traveling directly through Switzerland, provided that there are no reasons to believe that the country towards which they intend to leave Switzerland will refuse entry.  - This does not apply to passengers who have to travel to their place of work abroad, provided they can present a valid employment contract.  - This does not apply to passengers who are already legally residing within the EU/EFTA area and that are travelling for tourist purposes, provided that they can credibly demonstrate that they actually want to/can enter the destination country, e.g. by presenting a hotel booking, holiday apartment, etc.  - This does not apply to passengers who are entitled to freedom of movement (citizens of EU/EFTA-states) and have a professional reason for entering Switzerland and have a confirmation of registration. - This does not apply to passengers who are of great importance as specialists in the health sector. 2. Until and including 07.06.2020, passengers can only land at Basel (BSL), Geneva (GVA) or Zurich (ZRH).  "
  },
  {
    "code":"LK",
    "iso_alpha2": "LK",
    "continent": "AS",
    "name": "Sri Lanka",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 15.07.2020 1. Airports in Sri Lanka are closed. - This does not apply to humanitarian flights to Colombo (CMB). 2. Passengers and airline crew are subject to medical screening and self-quarantine. - This does not apply to airline crew who do not disembark the aircraft. 3. A completed Health Declaration Form must be presented upon arrival.  "
  },
  {
    "code":"LR",
    "iso_alpha2": "LR",
    "continent": "AF",
    "name": "Liberia",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 30.06.2020 1. flights to liberia restarted. 2. passengers are subject to medical screening and quarantine. - this does not apply to passengers with a medical certificate with a negative  () test result.  "
  },
  {
    "code":"LS",
    "iso_alpha2": "LS",
    "continent": "AF",
    "name": "Lesotho",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 29.04.2020 passengers will be tested for  () and placed in quarantine for 14 days.  "
  },
  {
    "code":"LT",
    "iso_alpha2": "LT",
    "continent": "EU",
    "name": "Lithuania",
    "score": "2.7 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 17.07.2020 1. Passengers are not allowed to enter. -This does not apply to: - nationals and residents of Lithuania; - nationals of EEA Member States and Switzerland, if arriving from Austria, Belgium, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Malta, Netherlands, Norway, Poland, Slovakia, Slovenia, Spain or Switzerland; - British nationals if arriving from Austria, Belgium, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Malta, Netherlands, Norway, Poland, Slovakia, Slovenia, Spain or Switzerland; - residents of EEA Member States, Switzerland and United Kingdom, if arriving from Austria, Belgium, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Malta, Netherlands, Norway, Poland, Slovakia, Slovenia, Spain or Switzerland; - <span>residents of Algeria, Australia, Canada, Georgia, Japan, Korea (Rep.), Montenegro, Morocco, New Zealand, Rwanda, Serbia, Thailand, Tunisia and Uruguay; - family members of nationals of Lithuania; - family members of permanent residents of Lithuania; - NATO personnel and personnel working for them and their family members; - merchant seamen. 2. Passengers must arrive at Vilnius (VNO), Kaunas (KUN), Palanga (PLQ) or Siauliai (SQQ). 3. Passengers are subject to self-isolation for 14 days. A list of self-isolation exemptions can be found at <a href=http://sam.lrv.lt/en/news/prevenciniai-veiksmai-del-naujojo-koronaviruso-informacija-nuolat-papildoma/koronavirusas/operaciju-vadovo-sprendimai>http://sam.lrv.lt/en/news/prevenciniai-veiksmai-del-naujojo-koronaviruso-informacija-nuolat-papildoma/koronavirusas/operaciju-vadovo-sprendimai</a>.</span><span>   </span>"
  },
  {
    "code":"LU",
    "iso_alpha2": "LU",
    "continent": "EU",
    "name": "Luxembourg",
    "score": "2.8 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 06.07.2020 1. Passengers are not allowed to enter. - This does not apply to: - British nationals and nationals of Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland and Vatican City (Holy See); - passengers arriving from Austria, Belgium, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Italy, Latvia, Liechtenstein, Lithuania, Malta, Netherlands, Norway, Poland, Portugal, Slovakia, Slovenia, Spain, Sweden or Switzerland; - passengers with a long-term residence permit issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Ireland (Rep.), Italy, Latvia, Lithuania, Luxembourg, Malta, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden or the United Kingdom;  - residents of Algeria, Australia, Canada, Georgia, Japan, Korea (Rep.), Montenegro, Morocco, New Zealand, Rwanda, Serbia, Thailand, Tunisia and Uruguay; - passengers with a long-term D visa issued by a Schengen Member State; - family members of a national of Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland or Vatican City (Holy See); - family members of British nationals; - military personnel; - merchant seamen;  - passengers traveling to study.  "
  },
  {
    "code":"LV",
    "iso_alpha2": "LV",
    "continent": "EU",
    "name": "Latvia",
    "score": "2.7 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 23.07.2020 1. passengers are not allowed to enter and transit latvia. -this does not apply to: - nationals and residents of switzerland and eea member states;  - british nationals and residents of the united kingdom; - nationals of andorra, monaco, montenegro, north macedonia (rep.), san marino, serbia, and vatican city (holy see); - residents of algeria, australia, canada, georgia, japan, korea (rep.), montenegro, morocco, new zealand, rwanda, serbia, thailand, tunisia and uruguay;  - merchant seamen. 2. passengers are subject to quarantine for 14 days upon arrival. a list of quarantine exemptions can be found at <a href=http://www.spkc.gov.lv/lv/valstu-saslimstibas-raditaji-ar--0/17.07.2020_en_1.pdf>www.spkc.gov.lv/lv/valstu-saslimstibas-raditaji-ar--0/17.07.2020_en_1.pdf</a>   "
  },
  {
    "code":"LY",
    "iso_alpha2": "LY",
    "continent": "AF",
    "name": "Libya",
    "score": "5 (Extreme Warning)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 07.07.2020 Flights to Libya are suspended. - This does not apply to repatriation and medevac flights.  "
  },
  {
    "code":"MA",
    "iso_alpha2": "MA",
    "continent": "AF",
    "name": "Morocco",
    "score": "3.1 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 10.07.2020  Flights to Morocco are suspended.  "
  },
  {
    "code":"MC",
    "iso_alpha2": "MC",
    "continent": "EU",
    "name": "Monaco",
    "score": "2.3 (Low Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 02.06.2020 1. passengers arriving from a non-schengen member state are not allowed to enter france. - this does not apply to: - nationals of france, their spouses and children; - nationals of andorra, monaco, san marino, switzerland, vatican city (holy see) and an eea member state, their spouses and children, on their way home; - british nationals, their spouses and children, on their way home; - passengers with a residence permit issued by france; - passengers with a residence permit issued by andorra, monaco, san marino, switzerland, united kingdom, vatican city (holy see) or an eea member state, on their way home; - healthcare professionals and researchers related to  ();  - personnel of diplomatic and consular missions and international organizations headquartered or having an office in france, their spouses and children; - merchant seamen. 2. a completed international travel certificate must be presented prior to boarding and to immigration upon arrival or when transiting france. the certificate must be obtained before departure via the french consular offices abroad or online at <a target=_blank href=https://www.interieur.gouv.fr>https://www.interieur.gouv.fr</a>. 3. passengers are subject to quarantine or isolation. 4. passengers must complete a declaration on honor to state that they do not have symptoms of  (). the declaration must be dated with the name and signature of the passenger.  "
  },
  {
    "code":"MD",
    "iso_alpha2": "MD",
    "continent": "EU",
    "name": "Moldova",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 14.07.2020  1. Passengers are not allowed to enter until 1 August 2020. - This does not apply to: - nationals of Moldova (Rep.) and their family members; - passengers with a residence permit or a long-stay visa issued by Moldova (Rep.). 2. Passengers are subject to self-isolation for 14 days.  "
  },
  {
    "code":"ME",
    "iso_alpha2": "MF",
    "continent": "NA",
    "name": "Saint Martin",
    "score": "4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 22.07.2020 1. passengers are not allowed to enter.  - this does not apply to nationals and residents of montenegro.  - this does not apply to passengers who have been in albania, algeria, andorra, australia, austria, bahamas, barbados, belarus, belgium, bosnia and herzegovina, brunei darussalam, bulgaria, cambodia, canada, china (people's rep.), costa rica, croatia, cuba, cyprus, czechia, denmark, estonia, fiji, finland, france, georgia, germany, greece, hungary, iceland, indonesia, ireland (rep.), israel, italy, jamaica, japan, jordan, korea (rep.), kosovo (rep.), latvia, lebanon, liechtenstein, lithuania, luxembourg, madagascar, malaysia, malta, mauritius, mongolia, morocco, mozambique, netherlands, new zealand, nicaragua, norway, palestinian territory, papua new guinea, paraguay, philippines, poland, portugal, romania, senegal, seychelles, singapore, slovakia, slovenia, spain, sweden, switzerland, tajikistan, thailand, trinidad and tobago, tunisia, turkey, ukraine, united arab emirates, united kingdom, uruguay, uzbekistan, venezuela, viet nam or zambia in the past 15 days.  2. nationals and residents of montenegro are subject to self-isolation for 14 days.  - this does not apply to passengers who have been in algeria, andorra, australia, austria, bahamas, barbados, belarus, belgium, brunei darussalam, bulgaria, cambodia, china (people's rep.), costa rica, croatia, cuba, cyprus, czechia, denmark, estonia, fiji, finland, france, georgia, germany, greece, hungary, iceland, indonesia, ireland (rep.), italy, jamaica, japan, jordan, korea (rep.), latvia, lebanon, liechtenstein, lithuania, luxembourg, madagascar, malaysia, malta, mauritius, mongolia, morocco, mozambique, netherlands, new zealand, nicaragua, norway, palestinian territory, papua new guinea, paraguay, philippines, poland, portugal, romania, senegal, seychelles, slovakia, slovenia, spain, sweden, switzerland, tajikistan, thailand, trinidad and tobago, tunisia, turkey, ukraine, united arab emirates, united kingdom, uruguay, uzbekistan, venezuela, viet nam or zambia in the past 15 days.  - this does not apply to passengers younger than 5 years who have been in albania, bosnia and herzegovina, canada, israel, kosovo (rep.) or singapore in the past 15 days.  - this does not apply to passengers older than 5 years who have been in albania, bosnia and herzegovina, canada, israel, kosovo (rep.) or singapore in the past 15 days and have a medical certificate stating a negative  () test result issued at most 72 hours before arrival.  3. passengers who have been in albania, bosnia and herzegovina, canada, israel, kosovo (rep.) or singapore in the past 15 days must have a medical certificate with a negative  () test result issued at most 72 hours before arrival. - this does not apply to passengers younger than 5 years.  "
  },
  {
    "code":"MG",
    "iso_alpha2": "MG",
    "continent": "AF",
    "name": "Madagascar",
    "score": "3.1 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 20.04.2020 Flights to Madagascar are suspended.  "
  },
  {
    "code":"MH",
    "iso_alpha2": "MH",
    "continent": "OC",
    "name": "Marshall Islands",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 03.04.2020  Passengers are not allowed to enter Marshall Isl.  "
  },
  {
    "code":"MK",
    "iso_alpha2": "MK",
    "continent": "EU",
    "name": "Macedonia",
    "score": "2.3 (Low Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 01.07.2020  () entry regulations lifted on 1 july 2020.  "
  },
  {
    "code":"ML",
    "iso_alpha2": "ML",
    "continent": "AF",
    "name": "Mali",
    "score": "4.7 (Extreme Warning)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 28.07.2020 1. passengers must have a medical certificate with a negative  () pcr test result issued at most 3 days before arrival.  2. passengers are subject to quarantine for 14 days.   "
  },
  {
    "code":"MM",
    "iso_alpha2": "MM",
    "continent": "AS",
    "name": "Myanmar",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 29.06.2020 1. Visa issuance is suspended. 2. Flights to Myanmar are suspended until 31 July 2020. - This does not apply to relief flights. - This does not apply to medical evacuation flights. - This does not apply to special flights approved by the Department of Civil Aviation. 3. Airline crew are subject to quarantine until their next departure flight.  "
  },
  {
    "code":"MN",
    "iso_alpha2": "MN",
    "continent": "AS",
    "name": "Mongolia",
    "score": "4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 16.07.2020  1. Passengers are not allowed to enter Mongolia until 31 July 2020. - This does not apply to nationals of Mongolia.  - This does not apply to residents of Mongolia who are direct family members of nationals of Mongolia. 2. Nationals of Mongolia are subject to quarantine for 21 days at designated facilities. They are also subject to self-isolation for an additional 14 days.  3. Residents of Mongolia who are direct family members of nationals of Mongolia are subject to quarantine for 21 days at designated facilities. They are also subject to self-isolation for an additional 14 days.  "
  },
  {
    "code":"MO",
    "iso_alpha2": "MO",
    "continent": "AS",
    "name": "Macao",
    "score": "2.7 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 27.07.2020 1. passengers are not allowed to enter macao sar, china. -this does not apply to: - residents of macao sar, china; - residents of the mainland of china if they have not been outside the mainland of china, chinese taipei, hong kong sar, china and macao sar, china in the past 14 days; - residents of chinese taipei or hong kong sar, china if they have not been outside the mainland of china, chinese taipei, hong kong sar, china and macao sar, china in the past 14 days. 2. passengers must have a medical certificate with a negative  () nucleic acid test result issued at most 7 days before arrival.  - this does not apply to residents of macao sar, china who have been outside the mainland of china, chinese taipei, hong kong sar, china and macao sar, china in the past 14 days. 3. passengers are subject to quarantine for 14 days.  "
  },
  {
    "code":"MP",
    "iso_alpha2": "MQ",
    "continent": "NA",
    "name": "Martinique",
    "score": "4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 09.07.2020 1. passengers arriving in northern mariana isl.: - must complete a declaration form online at <a target=_blank href=http://www.governor.gov.mp//travel>http://www.governor.gov.mp//travel</a> at least 3 days before arrival; and - are subject to medical screening and self-isolation; and - must have a medical certificate with a negative  () pcr result issued within 3 and 6 days before arrival. the certificate must be in english. 2. passengers arriving without a proof of a  () pcr test are subject to quarantine for 5 days.  "
  },
  {
    "code":"MR",
    "iso_alpha2": "MR",
    "continent": "AF",
    "name": "Mauritania",
    "score": "3.7 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 24.07.2020 1. All airports in Mauritania are closed. - This does not apply to repatriation flights. 2. Passengers and airline crew are not allowed to enter. - This does not apply to: - nationals and residents of Mauritania; - airline crew of Mauritania Airlines.  "
  },
  {
    "code":"MS",
    "iso_alpha2": "MS",
    "continent": "NA",
    "name": "Montserrat",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 22.07.2020 1. Passengers are not allowed to enter Montserrat. -This does not apply to: - passengers with a British passport with nationality British Overseas Territories Citizen issued by Montserrat; - passengers with a permanent residence permit issued by Montserrat; - husband, wife, child or other dependents of a passenger with a British passport with nationality British Overseas Territories Citizen issued by Montserrat; - husband, wife, child or other dependents of a person residing in Montserrat. 2. Passengers are subject to medical screening and self-quarantine for 14 days.  "
  },
  {
    "code":"MT",
    "iso_alpha2": "MT",
    "continent": "EU",
    "name": "Malta",
    "score": "2.6 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 14.07.2020 1. Passengers are not allowed to enter until 31 August 2020. - This does not apply to: - nationals and residents of Malta. - passengers arriving from Andorra, Australia, Austria, Belgium, Bulgaria, Canada, China (People's Rep.), Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Indonesia, Ireland (Rep.), Italy, Japan, Jordan, Korea (Rep.), Latvia, Lebanon, Liechtenstein, Lithuania, Luxembourg, Monaco, Morocco, Netherlands, New Zealand, Norway, Poland, Portugal, Romania, Rwanda, San Marino, Slovakia, Slovenia, Spain, Switzerland, Thailand, Tunisia, Turkey, United Arab Emirates, United Kingdom, Uruguay or Vatican City (Holy See). They must have been in any of these countries for at least 14 days before departure. - passengers arriving on humanitarian, medevac or repatriation flights.  2. Passengers and airline crew are subject to self-quarantine for 14 days. - This does not apply to passengers arriving from Andorra, Australia, Austria, Belgium, Bulgaria, Canada, China (People's Rep.), Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Indonesia, Ireland (Rep.), Italy, Japan, Jordan, Korea (Rep.), Latvia, Lebanon, Liechtenstein, Lithuania, Luxembourg, Monaco, Morocco, Netherlands, New Zealand, Norway, Poland, Portugal, Romania, Rwanda, San Marino, Slovakia, Slovenia, Spain, Switzerland, Thailand, Tunisia, Turkey, United Arab Emirates, United Kingdom, Uruguay or Vatican City (Holy See). 3. A completed Public Health Passenger Locator Form must be presented upon arrival.  "
  },
  {
    "code":"MU",
    "iso_alpha2": "MU",
    "continent": "AF",
    "name": "Mauritius",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 18.06.2020  1. Passengers are not allowed to enter and transit until 31 August 2020. - This does not apply to nationals or residents of Mauritius, their spouses and children. They are subject to quarantine. 2. Airline crew are subject to quarantine until their next flight.  "
  },
  {
    "code":"MV",
    "iso_alpha2": "MV",
    "continent": "AS",
    "name": "Maldives",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 16.07.2020 1. Visa on arrival facility restarted. 2. Passengers traveling as tourists must have a hotel reservation confirmation for the entire stay in a registered tourist facility.  3. Passengers and airline crew are subject to medical screening. 4. Passengers must complete a self-declarative health declaration 24 hours before arrival at <a href=https://imuga.immigration.gov.mv/>https://imuga.immigration.gov.mv/</a> .  "
  },
  {
    "code":"MW",
    "iso_alpha2": "MW",
    "continent": "AF",
    "name": "Malawi",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 28.04.2020 1. Passengers are not allowed to enter Malawi. - This does not apply to nationals of Malawi. - This does not apply to passengers who reside in Malawi.  2. Nationals and residents of Malawi are required to self-isolate. They will be monitored by health personnel.  "
  },
  {
    "code":"MX",
    "iso_alpha2": "MX",
    "continent": "NA",
    "name": "Mexico",
    "score": "3.6 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 19.06.2020 A completed Cuestionario de indentificacion de factores de riesgo en viajeros must be presented to immigration upon arrival. The form can be found at <a href=https://afac.hostingerapp.com/>https://afac.hostingerapp.com/</a> .  "
  },
  {
    "code":"MY",
    "iso_alpha2": "MY",
    "continent": "AS",
    "name": "Malaysia",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 27.07.2020 1. Passengers are not allowed to enter Malaysia until 31 August 2020. - This does not apply to: - nationals of Malaysia; - permanent residents of Malaysia with a MyPR card; - passengers with a sticker label visa in their passport specifying that they are spouses or children of nationals of Malaysia; - passengers with a Malaysia My Second Home (MM2H) with a printed entry permission from Ministry of Tourism, Arts and Culture; - passengers with a diplomatic passport; - passengers with an official passport on a diplomatic mission; - students with an immigration approval. 2. Passengers arriving in Malaysia: - are subject to medical screening; and  - are subject to quarantine at government monitored facilities for 14 days, at their own expense; and - must install 'MySejahtera app' in their smart phone. 3. Airline crew are subject to quarantine until their next flight; and - must install 'MySejahtera app' in their smart phone.  4. Transfer from an international flight to a domestic flight is not allowed.  - This does not apply to nationals of Malaysia traveling to Sabah or Sarawak.  "
  },
  {
    "code":"MZ",
    "iso_alpha2": "MZ",
    "continent": "AF",
    "name": "Mozambique",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 04.06.2020  1. passengers arriving from countries with cases of  () or who have been in contact with infected persons are subject to quarantine for 14 days. 2. airline crew who disembark are subject to quarantine during their rotation/rest period of maximum of 24 hours.  "
  },
  {
    "code":"NA",
    "iso_alpha2": "NA",
    "continent": "AF",
    "name": "Namibia",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 03.07.2020  1. Flights to Namibia are suspended until 30 September 2020. - This does not apply to humanitarian, medevac and repatriation flights. 2. Passengers and airline crew are subject to medical screening and quarantine.  "
  },
  {
    "code":"NC",
    "iso_alpha2": "NC",
    "continent": "OC",
    "name": "New Caledonia",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 29.07.2020 1. passengers are not allowed to enter. - this does not apply to: - residents of new caledonia, their spouses and children; - residents of wallis and futuna who are nationals of france. 2. a completed international travel certificate must be presented prior to boarding and to immigration upon arrival or when transiting new caledonia. the certificate can be obtained at consulates or at <a target=_blank href=https://www.interieur.gouv.fr>https://www.interieur.gouv.fr</a>.   - this does not apply to passengers arriving from wallis and futuna. 3. passengers arriving from france must have a medical certificate with a negative  () pcr test result issued at most 72 hours before arrival. - this does not apply to passengers younger than 11 years.  4. passengers are subject to quarantine for 14 days.   "
  },
  {
    "code":"NE",
    "iso_alpha2": "NE",
    "continent": "AF",
    "name": "Niger",
    "score": "4.1 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 29.07.2020 flights to niger are suspended. - this does not apply to humanitarian, medevac, military and repatriation flights. effective 1 august 2020: 1. flights to niger restart. 2. passengers must have a medical certificate with a negative  () pcr test result issued at most 72 hours before arrival.  "
  },
  {
    "code":"NF",
    "iso_alpha2": "NF",
    "continent": "OC",
    "name": "Norfolk Island",
    "score": "0 (Information not available)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 27.05.2020 1. Passengers are not allowed to enter Australia.  - This does not apply to nationals of Australia.  - This does not apply to the immediate family members of nationals of Australia.  - This does not apply to permanent residents of Australia and their immediate family members.  - This does not apply to nationals of New Zealand residing in Australia.  - This does not apply to diplomats accredited to Australia and currently resident in Australia, and their immediate family members. 2. Passengers and airline crew are required to self-isolate for a period of 14 days at their first arrival location in Australia. If their duration of stay is less than 14 days, they must self-isolate for the entire duration of stay. - This does not apply to airline crew with the appropriate personal protective equipment. 3. Airline crew who are nationals or residents of Australia must self-isolate at their place of residence (or hotel) between flights, or for 14 days, whichever is shorter. Airline crew who are not nationals or residents of Australia must self-isolate in their hotel on arrival until their next flight. 4. When passengers transit through Australia for 8 to 72 hours, they must go to mandatory quarantine at the state designated facility until the time of the departing flight. 5. For repatriation charter flights, airlines are advised to contact the Australian Border Force (ABF) as early as possible in the planning process. Airlines should not confirm or schedule flights before discussing arrangements with the ABF repatriation team.  "
  },
  {
    "code":"NG",
    "iso_alpha2": "NG",
    "continent": "AF",
    "name": "Nigeria",
    "score": "3.7 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 22.07.2020 1. flights to nigeria are suspended. - this does not apply to humanitarian and medical flights. 2. passengers are not allowed to enter. - this does not apply to nationals and residents of nigeria. 3. nationals and residents of nigeria: - must complete a health declaration form; - must have a medical certificate with a negative  () test result issued at most 5 days before arrival; - are subject to quarantine for 14 days. 4. residence permits which have expired on 22 march 2020 or later, are considered valid.  "
  },
  {
    "code":"NI",
    "iso_alpha2": "NI",
    "continent": "NA",
    "name": "Nicaragua",
    "score": "4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 01.05.2020 Airports in Nicaragua are closed. - This does not apply to humanitarian flights with a flight authorization requested 72 hours prior to flight. The passenger manifest must be submitted with the request.   "
  },
  {
    "code":"NL",
    "iso_alpha2": "NL",
    "continent": "EU",
    "name": "Netherlands",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 28.07.2020 1. passengers are not allowed to enter. -this does not apply to: - nationals and residents of the netherlands;  - nationals of andorra, austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, monaco, north macedonia (rep.), norway, poland, portugal, romania, san marino, slovakia, slovenia, spain, sweden, switzerland and vatican city (holy see);  - british nationals; - passengers arriving from austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, lithuania, liechtenstein, luxembourg, malta, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland or the united kingdom; - passengers with a long-term residence permit issued by austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, ireland (rep.), italy, latvia, lithuania, luxembourg, malta, poland, portugal, romania, slovakia, slovenia, spain, sweden or the united kingdom;  - family members of a national of an eea member state or switzerland, with a residence permit issued to family members of a union citizen by austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland or the united kingdom;  - passengers with a long-term d visa issued by austria, belgium, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, slovakia, slovenia, spain, sweden or switzerland; - residents of algeria, australia, canada, georgia, japan, korea (rep.), morocco, new zealand, rwanda, thailand, tunisia and uruguay; - military personnel. 2. a completed 'health declaration form' for passengers departing from high risk  () countries must be presented prior to boarding. the form can be found at <a href=https://www.government.nl/documents/publications/2020/07/07/information-for-passengers-flying-to-and-from-the-netherlands>https://www.government.nl/documents/publications/2020/07/07/information-for-passengers-flying-to-and-from-the-netherlands</a> . 3. passengers are subject to self-quarantine for 14 days. a list of quarantine exemptions can be found at <a href=https://www.netherlandsandyou.nl/travel-and-residence/visas-for-the-netherlands/qas-travel-restrictions-for-the-netherlands>https://www.netherlandsandyou.nl/travel-and-residence/visas-for-the-netherlands/qas-travel-restrictions-for-the-netherlands</a> .  "
  },
  {
    "code":"NO",
    "iso_alpha2": "NO",
    "continent": "EU",
    "name": "Norway",
    "score": "2.6 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 28.07.2020 1. passengers are not allowed to enter until 20 august 2020.  -this does not apply to: - nationals of norway; - residents of austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden and united kingdom; - passengers arriving from austria, belgium, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, malta, netherlands, poland, slovakia, slovenia, sweden (only blekinge, kalmar, kronoberg, orebro, ostergotland and skane), switzerland and united kingdom; - passengers arriving from andorra, bulgaria, croatia, luxembourg, portugal, romania, spain and sweden (excluding blekinge, kalmar, kronoberg, orebro, ostergotland and skane). they must have a confirmed booking of quarantine accommodation for the first 10 days of the stay; - spouses, partners, parents, children of residents of norway. they must present proof confirming the relationship; - boyfriends or girlfriends of residents of norway. a solemn declaration on relationship for use in connection with entry signed by the person residing in norway must be presented to the immigration upon arrival. the form can be obtained at <a href=https://www.udi.no/globalassets/global/aktuelt/korona/solemn-declaration-on-relationship.pdf>https://www.udi.no/globalassets/global/aktuelt/korona/solemn-declaration-on-relationship.pdf</a> ; - nationals of andorra, austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, monaco, netherlands, poland, portugal, romania, san marino, slovakia, slovenia, spain, sweden, switzerland, vatican city (holy see) and british nationals returning via norway to their country of residence; - family members of nationals of andorra, austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, monaco, netherlands, poland, portugal, romania, san marino, slovakia, slovenia, spain, sweden, switzerland, vatican city (holy see) and british nationals returning via norway to their country of residence; - passengers with a visa issued by norway after 15 march 2020; - passengers with a d visa issued by norway; - passengers traveling to study in norway. they must have received a decision letter stating that they have been granted a residence permit as a student in norway; - nato staff with travel order and their family members; - merchant seamen in transit to ships. 2. passengers are subject to quarantine for 10 days. a list of quarantine exemptions can be found at <a href=https://www.fhi.no/en/op/novel--facts-advice/facts-and-general-advice/travel-advice-19/>https://www.fhi.no/en/op/novel--facts-advice/facts-and-general-advice/travel-advice-19/</a> . 3. passengers are only allowed to travel to svalbard after they have stayed in quarantined in other parts of norway.  "
  },
  {
    "code":"NP",
    "iso_alpha2": "NP",
    "continent": "AS",
    "name": "Nepal",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 22.07.2020 1. Flights to Nepal are suspended until 16 August 2020.  - This does not apply to medical and repatriation flights. 2. Passengers are subject to self-quarantine for 14 days. 3. A completed Passengers Locator Card must be presented to the health desk upon arrival.  "
  },
  {
    "code":"NR",
    "iso_alpha2": "NP",
    "continent": "AS",
    "name": "Nepal",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 07.03.2020  1. Passengers and airline crew who have transited through or have been in China (People's Rep.), Hong Kong (SAR China), Iran, Italy, Korea (Rep.) or Macao (SAR China) in the past 21 days are not allowed to enter Nauru.  2. Passengers and airline crew must complete a Health Declaration Card and submit it to the Health Personnel when arriving in Nauru. They will undergo health screening before entering Nauru.  "
  },
  {
    "code":"NU",
    "iso_alpha2": "NU",
    "continent": "OC",
    "name": "Niue",
    "score": "4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 20.03.2020 Passengers who have been in Australia, Austria, Belgium, Bulgaria, China (People's Rep.), Chinese Taipei, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hong Kong (SAR China), Hungary, Iceland, Ireland (Rep.), Indonesia, Iran, Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Macao (SAR China), Netherlands, Norway, Poland, Portugal, Romania, Singapore, Slovakia, Slovenia, Spain, Sweden, Switzerland, Thailand, USA or United Kingdom in the past 14 days are not allowed to enter Niue. - This does not apply to nationals and resident of Niue.  "
  },
  {
    "code":"NZ",
    "iso_alpha2": "NZ",
    "continent": "OC",
    "name": "New Zealand",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 22.06.2020 1. Passengers are not allowed to enter. - This does not apply to nationals of New Zealand (including Cook Isl., Niue, Tokelau). - This does not apply to the immediate family members of nationals of New Zealand. - This does not apply to passengers with a permanent resident visa and their immediate family members. - This does not apply to nationals of Australia ordinarily resident in New Zealand. 2. Passengers are not allowed to transit. - This does not apply to nationals of Australia and New Zealand. - This does not apply to residents of New Zealand. - This does not apply to passengers with a visa issued by New Zealand. - Effective until 4 September 2020, this does not apply to nationals of Fiji returning directly via New Zealand to Fiji. - Effective until 19 September 2020, this does not apply to passengers in Cook Isl., Fiji, French Polynesia, Kiribati, Micronesia (Federated States), Nauru, New Caledonia, Niue, Northern Mariana Isl., Samoa, Samoa (American), Solomon Isl., Tonga, Tuvalu or Vanuatu, if they are returning via New Zealand to their country of residence. 3. Transit is only allowed for maximum 24 hours at Auckland (AKL). 4. Passengers are subject to medical screening and quarantine for 14 days.  - This does not apply to passengers in transit. 5. Airline crew must use appropriate personal protective equipment (PPE). They are not subject to quarantine.  "
  },
  {
    "code":"OM",
    "iso_alpha2": "OM",
    "continent": "AS",
    "name": "Oman",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 07.07.2020  Flights to Oman are suspended. - This does not apply to humanitarian and repatriation flights.  "
  },
  {
    "code":"PA",
    "iso_alpha2": "PA",
    "continent": "NA",
    "name": "Panama",
    "score": "2.8 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 21.07.2020 1. Flights to Panama are suspended until 22 August 2020. - This does not apply to humanitarian flights. 2. Passengers are subject to quarantine for 14 days.  "
  },
  {
    "code":"PE",
    "iso_alpha2": "PE",
    "continent": "SA",
    "name": "Peru",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 01.07.2020 1. Passengers are not allowed to enter Peru until 31 July 2020. - This does not apply to nationals and residents of Peru. 2. Nationals and residents of Peru are subject to quarantine for 14 days. 3. Airline crew must self-isolate at a hotel for the entire duration of stay. 4. A completed Declaracion Jurada de Salud must be presented upon arrival.  "
  },
  {
    "code":"PF",
    "iso_alpha2": "PF",
    "continent": "OC",
    "name": "French Polynesia",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 23.07.2020 1. passengers arriving in french polynesia must: - present a completed public health passenger locator form; and - have a travel insurance; and - complete an etis application at <a href=https://www.etis.pf/en/>https://www.etis.pf/en/</a> . a qr code generated from the completed form must be presented upon arrival. 2. airline crew who have been out of french polynesia for more than 72 hours must have a medical certificate with a negative  () test result.  "
  },
  {
    "code":"PG",
    "iso_alpha2": "PG",
    "continent": "OC",
    "name": "Papua New Guinea",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 21.07.2020 1. passengers and airline crew are not allowed to enter. - this does not apply to passengers with a state of emergency (soe) controller approval. 2. passengers can only land at port moresby (pom). 3. residents of papua new guinea must depart from brisbane (bns), cairns (cns) or singapore.  4. passengers must have a medical certificate with a negative  () pcr test result issued at most 7 days before departure. 5. passengers are subject to quarantine for 14 days.  "
  },
  {
    "code":"PH",
    "iso_alpha2": "PH",
    "continent": "AS",
    "name": "Philippines",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 27.07.2020 1. passengers are not allowed to enter.  this does not apply to: - nationals of the philippines; - spouses or children of nationals of the philippines traveling together or traveling to join the national of philippines; - merchant seamen with a 9(c) visa issued by the philippines. - nationals of india with a temporary resident visa. - nationals of china (people's rep.) with a permanent resident visa who is spouse of a national of the philippines.  2. passengers arriving in philippines: - are subject to a  () test at their own expense; and - are subject to quarantine; and - must present a completed case investigation form. 3. passengers traveling to davao (dvo) must have a medical certificate with a negative  () test result issued at most 72 hours before departure. effective 1 august 2020: passengers with a 13(a), 13(b), 13(c), 13(d), 13(e), 13(g), ra 7919, eo324 or native-born visa issued by the philippines are allowed to enter.  "
  },
  {
    "code":"PK",
    "iso_alpha2": "PK",
    "continent": "AS",
    "name": "Pakistan",
    "score": "4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 20.07.2020 1. Flights to Gwadar (GWD) and Turbat (TUK) are suspended.  - This does not apply to diplomatic, special and flights of national carriers. They must have a special approval from the competent authority for transporting stranded passengers.  2. A completed International Passenger Health Declaration Form must be presented upon arrival.  3. Passengers are subject to medical screening and quarantine for 14 days. 4. Airline crew are subject to medical screening.  "
  },
  {
    "code":"PL",
    "iso_alpha2": "PL",
    "continent": "EU",
    "name": "Poland",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 28.07.2020 1. passengers are not allowed to enter.  -this does not apply to: - nationals and residents of poland;  - passengers arriving from albania, austria, belgium, bulgaria, canada, croatia, cyprus, czechia, denmark, estonia, finland, france, georgia, germany, greece, hungary, iceland, ireland (rep.), italy, japan, korea (rep.), latvia, liechtenstein, lithuania, luxembourg, malta, montenegro, netherlands, norway, romania, slovakia, slovenia, spain, switzerland or united kingdom;  - spouses, children of nationals of poland; - passengers under the constant care of nationals of poland; - nationals of eea member states and switzerland;  - british nationals; - spouses and children of nationals of eea member states and switzerland;  - spouses and children of british nationals; - passengers with a permanent or a long-term residence permit issued by an eea member state, switzerland or united kingdom and their spouses and children, when they are returning via poland to their country of residence;  - students who have documented their study to a border guard officer. 2. flights to poland are suspended. -this does not apply to: - flights arriving from albania, austria, belgium, bulgaria, canada, croatia, cyprus, czechia, denmark, estonia, finland, france, georgia, germany, greece, hungary, iceland, ireland (rep.), italy, japan, korea (rep.), latvia, liechtenstein, lithuania, luxembourg, malta, montenegro, netherlands, norway, romania, slovakia, slovenia, spain, switzerland, united kingdom or ukraine; - humanitarian, medevac and repatriation flights. 3. passengers are subject to quarantine for 14 days. a list of quarantine exemptions can be found at <a href=https://www.gov.pl/web//travel>https://www.gov.pl/web//travel</a> .   "
  },
  {
    "code":"PM",
    "iso_alpha2": "PN",
    "continent": "OC",
    "name": "Pitcairn",
    "score": "0 (Information not available)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 02.06.2020 1. passengers arriving from a non-schengen member state are not allowed to enter france. - this does not apply to: - nationals of france, their spouses and children; - nationals of andorra, monaco, san marino, switzerland, vatican city (holy see) and an eea member state, their spouses and children, on their way home; - british nationals, their spouses and children, on their way home; - passengers with a residence permit issued by france; - passengers with a residence permit issued by andorra, monaco, san marino, switzerland, united kingdom, vatican city (holy see) or an eea member state, on their way home; - healthcare professionals and researchers related to  ();  - personnel of diplomatic and consular missions and international organizations headquartered or having an office in france, their spouses and children; - merchant seamen. 2. a completed international travel certificate must be presented prior to boarding and to immigration upon arrival or when transiting france. the certificate must be obtained before departure via the french consular offices abroad or online at <a target=_blank href=https://www.interieur.gouv.fr>https://www.interieur.gouv.fr</a>. 3. passengers are subject to quarantine or isolation. 4. passengers must complete a declaration on honor to state that they do not have symptoms of  (). the declaration must be dated with the name and signature of the passenger.  "
  },
  {
    "code":"PR",
    "iso_alpha2": "PS",
    "continent": "AS",
    "name": "Palestinian Territory",
    "score": "3.7 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 06.04.2020 1. Passengers will be quarantined for 14 days. 2. Passengers must present a completed Puerto Rico Department of Health form upon arrival.  "
  },
  {
    "code":"PT",
    "iso_alpha2": "PT",
    "continent": "EU",
    "name": "Portugal",
    "score": "3.6 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 17.07.2020 1. passengers are not allowed to enter. - this does not apply to: - nationals and residents of portugal; - passengers with a long term visa issued by portugal;  - passengers arriving from algeria, austria, belgium, bulgaria, canada, china (people's rep.), croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, korea (rep.), latvia, liechtenstein, lithuania, luxembourg, malta, morocco, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland, tunisia and united kingdom; - passengers arriving from angola, brazil, cape verde, guinea-bissau, mozambique, sao tome and principe and usa traveling as students; - passengers with a residence permit issued by austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, ireland (rep.), italy, latvia, lithuania, luxembourg, malta, netherlands, poland, portugal, romania, slovakia, slovenia, spain, sweden or united kingdom, returning via portugal to their country of residence;  - passengers with a long term visa issued by austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, ireland (rep.), italy, latvia, lithuania, luxembourg, malta, netherlands, poland, portugal, romania, slovakia, slovenia, spain, sweden or united kingdom, returning via portugal to their country of residence.  2. flights to portugal are suspended. - this does not apply to flights arriving from angola, austria, belgium, brazil (sao paulo (gru) and rio de janeiro (rio)), bulgaria, canada, cape verde, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, guinea-bissau, hungary, iceland, ireland (rep.), italy, latvia, lithuania, luxembourg, malta, mozambique, netherlands, norway, poland, portugal, romania, sao tome and principe, slovakia, slovenia, south africa, sweden, switzerland, usa, united kingdom or venezuela. - this does not apply to medevac, humanitarian and repatriation flights. 3. passengers are subject to medical screening. 4. passengers arriving in madeira are subject to a pcr test on arrival if they do not have a certificate with a negative  () pcr test result issued at most 72 hours before departure. for more details, please refer to the website <a href=http://www.visitmadeira.pt/en-gb/useful-info/-virus-()/information-to-visitors-(>http://www.visitmadeira.pt/en-gb/useful-info/-virus-()/information-to-visitors-(</a>). 5. passengers arriving in azores are subject to medical screening and quarantine if they do not have a certificate with a negative  () test result issued at most 72 hours before departure. 6. passengers arriving from angola, brazil, cape verde, guinea-bissau, mozambique, sao tome and principe and usa must have a medical certificate with a negative  () test result issued at most 72 hours before departure.  "
  },
  {
    "code":"PW",
    "iso_alpha2": "PW",
    "continent": "OC",
    "name": "Palau",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 06.02.2020 Passengers and airline crew who have transited through or have been in China (People's Rep.), Hong Kong (SAR China) or Macao (SAR China) in the past 14 days are not allowed to enter Palau.  "
  },
  {
    "code":"PY",
    "iso_alpha2": "PY",
    "continent": "SA",
    "name": "Paraguay",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 17.04.2020  Flights to Paraguay are suspended. - This does not apply to health services and repatriation flights.  "
  },
  {
    "code":"QA",
    "iso_alpha2": "QA",
    "continent": "AS",
    "name": "Qatar",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 28.07.2020 1. passengers are not allowed to enter qatar.  - this does not apply to: - nationals of qatar; - passengers with a permanent residence permit issued by qatar; - passengers with a temporary residence permit issued by qatar. they must have a return permit obtained at <a href=https://portal.www.gov.qa/>https://portal.www.gov.qa/</a>;  - immediate family members of nationals of qatar;  - domestic workers if accompanied by a national of qatar or by an immediate family member of a national of qatar. 2. passengers are subject to medical screening on arrival.  - this does not apply to passengers with a medical certificate with a negative  () pcr test result issued at most 48 hours before arrival by one of the following hospitals in turkey:  - ankara sehir hospital in ankara; - yeshel koi murat delmanlar hospital in istanbul; - basaksehir cam ve sakura hospital in istanbul; - kartal dr. lutfi kirdar city hospital in istanbul.  3. passengers must have a quarantine hotel reservation made at <a href=http://www.discoverqatar.qa>www.discoverqatar.qa</a> for a duration of 7 days.  - this does not apply to the following passengers who are subject to self-quarantine for 7 days: - passengers arriving from algeria, andorra, australia, austria, belgium, brunei darussalam, canada, china (people's rep.), croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, japan, korea (rep.), latvia, lithuania, malaysia, malta, morocco, netherlands, new zealand, norway, poland, slovakia, slovenia, spain, switzerland, thailand, turkey, united kingdom or vietnam; - residents of qatar; - passengers older than 55 years; - passengers with a medical condition; - passengers with a medical treatment from the ministry of public health; - pregnant women; - mothers of children younger than 5 years; - disabled passengers who require support to carry out activities; - disabled children and their mothers;  - passengers with immediate family members who have passed away within 10 days before arrival. more information about quarantine can be found at <a href=https://19.moph.gov.qa>https://19.moph.gov.qa</a>.  "
  },
  {
    "code":"RE",
    "iso_alpha2": "RE",
    "continent": "AF",
    "name": "Reunion",
    "score": "4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 28.07.2020 1. passengers are not allowed to enter. - this does not apply to: - residents of reunion, their spouses and children; - passengers arriving from andorra, monaco, san marino, switzerland, united kingdom, vatican city (holy see) or an eea member state; - merchant seamen.  2. a completed international travel certificate must be presented prior to boarding and to immigration upon arrival or when transiting reunion. the certificate can be obtained at consulates or at <a href=https://www.interieur.gouv.fr>https://www.interieur.gouv.fr</a>. 3. passengers must have a medical certificate with a negative  () test result issued at most 72 hours before arrival.  - this does not apply to passengers younger than 11 years.  4. passengers are subject to quarantine for 7 days.  5. passengers must complete a declaration on honor to state that they do not have symptoms of  ().   "
  },
  {
    "code":"RO",
    "iso_alpha2": "RO",
    "continent": "EU",
    "name": "Romania",
    "score": "3.6 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 28.07.2020 1. passengers are not allowed to enter romania until 15 august 2020. this does not apply to: - nationals and residents of algeria, andorra, australia, austria, belgium, bulgaria, canada, croatia, cyprus, czechia, denmark, estonia, finland, france, georgia, germany, greece, hungary, iceland, ireland (rep.), italy, japan, korea (rep.), latvia, liechtenstein, lithuania, luxembourg, malta, monaco, morocco, netherlands, new zealand, norway, poland, portugal, romania, rwanda, slovakia, slovenia, spain, sweden, switzerland, thailand, tunisia, uruguay and vatican city (holy see);  - british nationals; - passengers with a long-stay visa issued by an eu member state;  - passengers arriving from algeria, andorra, australia, austria, belgium, bulgaria, canada, croatia, cyprus, czechia, denmark, estonia, finland, france, georgia, germany, greece, hungary, iceland, ireland (rep.), italy, japan, korea (rep.), latvia, liechtenstein, lithuania, luxembourg, malta, monaco, morocco, netherlands, new zealand, norway, poland, portugal, romania, rwanda, slovakia, slovenia, spain, sweden, switzerland, thailand, tunisia, uruguay and vatican city (holy see); - family members of nationals of romania;  - family members of nationals of austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland or united kingdom, with a residence in romania; - military personnel; - merchant seamen; - students. 2. flights from argentina, armenia, azerbaijan, bahrain, bolivia, bosnia and herzegovina, brazil, cape verde, chile, colombia, costa rica, dominican rep., ecuador, el salvador, eswatini, guatemala, honduras, iraq, israel, kazakhstan, kosovo (rep.), kuwait, kyrgyzstan, luxembourg, maldives, mexico, moldova (rep.), montenegro, north macedonia (rep.), oman, palestinian territory, panama, peru, puerto rico, qatar, russian fed., saudi arabia, serbia, singapore, south africa, suriname, turks and caicos isl., usa or virgin isl. (usa) to romania are suspended. - this does not apply to humanitarian and medevac flights. 3. passengers arriving from argentina, armenia, azerbaijan, bahrain, bolivia, bosnia and herzegovina, brazil, cape verde, chile, colombia, costa rica, dominican rep., ecuador, el salvador, eswatini, guatemala, honduras, iraq, israel, kazakhstan, kosovo (rep.), kuwait, kyrgyzstan, luxembourg, maldives, mexico, moldova (rep.), montenegro, north macedonia (rep.), oman, palestinian territory, panama, peru, puerto rico, qatar, russian fed., saudi arabia, serbia, singapore, south africa, suriname, turks and caicos isl., usa or virgin isl. (usa) are subject to quarantine for 14 days. 4. passports and national id cards issued by romania which have expired during the  outbreak, are considered valid until 14 august 2020.  "
  },
  {
    "code":"RS",
    "iso_alpha2": "RS",
    "continent": "EU",
    "name": "Serbia",
    "score": "4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 22.05.2020  () entry regulations lifted on 22 may 2020.  "
  },
  {
    "code":"RU",
    "iso_alpha2": "RU",
    "continent": "EU",
    "name": "Russia",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 26.03.2020 Passengers are not allowed to enter the Russian Fed.  - This does not apply to nationals of the Russian Fed.;  - This does not apply to accredited or appointed employees of diplomatic missions, consular offices, international organizations located in Russian Fed. and their family members; - This does not apply to members of official delegations; - This does not apply to travelers with diplomatic, business or normal visas issued in connection with the death of a close relative, as well as visas issued by special decision of the Russian Ministry of Foreign Affairs; - This does not apply to passengers from visa-free countries coming in connection with the death of a close relative, having copies of death certificate, as well as a document confirming family relations; - This does not apply to passengers who are family members (spouses, parents, kids, adoptive parents, adopted), guardians and trustees of citizens of the Russian Fed., subject to the presentation of a copy of a document confirming the relationship status; - This does not apply to passengers permanently residing in the Russian Fed., as well as transiting through airports without entering the Russian Fed.  "
  },
  {
    "code":"RW",
    "iso_alpha2": "RW",
    "continent": "AF",
    "name": "Rwanda",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 14.07.2020 1. flights to kigali (kgl) are suspended until 31 july 2020. - this does not apply to humanitarian, medevac and repatriation flights.  2. effective 1 august 2020, passengers and airline crew: - must have a medical certificate with a negative  () pcr test result issued at most 72 hours before arrival;  - are subject to medical screening; - are subject to quarantine.  "
  },
  {
    "code":"SA",
    "iso_alpha2": "SA",
    "continent": "AS",
    "name": "Saudi Arabia",
    "score": "3.1 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 19.05.2020 Flights to Saudi Arabia are suspended. - This does not apply to technical stops, humanitarian, medevac and repatriation flights. These flights are subject to prior approval from GACA.   "
  },
  {
    "code":"SB",
    "iso_alpha2": "SB",
    "continent": "OC",
    "name": "Solomon Islands",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 04.05.2020 1. passengers and airline crew are not allowed to enter solomon isl.  - this does not apply to nationals and residents of solomon isl.  - this does not apply to passengers with prior written authorization issued by the prime minister.  2. nationals and residents of solomon isl. who have been in countries with confirmed cases of  () will be put in quarantine for a period of 14 days upon arrival. 3. passengers with prior written authorization issued by the prime minister who have been in countries with confirmed cases of  () will be put in quarantine for a period of 14 days upon arrival. 4. passengers must present a completed traveler’s public health declaration card and provide full details of their place of stay, travel itinerary and current personal contact details in solomon isl. 5. passengers and airline crew must provide details of their international travel history for the period of 14 days prior to arrival in solomon isl.  "
  },
  {
    "code":"SC",
    "iso_alpha2": "SC",
    "continent": "AF",
    "name": "Seychelles",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 28.07.2020 1. airports in seychelles reopened. 2. passengers and airline crew are not allowed to enter and transit. - this does not apply to nationals and residents of seychelles. 3. nationals and residents of seychelles are subject to quarantine for 14 days. 4. a completed application for entry into seychelles must be submitted to the public health commissioner before boarding. the form can be obtained at <a href=http://tourism.gov.sc>http://tourism.gov.sc</a> . effective 1 august 2020: 1. passengers and airline crew are not allowed to enter and transit. - this does not apply to: - nationals and residents of seychelles; - passengers arriving from austria, belgium, canada, china (people’s rep.), cuba, cyprus, czechia, estonia, finland, france, germany, greece, hungary, iceland, ireland, italy, japan, korea (rep.), latvia, lithuania, luxembourg, malaysia, malta, mauritius, monaco, netherlands, new zealand, norway, singapore, slovakia, slovenia, spain, sri lanka, switzerland, thailand or united arab emirates.  2. passengers arriving from austria, belgium, canada, china (people’s rep.), cuba, cyprus, czechia, estonia, finland, france, germany, greece, hungary, iceland, ireland, italy, japan, korea (rep.), latvia, lithuania, luxembourg, malaysia, malta, mauritius, monaco, netherlands, new zealand, norway, singapore, slovakia, slovenia, spain, sri lanka, switzerland, thailand or united arab emirates must have a medical certificate with a negative  () pcr test result issued at most 72 hours before arrival. the test must be submitted to the public health authority to <a href=mailto:visitor@health.gov.sc>visitor@health.gov.sc</a> .  3. passengers arriving from austria, belgium, canada, china (people’s rep.), cuba, cyprus, czechia, estonia, finland, france, germany, greece, iceland, italy, hungary, ireland, japan, korea (rep.), latvia, lithuania, luxembourg, malaysia, malta, mauritius, monaco, netherlands, new zealand, norway, singapore, slovakia, slovenia, spain, sri lanka, switzerland, thailand or united arab emirates without a medical certificate with a negative  () pcr test result are subject to medical screening. 4. passengers must have a hotel reservation confirmation.  - this does not apply to nationals and residents of seychelles. 5. passengers must have a full medical insurance coverage for the duration of their stay.  - this does not apply to nationals and residents of seychelles. 6. nationals and residents of seychelles are subject to quarantine for 14 days. 7. a completed application for entry into seychelles must be submitted to the public health commissioner before boarding. the form can be obtained at <a href=http://tourism.gov.sc>http://tourism.gov.sc</a> .  "
  },
  {
    "code":"SD",
    "iso_alpha2": "SD",
    "continent": "AF",
    "name": "Sudan",
    "score": "4.1 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 14.07.2020 1. flights to sudan are suspended until 10 october 2020.  - this does not apply to flights arriving from egypt, turkey or united arab emirates. - this does not apply to humanitarian, medical and repatriation flights. 2. nationals of sudan and passengers of sudanese origin are subject to medical screening. 3. passengers must have a medical certificate with a negative  () pcr test result issued at most 72 hours before arrival. - this does not apply to nationals of sudan or passengers of sudanese origin.  "
  },
  {
    "code":"SE",
    "iso_alpha2": "SE",
    "continent": "EU",
    "name": "Sweden",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 20.07.2020 Passengers are not allowed to enter until 31 August 2020. -This does not apply to: - passengers arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Switzerland and United Kingdom; - nationals of Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland and Vatican City (Holy See), and their family members; - British nationals and their family members; - passengers with a residence permit issued by Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Swede, Switzerland, United Kingdom or Vatican City (Holy See) and their family members. The residence permit must be issued with a validity of more than 3 months; - passengers with a national visa issued by Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland, United Kingdom or Vatican City (Holy See) and their family members. The visa must be issued with a validity of more than 3 months; - residents of Algeria, Australia, Canada, Georgia, Japan, Korea (Rep.), Morocco, New Zealand, Rwanda, Thailand, Tunisia and Uruguay; - merchant seamen; - military personnel; - students.  "
  },
  {
    "code":"SG",
    "iso_alpha2": "SG",
    "continent": "AS",
    "name": "Singapore",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 14.07.2020 1. passengers are not allowed to enter singapore. -this does not apply to: - nationals of singapore; - permanent residents of singapore; - passengers with a long-term visit pass (ltvp) or a long-term visit pass in-principle approval (ltvp ipa). they must have an approval letter for entry (ale) issued by the immigration & checkpoints authority (ica); - passengers with a work pass, long-term visit pass (ltvp), dependant's pass, or the respective in-principle approval (ipa) issued by the ministry of manpower (mom). they must have an approval letter from the ministry of manpower (mom) or the immigration & checkpoints authority (ica); - passengers with a student's pass (stp) or a student's pass in-principle approval (stp ipa). they must have an approval letter for entry (ale) issued by the ministry of education (moe) or the immigration & checkpoints authority (ica); - passengers with an approval letter from the immigration & checkpoints authority (ica), ministry of foreign affairs (mfa), ministry of education (moe), ministry of health (moh), or ministry of trade and industry (mti); - residents of china (people’s rep.) if they: - have a valid safe travel pass approval letter issued by singapore under the singapore-china fast lane; and - have a visa to enter singapore (if they are a visa-required short-term visitor); and - have a medical certificate stating a negative  () test result, taken within 48 hours before departure; and - stayed in chongqing, guangdong, jiangsu, shanghai, tianjin, or zhejiang in the last 7 days before departure; and - have a return ticket or proof of other transportation arrangements to depart from singapore. - returning passengers with a work pass, student's pass, dependant’s pass, or long-term visit pass who have an invitation letter issued by the chinese authorities under the singapore-china fast lane. they do not require an approval letter from the immigration & checkpoints authority (ica), ministry of manpower (mom), or ministry of education (moe). 2. passengers are not allowed to transit singapore. - this does not apply when traveling on airlines with transfer routes approved by the civil aviation authority of singapore (caas). passengers must check with airlines if they have the civil aviation authority of singapore (caas)'s approval, before purchasing tickets. 3. passengers must comply with the prevailing stay-home notice (shn) requirements upon entry into singapore. please refer to <a href=https://www.ica.gov.sg/>https://www.ica.gov.sg/</a>. - this does not apply to passengers entering singapore under the singapore-china fast lane. they must comply with requirements found at <a href=https://safetravel.ica.gov.sg>https://safetravel.ica.gov.sg</a>. 4. passengers must submit a health declaration before arrival via the sg arrival card (sgac) e-service (<a href=https://eservices.ica.gov.sg/sgarrivalcard>https://eservices.ica.gov.sg/sgarrivalcard</a>) or via the mobile application. - this does not apply to passengers in transit.  "
  },
  {
    "code":"SH",
    "iso_alpha2": "SH",
    "continent": "AF",
    "name": "Saint Helena",
    "score": "0 (Information not available)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 15.07.2020 1. Passengers are subject to isolation for 14 days. 2. Airline crew are subject to isolation until their next flight.  "
  },
  {
    "code":"SI",
    "iso_alpha2": "SJ",
    "continent": "EU",
    "name": "Svalbard and Jan Mayen",
    "score": "0 (Information not available)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 20.07.2020 1. regulations related to  () have been lifted. 2. passengers are subject to quarantine for 14 days. a list of quarantine exemptions can be found at <a href=https://www.policija.si/eng/newsroom/news-archive/103470-crossing-the-state-border-during-the--epidemic>https://www.policija.si/eng/newsroom/news-archive/103470-crossing-the-state-border-during-the--epidemic</a>.  "
  },
  {
    "code":"SK",
    "iso_alpha2": "SK",
    "continent": "EU",
    "name": "Slovakia",
    "score": "2 (Low Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 20.07.2020 1. Passengers are not allowed to enter. - This does not apply to nationals and residents of Slovakia. - This does not apply to passengers arriving from Australia, Austria, Belgium, Bulgaria, China (People's Rep.), Chinese Taipei, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hong Kong (SAR China), Hungary, Iceland, Ireland (Rep.), Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Macao (SAR China), Malta, Monaco, Montenegro, Netherlands, New Zealand, Norway, Poland, Slovenia, Spain, Switzerland or the United Kingdom. 2. Passengers arriving from Bulgaria and Montenegro are subject to medical screening and self-isolation.  "
  },
  {
    "code":"SL",
    "iso_alpha2": "SL",
    "continent": "AF",
    "name": "Sierra Leone",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 28.07.2020 1. Flights to Sierra Leone restarted. 2. Passengers are subject to medical screening; and - must present a travel authorization obtained before departure at: <a href=http://www.travel.gov.sl/>www.travel.gov.sl/</a>  "
  },
  {
    "code":"SM",
    "iso_alpha2": "SM",
    "continent": "EU",
    "name": "San Marino",
    "score": "4.5 (Extreme Warning)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 03.06.2020 1. Passengers are not allowed to enter - This does not apply to: - nationals or residents of Italy; - passengers traveling on business; - passengers traveling for urgent health reasons; - healthcare personnel traveling on duty; - passengers traveling for emergency reasons; - passengers returning via Italy to their country of residence; - passengers arriving from Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom. 2. Residence permits issued by Italy which have expired between 31 January and 31 July 2020, are considered valid until 31 August 2020. 3. Passengers must present a completed self-declaration form to the transporting carrier and must communicate their entry to the Department of Prevention at local health units (ASL) of the entrance district.  - This does not apply to passengers arriving from Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom.  4. Passengers are subject to quarantine for 14 days.  - This does not apply to passengers arriving from Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom.  - This does not apply to passengers traveling on business if their stay in Italy does not exceed 72 hours and if granted, the additional 48 hours of a justified extension for specific needs.  "
  },
  {
    "code":"SN",
    "iso_alpha2": "SN",
    "continent": "AF",
    "name": "Senegal",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 28.07.2020 1. flights to senegal restarted. 2. nationals of austria, belgium, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, slovakia, slovenia, spain, sweden and switzerland are not allowed to enter.  - this does not apply to passengers with a national id card issued to residents of senegal. 3. passengers must have a medical certificate with a negative  () pcr test result issued at most 7 days before arrival. 4. passengers without a medical certificate with a negative  () pcr test result are subject to medical screening on arrival and must complete a declaration on honor to state that they do not have symptoms of  ().  "
  },
  {
    "code":"SO",
    "iso_alpha2": "SO",
    "continent": "AF",
    "name": "Somalia",
    "score": "5 (Extreme Warning)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 09.07.2020 Airports in Somalia are closed. - This does not apply to medical and humanitarian flights.  "
  },
  {
    "code":"SR",
    "iso_alpha2": "SR",
    "continent": "SA",
    "name": "Suriname",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 21.07.2020 Airports in Suriname are closed until 14 August 2020. - This does not apply to medical and repatriation flights.  "
  },
  {
    "code":"SS",
    "iso_alpha2": "SS",
    "continent": "AF",
    "name": "South Sudan",
    "score": "5 (Extreme Warning)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 22.04.2020 Flights to South Sudan are suspended. - This does not apply to humanitarian and evacuation flights with an approval from the High Level Task Force of South Sudan.  "
  },
  {
    "code":"ST",
    "iso_alpha2": "ST",
    "continent": "AF",
    "name": "Sao Tome and Principe",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 30.06.2020 Flights to Sao Tome and Principe are suspended. - This does not apply to humanitarian, medevac, military and repatriation flights.  "
  },
  {
    "code":"SV",
    "iso_alpha2": "SV",
    "continent": "NA",
    "name": "El Salvador",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 13.07.2020  1. San Salvador (SAL) is closed until 18 August 2020. - This does not apply to humanitarian, medevac and repatriation flights, Cooperation Security Location US Military flights and El Salvador Military flights. - Effective 4 August 2020, this does not apply to connecting flights. 2. Passengers are subject to quarantine for 14 days.  "
  },
  {
    "code":"SX",
    "iso_alpha2": "SV",
    "continent": "NA",
    "name": "El Salvador",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 24.07.2020 1. passengers are not allowed to enter. - this does not apply to: - passengers with a resident permit issued by st. maarten;  - passengers arriving from anguilla, antigua and barbuda, aruba, bahamas, barbados, belgium, bonaire, st. eustatius and saba, canada, cayman isl., china (people's rep.), cuba, curacao, dominica, france, french west indies, germany, grenada, italy, jamaica, montserrat, netherlands, spain, st. kitts and nevis, st. lucia, st. vincent and the grenadines, trinidad and tobago, turks and caicos isl. or virgin isl. (british); - effective 1 august 2020, passengers arriving from the usa. 2. passengers arriving from anguilla, antigua and barbuda, aruba, bahamas, barbados, belgium, bonaire, st. eustatius and saba, canada, cayman isl., china (people's rep.), cuba, curacao, dominica, france, french west indies, germany, grenada, italy, jamaica, montserrat, netherlands, spain, st. kitts and nevis, st. lucia, st. vincent and the grenadines, trinidad and tobago, turks and caicos isl. or virgin isl. (british) must have a completed health declaration form obtained at <a href=http://www.stmaartenentry.com>www.stmaartenentry.com</a>  3. passengers arriving from antigua and barbuda, bahamas, barbados, belgium, canada, cayman isl., china (people's rep.), cuba, dominica, france, germany, grenada, italy, jamaica, montserrat, netherlands, spain, st. kitts and nevis, st. lucia, st. vincent and the grenadines, trinidad and tobago, turks and caicos isl. or virgin isl. (british) must have a medical certificate with a negative  () pcr laboratory test result issued at most 72 hours before arrival. - this does not apply to passengers younger than 10 years.  4. airline crew are subject to quarantine until their next flight. 5. passengers are not allowed to transit. - this does not apply to: - passengers who stay in the aircraft or transfer wing to wing from one aircraft to another aircraft; - passengers arriving from anguilla, aruba, bonaire, st. eustatius and saba, curacao or french west indies. 6. effective 1 august 2020, passengers arriving from the usa must have a completed health declaration form obtained at <a href=http://www.stmaartenentry.com>www.stmaartenentry.com</a> and have a medical certificate with a negative  () pcr laboratory test result issued at most 72 hours before arrival.  "
  },
  {
    "code":"SY",
    "iso_alpha2": "SY",
    "continent": "AS",
    "name": "Syria",
    "score": "5 (Extreme Warning)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 27.07.2020 Flights to Syria are suspended until 10 August 2020. - This does not apply to humanitarian, medevac, military and repatriation flights.  "
  },
  {
    "code":"SZ",
    "iso_alpha2": "SZ",
    "continent": "AF",
    "name": "Swaziland",
    "score": "2.3 (Low Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 25.05.2020 1. Passengers are not allowed to enter Eswatini.  - This does not apply to nationals and residents of Eswatini. 2. Nationals and residents of Eswatini are subject to quarantine in designated locations for a period of 14 days.   "
  },
  {
    "code":"TC",
    "iso_alpha2": "TC",
    "continent": "NA",
    "name": "Turks and Caicos Islands",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 22.07.2020 1. airports in turks and caicos isl. reopen. 2. passengers and airline crew must have a travel authorization completed 72 hours before departure and present it to immigration. the authorization can be found at <a href=http://turksandcaicostourism.com>http://turksandcaicostourism.com</a>  - this does not apply to: - airline crew staying for less than 24 hours; - merchant seamen; - passengers younger than 10 years. 3. passengers and airline crew must have a medical certificate with a negative  () pcr test result. - this does not apply to: - airline crew staying for less than 24 hours; - merchant seamen; - passengers younger than 10 years. 4. passengers are subject to medical screening and quarantine for 14 days.  "
  },
  {
    "code":"TD",
    "iso_alpha2": "TD",
    "continent": "AF",
    "name": "Chad",
    "score": "3.7 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 21.07.2020 Airports in Chad are closed until 31 July 2020.  "
  },
  {
    "code":"TG",
    "iso_alpha2": "TG",
    "continent": "AF",
    "name": "Togo",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 25.04.2020 Flights to Togo are suspended. - This does not apply to repatriation flights.  "
  },
  {
    "code":"TH",
    "iso_alpha2": "TH",
    "continent": "AS",
    "name": "Thailand",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 24.07.2020 1. passengers and airline crew are not allowed to enter thailand until 31 august 2020. - this does not apply to: - nationals and residents of thailand; - passengers who are spouses, parents or children of a national of thailand; - airline crew with a return scheduled flight; - students. 2. passengers must have a medical certificate with a negative  () rt-pcr test result issued at most 72 hours before departure. - this does not apply to nationals of thailand. 3. passengers must have: - an insurance to cover medical expenses in thailand, and - a certificate of entry issued by royal thai embassy, and - a fit to fly health certificate. 4. passengers are subject to medical screening and quarantine. 5. airline crew are subject to self-isolation until their next flight. 6. airline crew staying overnight must have a guarantee letter from the airline or a health insurance certificate with a coverage cost of at least usd 100,000.  "
  },
  {
    "code":"TJ",
    "iso_alpha2": "TJ",
    "continent": "AS",
    "name": "Tajikistan",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 14.07.2020  1. Flights to Tajikistan are suspended until 31 July 2020. - This does not apply to humanitarian, medevac and repatriation flights. 2. Passengers are subject to quarantine for 14 days.  3. Airline crew are subject to quarantine until their next flight.  "
  },
  {
    "code":"TL",
    "iso_alpha2": "TL",
    "continent": "OC",
    "name": "East Timor",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 03.06.2020 1. Passengers are not allowed to enter. - This does not apply to: - nationals and residents of Timor-Leste; - passengers born in Timor-Leste; - legal representatives of Timorese minors.  2. Passengers allowed to enter are subject to isolation for 14 days.  "
  },
  {
    "code":"TM",
    "iso_alpha2": "TM",
    "continent": "AS",
    "name": "Turkmenistan",
    "score": "3.6 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 22.07.2020 1. flights to turkmenistan are suspended until 1 september 2020. - this does not apply to repatriation flights of nationals and residents of turkmenistan. 2. passengers arriving in turkmenistan:  - must have a medical certificate stating a negative  () test result issued at most 72 hours before departure by the competent authority of the country of residency; and - are subject to be tested for  on arrival and to self-isolation for 14 days.  "
  },
  {
    "code":"TN",
    "iso_alpha2": "TN",
    "continent": "AF",
    "name": "Tunisia",
    "score": "3.1 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 17.07.2020 1. passengers arriving from albania, algeria, angola, argentina, azerbaijan, bangladesh, benin, bolivia, bosnia and herzegovina, botswana, brazil, burundi, cape verde, cayman isl., chile, colombia, comoros, congo, costa rica, cote d'ivoire, dominican rep., ecuador, egypt, el salvador, equatorial guinea, eritrea, eswatini, ethiopia, ghana, greece, guatemala, honduras, india, iran, iraq, israel, kazakhstan, kiribati, korea (dem. people's rep.), kosovo (rep.), kuwait, kyrgyzstan, liberia, libya, madagascar, malawi, maldives, mali, marshall isl., mauritania, mexico, micronesia (federated states), moldova (rep.), montenegro, mozambique, namibia, nauru, nepal, nigeria, north macedonia (rep.), oman, pakistan, palau, panama, paraguay, peru, philippines, qatar, russian fed., rwanda, samoa, san marino, sao tome and principe, saudi arabia, serbia, solomon isl., somalia, south africa, south sudan, st. lucia, sudan, suriname, sweden, syria, tonga, trinidad and tobago, usa, united arab emirates, uzbekistan, vanuatu, venezuela, virgin isl. (usa), yemen or zimbabwe are not allowed to enter. -this does not apply to: - nationals and residents of tunisia. - spouses of nationals of tunisia. 2. nationals and residents of tunisia arriving from afghanistan, armenia, australia, bahrain, belarus, bulgaria, cameroon, canada, central african rep., comoros, congo (dem. rep.), croatia, czechia, djibouti, gabon, georgia, guam, guinea, guinea-bissau, guyana, haiti, indonesia, jamaica, lebanon, morocco, myanmar, nicaragua, niger, poland, portugal, romania, senegal, sierra leone, singapore, slovakia, slovenia, sri lanka, tajikistan, togo, turkey, uganda, ukraine, uruguay or zambia must have a medical certificate with a negative  () pcr test result issued at most 72 hours before departure and are subject to self-quarantine for 14 days.  3. spouses of nationals of tunisia arriving from afghanistan, armenia, australia, bahrain, belarus, bulgaria, cameroon, canada, central african rep., comoros, congo (dem. rep.), croatia, czechia, djibouti, gabon, georgia, guam, guinea, guinea-bissau, guyana, haiti, indonesia, jamaica, lebanon, morocco, myanmar, nicaragua, niger, poland, portugal, romania, senegal, sierra leone, singapore, slovakia, slovenia, sri lanka, tajikistan, togo, turkey, uganda, ukraine, uruguay or zambia must have a medical certificate with a negative  () pcr test result issued at most 72 hours before departure and are subject to self-quarantine for 14 days. they must have a marriage certificate.  4. nationals and residents of tunisia arriving from afghanistan, armenia, australia, bahrain, belarus, bulgaria, cameroon, canada, central african rep., comoros, congo (dem. rep.), croatia, czechia, djibouti, gabon, georgia, guam, guinea, guinea-bissau, guyana, haiti, indonesia, jamaica, lebanon, morocco, myanmar, nicaragua, niger, poland, portugal, romania, senegal, sierra leone, singapore, slovakia, slovenia, sri lanka, tajikistan, togo, turkey, uganda, ukraine, uruguay or zambia without a medical certificate with a negative  () pcr test result are subject to self-quarantine for 10 days. they must have a hotel reservation confirmation for 10 days.  5. spouses of nationals of tunisia arriving from afghanistan, armenia, australia, bahrain, belarus, bulgaria, cameroon, canada, central african rep., comoros, congo (dem. rep.), croatia, czechia, djibouti, gabon, georgia, guam, guinea, guinea-bissau, guyana, haiti, indonesia, jamaica, lebanon, morocco, myanmar, nicaragua, niger, poland, portugal, romania, senegal, sierra leone, singapore, slovakia, slovenia, sri lanka, tajikistan, togo, turkey, uganda, ukraine, uruguay or zambia without a medical certificate with a negative  () pcr test result are subject to self-quarantine for 10 days. they must have a hotel reservation confirmation for 10 days and a marriage certificate. 6. passengers arriving from afghanistan, armenia, australia, bahrain, belarus, bulgaria, cameroon, canada, central african rep., comoros, congo (dem. rep.), croatia, czechia, djibouti, gabon, georgia, guam, guinea, guinea-bissau, guyana, haiti, indonesia, jamaica, lebanon, morocco, myanmar, nicaragua, niger, poland, portugal, romania, senegal, sierra leone, singapore, slovakia, slovenia, sri lanka, tajikistan, togo, turkey, uganda, ukraine, uruguay or zambia without a medical certificate with a negative  () pcr test result are subject to self-quarantine for 14 days. they must have a hotel reservation confirmation for 10 days.  7. passengers arriving from afghanistan, armenia, australia, bahrain, belarus, bulgaria, cameroon, canada, central african rep., comoros, congo (dem. rep.), croatia, czechia, djibouti, gabon, georgia, guam, guinea, guinea-bissau, guyana, haiti, indonesia, jamaica, lebanon, morocco, myanmar, nicaragua, niger, poland, portugal, romania, senegal, sierra leone, singapore, slovakia, slovenia, sri lanka, tajikistan, togo, turkey, uganda, ukraine, uruguay or zambia for a period less than 14 days are not allowed to enter. 8. nationals and residents of tunisia arriving from albania, algeria, angola, argentina, azerbaijan, bangladesh, benin, bolivia, bosnia and herzegovina, botswana, brazil, burundi, cape verde, cayman isl., chile, colombia, comoros, congo, costa rica, cote d'ivoire, dominican rep., ecuador, egypt, el salvador, equatorial guinea, eritrea, eswatini, ethiopia, ghana, greece, guatemala, honduras, india, iran, iraq, israel, kazakhstan, kiribati, korea (dem. people's rep.), kosovo (rep.), kuwait, kyrgyzstan, liberia, libya, madagascar, malawi, maldives, mali, marshall isl., mauritania, mexico, micronesia (federated states), moldova (rep.), montenegro, mozambique, namibia, nauru, nepal, nigeria, north macedonia (rep.), oman, pakistan, palau, panama, paraguay, peru, philippines, qatar, russian fed., rwanda, samoa, san marino, sao tome and principe, saudi arabia, serbia, solomon isl., somalia, south africa, south sudan, st. lucia, sudan, suriname, sweden, syria, tonga, trinidad and tobago, usa, united arab emirates, uzbekistan, vanuatu, venezuela, virgin isl. (usa), yemen or zimbabwe must have a medical certificate with a negative  () pcr test result issued at most 72 hours before departure and are subject to quarantine in a hotel for 7 days and self-quarantine for an additional 7 days.  9. spouses of nationals of tunisia arriving from albania, algeria, angola, argentina, azerbaijan, bangladesh, benin, bolivia, bosnia and herzegovina, botswana, brazil, burundi, cape verde, cayman isl., chile, colombia, comoros, congo, costa rica, cote d'ivoire, dominican rep., ecuador, egypt, el salvador, equatorial guinea, eritrea, eswatini, ethiopia, ghana, greece, guatemala, honduras, india, iran, iraq, israel, kazakhstan, kiribati, korea (dem. people's rep.), kosovo (rep.), kuwait, kyrgyzstan, liberia, libya, madagascar, malawi, maldives, mali, marshall isl., mauritania, mexico, micronesia (federated states), moldova (rep.), montenegro, mozambique, namibia, nauru, nepal, nigeria, north macedonia (rep.), oman, pakistan, palau, panama, paraguay, peru, philippines, qatar, russian fed., rwanda, samoa, san marino, sao tome and principe, saudi arabia, serbia, solomon isl., somalia, south africa, south sudan, st. lucia, sudan, suriname, sweden, syria, tonga, trinidad and tobago, usa, united arab emirates, uzbekistan, vanuatu, venezuela, virgin isl. (usa), yemen or zimbabwe must have a medical certificate with a negative  () pcr test result issued at most 72 hours before departure and are subject to quarantine in a hotel for 7 days and self-quarantine for an additional 7 days. they must have a marriage certificate. 10. nationals and residents of tunisia arriving from albania, algeria, angola, argentina, azerbaijan, bangladesh, benin, bolivia, bosnia and herzegovina, botswana, brazil, burundi, cape verde, cayman isl., chile, colombia, comoros, congo, costa rica, cote d'ivoire, dominican rep., ecuador, egypt, el salvador, equatorial guinea, eritrea, eswatini, ethiopia, ghana, greece, guatemala, honduras, india, iran, iraq, israel, kazakhstan, kiribati, korea (dem. people's rep.), kosovo (rep.), kuwait, kyrgyzstan, liberia, libya, madagascar, malawi, maldives, mali, marshall isl., mauritania, mexico, micronesia (federated states), moldova (rep.), montenegro, mozambique, namibia, nauru, nepal, nigeria, north macedonia (rep.), oman, pakistan, palau, panama, paraguay, peru, philippines, qatar, russian fed., rwanda, samoa, san marino, sao tome and principe, saudi arabia, serbia, solomon isl., somalia, south africa, south sudan, st. lucia, sudan, suriname, sweden, syria, tonga, trinidad and tobago, usa, united arab emirates, uzbekistan, vanuatu, venezuela, virgin isl. (usa), yemen or zimbabwe without a medical certificate with a negative  () pcr test result are subject to quarantine for 10 days. they must have a hotel reservation confirmation for 10 days.  11. spouses of nationals of tunisia arriving from albania, algeria, angola, argentina, azerbaijan, bangladesh, benin, bolivia, bosnia and herzegovina, botswana, brazil, burundi, cape verde, cayman isl., chile, colombia, comoros, congo, costa rica, cote d'ivoire, dominican rep., ecuador, egypt, el salvador, equatorial guinea, eritrea, eswatini, ethiopia, ghana, greece, guatemala, honduras, india, iran, iraq, israel, kazakhstan, kiribati, korea (dem. people's rep.), kosovo (rep.), kuwait, kyrgyzstan, liberia, libya, madagascar, malawi, maldives, mali, marshall isl., mauritania, mexico, micronesia (federated states), moldova (rep.), montenegro, mozambique, namibia, nauru, nepal, nigeria, north macedonia (rep.), oman, pakistan, palau, panama, paraguay, peru, philippines, qatar, russian fed., rwanda, samoa, san marino, sao tome and principe, saudi arabia, serbia, solomon isl., somalia, south africa, south sudan, st. lucia, sudan, suriname, sweden, syria, tonga, trinidad and tobago, usa, united arab emirates, uzbekistan, vanuatu, venezuela, virgin isl. (usa), yemen or zimbabwe without a medical certificate with a negative  () pcr test result are subject to quarantine for 10 days. they must have a hotel reservation confirmation for 10 days and a marriage certificate.  "
  },
  {
    "code":"TO",
    "iso_alpha2": "TO",
    "continent": "OC",
    "name": "Tonga",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 27.02.2020  1. passengers and airline crew arriving from or transiting through china (people's rep.), chinese taipei, hong kong (sar china) or macao (sar china) are not allowed to enter tonga. this does not apply if they have stayed in a country with no confirmed cases of  () for a period of minimum 14 days before entering tonga. they must have an official medical clearance undertaken within 3 days prior to arrival in tonga.  - this does not apply to nationals of tonga and their immediate family members.  - this does not apply to permanent residents of tonga and their immediate family members.  - this does not apply to airline crew on direct flights from china (people's rep.) who have been using appropriate personal protective equipment (ppe).  2. passengers must complete a 'traveler's arrival health declaration card' and submit it to the ministry of health border control when arriving in tonga.  "
  },
  {
    "code":"TR",
    "iso_alpha2": "TR",
    "continent": "AS",
    "name": "Turkey",
    "score": "3.6 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 25.07.2020 1. Passengers arriving from Afghanistan or Bangladesh are not allowed to enter. - This does not apply to nationals and residents of Turkey. 2. Passengers and airline crew are subject to medical screening.  "
  },
  {
    "code":"TT",
    "iso_alpha2": "TT",
    "continent": "NA",
    "name": "Trinidad and Tobago",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 21.07.2020  Airports in Trinidad and Tobago are closed until 30 September 2020. - This does not apply if permitted by the Minister with responsibility for national security.  "
  },
  {
    "code":"TV",
    "iso_alpha2": "TV",
    "continent": "OC",
    "name": "Tuvalu",
    "score": "2.5 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 26.03.2020 Tuvalu's borders are closed.  "
  },
  {
    "code":"TW",
    "iso_alpha2": "TW",
    "continent": "AS",
    "name": "Taiwan",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 27.07.2020 1. passengers are not allowed to enter. - this does not apply to passengers with a chinese taipei travel document. - this does not apply to passengers with an alien resident certificate. - this does not apply to passengers with a diplomatic or an official passport traveling on duty. - this does not apply to passengers traveling on business. they must be able to prove their business travel purpose. - this does not apply to passengers with a special entry permit for  outbreak visa. 2. passengers are not allowed to transit. - this does not apply to passengers transiting through taoyuan (tpe) for a connecting flight within 8 hours operated by the same carrier group. they must not arrive from or depart to the mainland of china. 3. passengers are subject to quarantine for 14 days. 4. passengers must have a medical certificate in english with a negative  () rt-pcr test result issued at most 3 working days before departure. - this does not apply to passengers with a chinese taipei travel document. - this does not apply to passengers with alien resident certificate. - this does not apply to passengers with a resident visa. - this does not apply to passengers with a visa with remark dc, fd, fo, o, fl, fc, fs or er. - this does not apply to passengers with a mofa id. 5. a completed quarantine system for entry form must be submitted before departure at <a href=https://hdhq.mohw.gov.tw/>https://hdhq.mohw.gov.tw/</a> . 6. passengers arriving from the philippines are subject to medical screening on arrival.  "
  },
  {
    "code":"TZ",
    "iso_alpha2": "TZ",
    "continent": "AF",
    "name": "Tanzania",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 06.07.2020 1. Passengers and airline crew are subject to medical screening and quarantine. 2. A completed Health Form must be presented to the Ministry of Health personnel upon arrival.   "
  },
  {
    "code":"UA",
    "iso_alpha2": "UA",
    "continent": "EU",
    "name": "Ukraine",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 23.07.2020 1. Flights to Ukraine restarted. 2. Passengers must have insurance to cover medical expenses in Ukraine. 3. Passengers are subject to quarantine. A list of quarantine exemptions can be found at <a href=https://www.visitukraine.today/>https://www.visitukraine.today/</a> .  "
  },
  {
    "code":"UG",
    "iso_alpha2": "UG",
    "continent": "AF",
    "name": "Uganda",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 26.06.2020 1. Flights to Uganda are suspended. - This does not apply to humanitarian, medevac and repatriation flights. 2. Passengers are subject to medical screening and quarantine. 3. Airline crew are subject to quarantine for 14 days.  "
  },
  {
    "code":"US",
    "iso_alpha2": "US",
    "continent": "NA",
    "name": "United States",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 28.07.2020 1. passengers who have transited or have been in austria, belgium, brazil, china (people's rep.), czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, iran, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, slovakia, slovenia, spain, sweden, switzerland or in the united kingdom (excluding overseas territories outside of europe), in the past 14 days are not allowed to enter and transit. -this does not apply to: - nationals and permanent residents of the usa; - spouses of nationals and of permanent residents of the usa; - parents/legal guardians of an unmarried and younger than 21 years national or permanent resident of the usa; - the unmarried and younger than 21 years brother or sister of a national or permanent resident of the usa, who is unmarried and younger than 21 years; - the child/foster child/ward of a national or permanent resident of the usa; - passengers with the following visas: a-1, a-2, c-1, c-1/d, c-2, c-3, cr-1, cr-2, d, e-1 (as an employee of tecro or teco or the employee's immediate family members), g-1, g-2, g-3, g-4, ir-1, ir-4, ih-4, nato-1 through nato-4, or nato-6 visa; - members of the u.s. armed forces, spouses, and children of members of the u.s. armed forces; - passengers with evidence of traveling at the invitation of the usa government for a purpose related to the containment/mitigation of the  (); - passengers with documents issued by the u.s. department of homeland security, u.s. customs and border protection, or u.s. department of state indicating that the passenger is exempt from the restriction; - b1 crew crewmembers that are engaged in lightering, outer continental shelf (ocs) activity, wind farm activity, private air/sea crew and other similar crewmember actives; - students with an f-1 or m-1 visa and their f-2 and m-2 dependents, if they arrive from or have been in ireland (rep.), united kingdom or schengen member states in the past 14 days. 2. passengers who have been in one of the countries listed in bullet number 1 in the past 14 days but are exempt from the restriction to enter the usa, must arrive at one of the following airports: atlanta (atl), boston (bos), chicago (ord), dallas, (dfw), detroit (dtw), ft. lauderdale (fll), honolulu (hnl), houston (iah), los angeles (lax), miami (mia), new york (jfk or ewr), san francisco (sfo), seattle (sea) and washington (iad). 3. passengers who have been in austria, belgium, brazil, china (people's rep.), czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, iran, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, slovakia, slovenia, spain, sweden, switzerland or united kingdom (excluding overseas territories outside of europe) in the past 14 days but are exempt from the restriction to enter the usa, must self-quarantine for 14 days once they reach their final destination. 4. passports issued to nationals of belarus which have expired between 30 april 2020 and 31 july 2020, are considered valid with an extension of 3 months.  "
  },
  {
    "code":"UY",
    "iso_alpha2": "UY",
    "continent": "SA",
    "name": "Uruguay",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 23.07.2020  1. flights to uruguay are suspended. - this does not apply to humanitarian and repatriation flights.  2. passengers are not allowed to enter until 15 august 2020. - this does not apply to nationals and residents of uruguay. 3. passengers are not allowed to transit until 15 august 2020. - this does not apply to nationals and residents of argentina, bolivia, brazil, chile, colombia, ecuador, paraguay, peru, uruguay and venezuela transiting through montevideo (mvd) or punta del este (pdp). 4. nationals and residents of uruguay are subject to quarantine for 14 days. 5. passengers can only land at montevideo (mvd) and punta del este (pdp).  6. passengers and airline crew must have a medical certificate with a negative  () pcr test result issued at most 72 hours before departure. - this does not apply to passengers younger than 6 years.  "
  },
  {
    "code":"UZ",
    "iso_alpha2": "UZ",
    "continent": "AS",
    "name": "Uzbekistan",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 28.07.2020 Flights to Uzbekistan are suspended until 1 August 2020.  "
  },
  {
    "code":"VA",
    "iso_alpha2": "VA",
    "continent": "EU",
    "name": "Vatican",
    "score": "5 (Extreme Warning)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 03.06.2020 1. Passengers are not allowed to enter - This does not apply to: - nationals or residents of Italy; - passengers traveling on business; - passengers traveling for urgent health reasons; - healthcare personnel traveling on duty; - passengers traveling for emergency reasons; - passengers returning via Italy to their country of residence; - passengers arriving from Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom. 2. Residence permits issued by Italy which have expired between 31 January and 31 July 2020, are considered valid until 31 August 2020. 3. Passengers must present a completed self-declaration form to the transporting carrier and must communicate their entry to the Department of Prevention at local health units (ASL) of the entrance district.  - This does not apply to passengers arriving from Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom.  4. Passengers are subject to quarantine for 14 days.  - This does not apply to passengers arriving from Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom.  - This does not apply to passengers traveling on business if their stay in Italy does not exceed 72 hours and if granted, the additional 48 hours of a justified extension for specific needs.  "
  },
  {
    "code":"VC",
    "iso_alpha2": "VC",
    "continent": "NA",
    "name": "Saint Vincent and the Grenadines",
    "score": "2.5 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 23.07.2020 1. passengers must have a medical certificate with a negative  () test result issued at most 5 days before arrival. - this does not apply to passengers arriving from the usa. 2. passengers arriving from the usa: - must have a medical certificate with a negative  () test result issued at most 5 days before arrival; and - are subject to medical screening and quarantine for 5 days. they must have a hotel reservation for this period. 3. a completed pre-arrival form must be presented upon arrival. effective 1 august 2020: passengers arriving from antigua and barbuda, bahamas, barbados, belize, dominica, grenada, guyana, haiti, jamaica, montserrat, st. kitts and nevis, st. lucia, st. vincent and the grenadines, suriname or trinidad and tobago are not required to have a medical certificate with a negative  () test result.  "
  },
  {
    "code":"VE",
    "iso_alpha2": "VE",
    "continent": "SA",
    "name": "Venezuela",
    "score": "4.4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 14.07.2020  Flights to Venezuela are suspended until 12 August 2020. - This does not apply to humanitarian flights.  "
  },
  {
    "code":"VG",
    "iso_alpha2": "VG",
    "continent": "NA",
    "name": "British Virgin Islands",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 04.06.2020 Passengers are not allowed to enter. - This does not apply to residents of Virgin Isl. (British).  "
  },
  {
    "code":"VI",
    "iso_alpha2": "VI",
    "continent": "NA",
    "name": "U.S. Virgin Islands",
    "score": "4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 04.06.2020 Passengers are subject to medical screening and quarantine.  "
  },
  {
    "code":"VN",
    "iso_alpha2": "VN",
    "continent": "AS",
    "name": "Vietnam",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 21.07.2020 1. passengers are not allowed to enter viet nam. - this does not apply to passengers on diplomatic or official duty. they will be subject to mandatory medical declaration and quarantine. - this does not apply to passengers who are experts, business managers or highly skilled workers. they will be subject to mandatory medical declaration and self-isolation. - this does not apply to passengers approved by national steering committee on  prevention and control. 2. for transportation of nationals of viet nam returning to viet nam, airlines must contact the vietnamese diplomatic representative agency in the local country in advance. 3. all passengers will be placed on quarantine at a designated facility for 14 days upon arrival.  4. all visa issuances are suspended. 5. all passengers must fill out a quarantine form prior to arrival.  6. passengers who travel for diplomatic or official purpose will undergo a medical examination at the border.  7. nationals of italy and korea (rep.) with a normal passport are no longer visa exempt.  8. nationals of denmark, finland, france, germany, norway, spain, sweden and passengers with a british passport are no longer visa exempt. 9. passengers with a certificate of visa exemption issued by viet nam are no longer visa exempt if they reside in china (people's rep.), denmark, finland, france, germany, iran, italy, korea (rep.), norway, spain, sweden or united kingdom.  10. nationals of belarus, japan and russian fed. with a normal passport are no longer visa exempt. 11. nationals of belarus, japan and russian fed. with a normal passport and with a certificate of visa exemption issued by viet nam are no longer visa exempt. 12. airline crew are subject to mandatory medical declaration as well as observing self-quarantine during their stay until the next flight schedule.  "
  },
  {
    "code":"VU",
    "iso_alpha2": "VU",
    "continent": "OC",
    "name": "Vanuatu",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 20.07.2020  1. Vanuatu's borders are closed. - This does not apply to humanitarian and repatriation flights. 2. Passengers arriving on repatriation flights are subject to medical screening and quarantine for 14 days. 3. Airline crew are subject to medical screening and quarantine.  "
  },
  {
    "code":"WF",
    "iso_alpha2": "WF",
    "continent": "OC",
    "name": "Wallis and Futuna",
    "score": "0 (Information not available)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 01.04.2020 Flights to New Caledonia are suspended.  "
  },
  {
    "code":"WS",
    "iso_alpha2": "WS",
    "continent": "OC",
    "name": "Samoa",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 21.03.2020  1. all travelers, including returning residents entering samoa, must have a medical certificate issued by a registered medical practitioner issued within 3 days before their arrival into samoa.  2. passengers who have transited through or have been in australia, austria, bahrain, belgium, canada, china (people’s rep.), chinese taipei, czechia, denmark, france, germany, greece, hong kong (sar china), iceland, italy, iran, japan, korea (rep.), kuwait, luxembourg, macao (sar china), malaysia, netherlands, norway, qatar, singapore, spain, sweden, switzerland, thailand, united arab emirates or usa are not allowed to enter samoa. passengers must: a) spend at least 14 days in self-quarantine in a country of last port and must have a medical clearance within (3) days prior to final route to samoa. this must be their final stop before travelling to samoa.  b) provide proof of test results done within 5 days for the  (). passengers with  () positive test will not be allowed to enter samoa. 3. all travelers, including returning residents entering samoa, are required to undergo medical examination by a registered medical practitioner within 3 days before arrival. medical clearance report is required for check-in prior to issuing of boarding passes.  4. all travelers entering samoa, including samoan passport holders who are permanent residents of american samoa, are required to have medical examination within 3 days before entering. it has to be signed by the attending physician and counter-signed by the motusa tuileama nua, director of public health, american samoa.  5. compulsory screening of all arriving passengers and crew to samoa is in effect at all ports of entry. all are required to comply and produce additional documents when asked.  6. a special health declaration card has to be filled out by all passengers inflight or on arrival in to samoa.  "
  },
  {
    "code":"XK",
    "iso_alpha2": "YE",
    "continent": "AS",
    "name": "Yemen",
    "score": "5 (Extreme Warning)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 07.07.2020 1. Passengers are subject to medical screening.  "
  },
  {
    "code":"YT",
    "iso_alpha2": "YT",
    "continent": "AF",
    "name": "Mayotte",
    "score": "4 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"published 29.07.2020  1. a completed international travel certificate must be presented prior to boarding and to immigration upon arrival or when transiting mayotte. the certificate can be obtained at consulates or at <a target=_blank href=https://www.interieur.gouv.fr/>https://www.interieur.gouv.fr</a>.  2. passengers must go through a medical examination upon arrival and are subject to quarantine for a period of 14 days. - this does not apply to healthcare professionals related to  ().  "
  },
  {
    "code":"ZA",
    "iso_alpha2": "ZA",
    "continent": "AF",
    "name": "South Africa",
    "score": "3.6 (High Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 12.06.2020 1. Flights to South Africa are suspended. - This does not apply to repatriation, medevac and emergency flights. 2. Nationals and residents of South Africa are subject to medical screening and quarantine for 21 days.  "
  },
  {
    "code":"ZM",
    "iso_alpha2": "ZM",
    "continent": "AF",
    "name": "Zambia",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 28.07.2020 1. All flights must arrive at Lusaka (LUN). 2. Passengers and airline crew are subject to quarantine for at least 14 days at their own expense.  "
  },
  {
    "code":"ZW",
    "iso_alpha2": "ZW",
    "continent": "AF",
    "name": "Zimbabwe",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-29 07:21:44",
    "description":"Published 19.05.2020 1. Except for BUQ, HRE and VFA, airports are closed. 2. BUQ, HRE and VFA airports are open for the following flights: - flights carrying staff for essential services or sick persons to hospitals and other health care providers;  - flights carrying a member of the staff of a foreign mission or agency going to or from such mission or agency, or a citizen, resident or protected subject of a foreign country going to or from a foreign mission of the country of which he or she is the citizen, resident or subject, for the purpose of obtaining services or assistance at such mission; - flights carrying police, defence forces personnel and other enforcement officers.  If any new travel restrictions will be imposed, we will ensure that Timatic is updated accordingly. We are monitoring this outbreak very closely and we will keep you posted on the developments."
  }
]