{
  "results": [
    {
      "code": "AD",
      "iso_alpha2": "AD",
      "continent": "EU",
      "name": "Andorra",
      "score": 2.8,
      "updated": "2020-06-23 07:21:28",
      "description": "Published 12.05.2020 Please see Coronavirus (COVID-19) regulations for France or Spain, whichever is transited to enter Andorra.  "
    },
    {
      "code": "AE",
      "iso_alpha2": "AE",
      "continent": "AS",
      "name": "United Arab Emirates",
      "score": 3.1,
      "updated": "2020-06-23 07:21:28",
      "description": "Published 15.06.2020 1. Flights to the United Arab Emirates are suspended. - This does not apply to the following: - aircraft operated for the purpose of evacuation (this Safety Decision does not alleviate the need for obtaining necessary authorisation from UAE Ministry of Foreign Affairs and International Cooperation); - UAE registered aircraft that are out of base on 24 March 2020 23:59 Local Time will be allowed to return to base carrying only UAE nationals and operator’s crewmembers; - over-flights.  2. All Evacuation flights must have PAX APP data and Crew APP data; all ferry flights must have crew APP data. 3. Residents of United Arab Emirates: - must have a Resident Entry Permit obtained before departure at <a href=http://Smartservice.ica.gov.ae>http://Smartservice.ica.gov.ae</a> , and - are subject to medical screening and quarantine. 4. A completed self-declaration health form must be presented upon arrival at Dubai (DXB).  "
    },
    {
      "code": "AF",
      "iso_alpha2": "AF",
      "continent": "AS",
      "name": "Afghanistan",
      "score": 5,
      "updated": "2020-06-23 07:21:28",
      "description": "Published 24.04.2020 Flights to Afghanistan are suspended. - This does not apply to repatriation flights that bring back nationals of Afghanistan.  "
    },
    {
      "code": "AG",
      "iso_alpha2": "AG",
      "continent": "NA",
      "name": "Antigua and Barbuda",
      "score": 3,
      "updated": "2020-06-23 07:21:28",
      "description": "Published 17.06.2020  1. Passengers arriving in Antigua and Barbuda:  - are subject to medical screening; and - must present a completed health declaration form. 2. Passengers and airline crew staying overnight in transit are subject to self-isolation.  "
    }
  ]
}