[
  {
    "code":"AD",
    "iso_alpha2": "AD",
    "continent": "EU",
    "name": "Andorra",
    "score": "2.8 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 12.05.2020 please see  () regulations for france or spain, whichever is transited to enter andorra.  "
  },
  {
    "code":"AE",
    "iso_alpha2": "AE",
    "continent": "AS",
    "name": "United Arab Emirates",
    "score": "3.1 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 30.06.2020 1. passengers are not allowed to enter. - this does not apply to nationals of united arab emirates.  - this does not apply to residents of united arab emirates. - this does not apply to nationals of bahrain, kuwait, oman and saudi arabia with a united arab emirates identity card arriving at dubai (dxb) until 7 july 2020. - effective 7 july 2020: this does not apply to passengers traveling as tourists at dubai (dxb). 2. all evacuation flights must have pax app data and crew app data; all ferry flights must have crew app data. 3. residents of united arab emirates: - must have a resident entry permit obtained before departure at <a href=http://smartservice.ica.gov.ae>http://smartservice.ica.gov.ae</a> ; and - are subject to medical screening and quarantine; and - effective 1 july 2020, must have a medical certificate with a negative  () test result issued at most 72 hours before departure. 4. a completed self-declaration health form must be presented upon arrival at dubai (dxb). 5. effective 7 july 2020: passengers traveling as tourists arriving at dubai (dxb) must have: - a medical certificate with a negative  () test result issued at most 96 hours before departure, and - a health insurance.  "
  },
  {
    "code":"AF",
    "iso_alpha2": "AF",
    "continent": "AS",
    "name": "Afghanistan",
    "score": "5 (Extreme Warning)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 25.06.2020 Flights to Afghanistan restarted.  "
  },
  {
    "code":"AG",
    "iso_alpha2": "AG",
    "continent": "NA",
    "name": "Antigua and Barbuda",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 03.07.2020 1. passengers arriving in antigua and barbuda:  - are subject to medical screening; and - must present a completed health declaration form. 2. passengers and airline crew staying overnight in transit are subject to self-isolation. 3. passengers must have a medical certificate with a negative  () pcr test result issued at most 7 days before departure.  "
  },
  {
    "code":"AI",
    "iso_alpha2": "AI",
    "continent": "NA",
    "name": "Anguilla",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 01.07.2020 Airports in Anguilla are closed.   "
  },
  {
    "code":"AL",
    "iso_alpha2": "AL",
    "continent": "EU",
    "name": "Albania",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 02.07.2020   () entry regulations lifted on 1 july 2020.   "
  },
  {
    "code":"AM",
    "iso_alpha2": "AM",
    "continent": "AS",
    "name": "Armenia",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 17.04.2020  1. Passengers are not allowed to enter Armenia. - This does not apply to: - nationals and residents of Armenia; - immediate family members of nationals of Armenia; - diplomats and their immediate family members. 2. Passengers who are allowed to enter Armenia are subject to a 14 day quarantine.  "
  },
  {
    "code":"AO",
    "iso_alpha2": "AO",
    "continent": "AF",
    "name": "Angola",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 25.06.2020  1. Flights to Angola are suspended. - This does not apply to humanitarian flights. 2. Passengers and airline crew are subject to quarantine for 14 days.  "
  },
  {
    "code":"AR",
    "iso_alpha2": "AR",
    "continent": "SA",
    "name": "Argentina",
    "score": "3.1 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 29.06.2020 1. Flights to Argentina are suspended until 17 July 2020. - This does not apply to repatriation and medical flights. 2. Nationals and residents of Argentina are subject to quarantine for 14 days.  "
  },
  {
    "code":"AS",
    "iso_alpha2": "AS",
    "continent": "OC",
    "name": "American Samoa",
    "score": "4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 18.03.2020 1.nationals of the usa and residents of samoa (american) who transited or have been in arizona, california, florida, georgia, hawaii, illinois, massachusetts, new hampshire, new york, north carolina, oregon, rhode island, texas, washington or wisconsin, are subject to public health screening and might be medically or home quarantined.  2.entry permits, issued by samoa (american) instead of visas, are suspended.  - this does not apply to residents of samoa (american) with residence permit or an immigration board approval. 3.passengers arriving from samoa must: - obtain a health clearance from ministry of health (moh) 3 days prior to arrival;  - present a completed “dot travel declaration form upon arrival. 4.passengers who transited or have been in countries affected by  (), when arriving from hawaii, must:  -spend 14 days in hawaii; and -obtain a health clearance 3 days before arrival in samoa (american); and -present a completed “dot travel declaration form upon arrival; and -provide itinerary upon arrival.  "
  },
  {
    "code":"AT",
    "iso_alpha2": "AT",
    "continent": "EU",
    "name": "Austria",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 30.06.2020 1. passengers are not allowed to enter. - this does not apply to nationals of austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden and switzerland and their family members. - this does not apply to passengers with a british passport and their family members. - this does not apply to passengers arriving from belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, monaco, netherlands, norway, poland, portugal, romania, san marino, slovakia, slovenia, spain, sweden, switzerland, united kingdom or vatican city (holy see). - this does not apply to passengers with a d visa issued by austria.  - this does not apply to passengers departing immediately. - this does not apply to passengers traveling on business. 2. passengers are subject to self-quarantine for 14 days. - this does not apply to passengers departing immediately. - this does not apply to passengers arriving from belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany (except guetersloh region), greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, monaco, netherlands, norway, poland, portugal, romania, san marino, slovakia, slovenia, spain, sweden, switzerland, united kingdom or vatican city (holy see). they must not have been in any other country in the past 14 days. - this does not apply to passengers with a medical certificate with a negative  () test result issued at most 4 days before arrival. 3. flights arriving from belarus, china (people's rep.), iran, italy (lombardy region), portugal, russian fed., spain, sweden, ukraine and united kingdom are suspended. 4. for more information, please refer to the website <a href=https://www.bmk.gv.at/service//einreisebestimmungen.html>https://www.bmk.gv.at/service//einreisebestimmungen.html</a> .  "
  },
  {
    "code":"AU",
    "iso_alpha2": "AU",
    "continent": "OC",
    "name": "Australia",
    "score": "2.7 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 02.07.2020 1. Passengers are not allowed to enter Australia.  - This does not apply to nationals of Australia. - This does not apply to the immediate family members of nationals of Australia.  - This does not apply to permanent residents of Australia and their immediate family members.  - This does not apply to nationals of New Zealand residing in Australia. 2. Passengers are required to quarantine for 14 days at the first point of entry. 3. Airline crew are subject to self-isolation until their next flight. 4. Passengers transiting through Australia for 8 to 72 hours, are subject to quarantine until their departing flight. 5. Flights to Melbourne (MEL) are suspended until 15 July 2020.  "
  },
  {
    "code":"AW",
    "iso_alpha2": "AW",
    "continent": "NA",
    "name": "Aruba",
    "score": "2.5 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 01.07.2020 1. passengers are not allowed to enter.  - this does not apply to passengers arriving from albania, anguilla, antigua and barbuda, austria, barbados, belgium, belize, bonaire, st. eustatius and saba, bosnia and herzegovina, bulgaria, canada, cayman isl., croatia, cuba, curacao, cyprus, czechia, denmark, dominica, estonia, finland, france, french west indies, germany, greece, grenada, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, montenegro, montserrat, netherlands, north macedonia (rep.), norway, poland, portugal, puerto rico, romania, serbia, slovakia, slovenia, spain, st. kitts and nevis, st. lucia, st. maarten, st. vincent and the grenadines, sweden, trinidad and tobago and united kingdom. - effective 10 july 2020, this does not apply to passengers arriving from the usa. 2. a completed health assessment form must be submitted on <a href=http://www.edcardaruba.aw/>www.edcardaruba.aw</a> at most 72 hours before departure. a travel authorization must be presented at time of check-in. 3. passengers must have a medical certificate with a negative  () pcr test result issued at most 72 hours before departure. the test must be uploaded at <a href=http://www.edcardaruba.aw/>www.edcardaruba.aw</a> at most 12 hours before departure. passengers without a medical certificate with a negative  () pcr test result must take the test on arrival at their own expense and are subject to quarantine for 1 day. this does not apply to: - passengers younger than 15 years; - passengers traveling for a maximum stay of 1 day. 4. passengers must have a health insurance purchased before departure and available at <a href=http://www.edcardaruba.aw/>www.edcardaruba.aw</a>. this does not apply to: - residents of aruba, bonaire and curacao; - passengers traveling for a maximum stay of 1 day;  - dutch military personnel, their spouse and children.  5. passengers are subject to medical screening.   "
  },
  {
    "code":"AZ",
    "iso_alpha2": "AZ",
    "continent": "AS",
    "name": "Azerbaijan",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 23.06.2020  1. passengers are not allowed to enter azerbaijan until 1 august 2020. - this does not apply to nationals and residents of azerbaijan. 2. passengers must have a medical certificate with a negative  () test result issued at most 48 hours before departure. - this does not apply to nationals of azerbaijan. 3. a completed public health passenger locator form must be presented upon arrival. 4. passengers are subject to medical screening and quarantine for 14 days. 5. suspension of e-visa issuance and visa on arrival facilities.  "
  },
  {
    "code":"BA",
    "iso_alpha2": "BA",
    "continent": "EU",
    "name": "Bosnia and Herzegovina",
    "score": "3.7 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 03.06.2020  passengers are not allowed to enter bosnia and herzegovina.  - this does not apply to: - nationals and residents of bosnia and herzegovina; - nationals of croatia, montenegro and serbia; - spouses and children of nationals of bosnia and herzegovina; - passengers returning via bosnia and herzegovina to their country of residence. they must have a permit issued by the competent authority of bosnia and herzegovina; - passengers traveling on business with an invitation issued by a company based in bosnia and herzegovina. they must have a certificate with a negative  () test result issued at most 48 hours before arrival;  - passengers traveling to participate in a funeral of a family member. they must have a death certificate and are allowed to stay for a maximum of 72 hours;  - passengers in need of emergency medical treatment;  - military forces of the nato and other states participating in the partnership for peace; and to nato and eufor headquarters in bosnia and herzegovina; - heads of state and members of their delegations whose arrival and departure has been announced by the competent authority.  "
  },
  {
    "code":"BB",
    "iso_alpha2": "BB",
    "continent": "NA",
    "name": "Barbados",
    "score": "2.8 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 01.07.2020 1. Barbados (BGI) airport is closed until 11 July 2020.  - This does not apply to medevac flights.  "
  },
  {
    "code":"BD",
    "iso_alpha2": "BD",
    "continent": "AS",
    "name": "Bangladesh",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 06.07.2020 1. suspension of visa on arrival facilities. -this does not apply to passengers traveling on business with a return/onward ticket. they must: - have a confirmation letter issued by the bangladesh board of investment (boi). the letter must contain a boi registration number. the accredited inviting organization must notify the immigration authorities prior to arrival, and - have a medical certificate with a negative  () test result issued at most 72 hours before arrival. 2. flights from bahrain, bhutan, hong kong (sar china), india, kuwait, maldives, nepal, oman, saudi arabia, singapore and thailand to bangladesh are suspended. 3. passengers with a visa must have a medical certificate with a negative  () test result issued at most 72 hours before departure. - this does not apply to passengers with a diplomatic or an official passport and their family members. - this does not apply to passengers with a laissez-passer and their family members. 4. a completed health declaration form must be presented upon arrival. 5. passengers are subject to medical screening and quarantine.  "
  },
  {
    "code":"BE",
    "iso_alpha2": "BE",
    "continent": "EU",
    "name": "Belgium",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 03.07.2020 Passengers are not allowed to enter. This does not apply to: - passengers arriving from EEA Member States or Switzerland; - nationals of Andorra, Monaco, Montenegro, North Macedonia (Rep.), San Marino, Serbia, Switzerland, Vatican City (Holy See) and EEA Member States;  - passengers with a British passport with nationality “British Citizen, “British Overseas Territories Citizen issued by Gibraltar and British Passports with a Certificate of Entitlement to the Right of Abode issued by the United Kingdom;  - passengers with a long-term residence permit or a long term D visa issued by EEA Member States, Switzerland or the United Kingdom, returning via Belgium to their country of residence; - family members of nationals of EEA Member States and Switzerland;  - family members of British nationals; - military personnel.  "
  },
  {
    "code":"BF",
    "iso_alpha2": "BF",
    "continent": "AF",
    "name": "Burkina Faso",
    "score": "3.9 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 23.06.2020 1. Passengers are not allowed to enter. - This does not apply to nationals and residents of Burkina Faso. - This does not apply to humanitarian, medevac and repatriation flights. 2. Passengers are subject to quarantine for 14 days.  "
  },
  {
    "code":"BG",
    "iso_alpha2": "BG",
    "continent": "EU",
    "name": "Bulgaria",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 25.06.2020 1. passengers are not allowed to enter. - this does not apply to nationals of andorra, austria, belgium, bosnia and herzegovina, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, monaco, montenegro, netherlands, norway, poland, portugal, romania, san marino, serbia, slovakia, slovenia, spain, sweden, switzerland and vatican city (holy see). - this does not apply to passengers with a british passport. - this does not apply to family members of nationals of bulgaria. - this does not apply to passengers with a permanent or long term residence permit issued by bulgaria and their family members. - this does not apply to nationals and residents of turkey returning via bulgaria to their country of residence.  - this does not apply to nationals and residents of north macedonia (rep.) returning via bulgaria to their country of residence.  - this does not apply to nationals and residents of montenegro returning via bulgaria to their country of residence. - this does not apply to passengers with a long-term residence permit issued by an eu member state returning via bulgaria to their country of residence. - this does not apply to passengers with an alien's passport issued by estonia and latvia.  - this does not apply to military personnel. 2. passengers are subject to quarantine for 14 days. 3. all passports and national id cards issued to nationals of bulgaria and which have expired on 13 march 2020 or later, are considered valid with a prolongation of 6 months. this is due to the  () pandemic.  "
  },
  {
    "code":"BH",
    "iso_alpha2": "BH",
    "continent": "AS",
    "name": "Bahrain",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 01.07.2020  1. suspension of visa on arrival facilities. - this does not apply to passengers with a diplomatic, official, service or united nations passport. 2. passengers are not allowed to enter. - this does not apply to: - nationals of bahrain and residents of bahrain; - nationals of kuwait, oman, saudi arabia and united arab emirates; - military personnel. 3. passengers are subject to medical screening and quarantine. 4. border crossing on the causeway is suspended due to  ().   "
  },
  {
    "code":"BI",
    "iso_alpha2": "BI",
    "continent": "AF",
    "name": "Burundi",
    "score": "4.8 (Extreme Warning)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 21.04.2020 Flights to Burundi are suspended.  <p> "
  },
  {
    "code":"BJ",
    "iso_alpha2": "BL",
    "continent": "NA",
    "name": "Saint Barthélemy",
    "score": "4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 24.06.2020  Passengers are subject to medical screening at their own expense.  "
  },
  {
    "code":"BM",
    "iso_alpha2": "BM",
    "continent": "NA",
    "name": "Bermuda",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 01.07.2020 1 passengers must complete an online travel authorization before departure and must have a health insurance. 2. passengers aged 10 years and older: - are subject to medical screening and quarantine until results are ready; and - must have a medical certificate with a negative  () test result issued at most 5 days before departure.  3. passengers who reside in bermuda and who do not have the medical certificate with a negative  () test result, are subject to quarantine for 3 days and a second test on the third day. if test result is positive, passengers are isolated for 14 days.  "
  },
  {
    "code":"BN",
    "iso_alpha2": "BN",
    "continent": "AS",
    "name": "Brunei",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 20.04.2020  1. passengers are not allowed to transit or enter brunei darussalam. - this does not apply to nationals and residents of brunei darussalam. 2. all visa exemptions and visa on arrival are temporarily suspended. 3. all visa issued to passengers are temporarily suspended. 4. special consideration is only given by the brunei immigration department which is subject to the affairs of interest to brunei darussalam by applying to the brunei immigration department by downloading the form provided on the department’s website at <a href=http://www.immigration.gov.bn/>www.immigration.gov.bn</a> . passengers with a special consideration are subject to  () testing that has a cost of bnd1000.  "
  },
  {
    "code":"BO",
    "iso_alpha2": "BO",
    "continent": "SA",
    "name": "Bolivia",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 02.07.2020 1. passengers and airline crew are not allowed to enter bolivia until 31 july 2020. - this does not apply to nationals and residents of bolivia.  - this does not apply to airline crew of airlines of bolivia or humanitarian flights. 2. nationals and residents of bolivia are subject to quarantine. 3. airline crew who are allowed to enter must have a medical certificate with a negative  () test result.  "
  },
  {
    "code":"BQ",
    "iso_alpha2": "BO",
    "continent": "SA",
    "name": "Bolivia",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 22.06.2020 Flights to Bonaire, St. Eustatius and Saba are suspended until 1 July 2020.  "
  },
  {
    "code":"BR",
    "iso_alpha2": "BR",
    "continent": "SA",
    "name": "Brazil",
    "score": "3.6 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 23.06.2020 Passengers are not allowed to enter until 4 July 2020.  - This does not apply to nationals and residents of Brazil. - This does not apply to immediate family member of a national of Brazil. Spouses of a national of Brazil must have a Brazilian marriage certificate. If the certificate is not issued by Brazil, it must be apostilled by a consulate. A non-official translation in Portuguese is also required.  "
  },
  {
    "code":"BS",
    "iso_alpha2": "BS",
    "continent": "NA",
    "name": "Bahamas",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 01.07.2020  1. passengers must have a medical certificate with a negative  () pcr test result issued at most 10 days before arrival. - this does not apply to nationals and residents of bahamas arriving from antigua and barbuda, barbados, belize, dominica, grenada, guyana, haiti, jamaica, montserrat, st. kitts and nevis, st. lucia, st. vincent and the grenadines, suriname or trinidad and tobago. - this does not apply to nationals and residents of bahamas with a proof that a  () pcr test was not available in the country of departure. - this does not apply to passengers younger than 2 years. 2. a completed bahamas health visa card must be presented on arrival. the form can be found at <a href=https://travel.gov.bs/>https://travel.gov.bs/</a>. 3. nationals and residents of bahamas arriving without a proof of a  () pcr test are subject to quarantine for 14 days.  "
  },
  {
    "code":"BT",
    "iso_alpha2": "BT",
    "continent": "AS",
    "name": "Bhutan",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 20.04.2020 1. visa on arrival is suspended. 2. passengers with a visa, work permit or other immigration permits issued by bhutan and airline crew are not allowed to enter bhutan if they arrive from or have visited or transited through a  () affected country. 3. airline crew are subject to thermal screening on arrival.  "
  },
  {
    "code":"BW",
    "iso_alpha2": "BW",
    "continent": "AF",
    "name": "Botswana",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 04.06.2020 Airports in Botswana are closed.  "
  },
  {
    "code":"BY",
    "iso_alpha2": "BY",
    "continent": "EU",
    "name": "Belarus",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 02.07.2020 1. A completed awareness questionnaire must be presented upon arrival. - This does not apply to passengers in transit. 2. Passengers are subject to quarantine for 14 days.  "
  },
  {
    "code":"BZ",
    "iso_alpha2": "BZ",
    "continent": "NA",
    "name": "Belize",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 29.06.2020  Airports in Belize are closed until 14 August 2020. - This does not apply to nationals of Belize. - This does not apply to residents of Belize.  "
  },
  {
    "code":"CA",
    "iso_alpha2": "CC",
    "continent": "SA",
    "name": "Cocos Islands",
    "score": "0 (Information not available)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 10.06.2020 1. passengers are not allowed to enter canada. - this does not apply to nationals of canada. - this does not apply to passengers arriving from the usa. they must travel for a non-discretionary or non-optional purpose. - this does not apply to permanent residents of canada and their immediate family members. - this does not apply to diplomats. - this does not apply to seasonal agricultural workers, fish/seafood workers, caregivers and all other temporary foreign workers. - this does not apply to international students who held a valid study permit, or had been approved for a study permit, when the travel restrictions took effect on march 18, 2020. - this does not apply to permanent resident applicants who had been approved for permanent residence before the travel restrictions were announced on march 18, 2020, but who had not yet travelled to canada. - this does not apply to immediate family members of nationals of canada, which include: a. the spouse or common-law partner of the person; b. a dependent child of the person or of the person's spouse or common-law partner; c. a dependent child of a dependent child referred to in paragraph b; d. the parent or step-parent of the person or of the person's spouse or common-law partner; or e. the guardian or tutor of the person. (membre de la famille immediate). - this does not apply to the following passengers: a. person registered as an indian under the indian act; b. person authorized in writing by a consular officer of the government of canada to come to canada to reunite with immediate family members; c. person who is exempt from the requirements to obtain a temporary resident visa under paragraph 190 (2)(a) of the immigration and refugee protection regulations, and their immediate family members; d. person who enters canada at the invitation of the minister of health for the purpose of assisting in the  response; e. person who arrives by means of an aircraft operated by canadian forces or the department of national defence; f. member of the canadian forces or a visiting force, as defined in section 2 of the visiting forces act, and their immediate family members; g. protected person, under section 95 (2) of the immigration and refugee protection act; h. french citizen who resides in saint-pierre-et-miquelon; i. person or class of persons that the chief public health officer, appointed under subsection 6 (1) of the public health agency of canada act, determines does not pose a risk of significant harm to public health or who will provide an essential service while in canada; j. person whom the minister of foreign affairs, the minister of citizenship and immigration or the minister of public safety and emergency preparedness determines their presence is in the national interest. 2. passengers with  () symptoms are not allowed to board a plane to canada. passengers with  () symptoms on arrival will be referred to public health agency of canada. 3. passengers who have been refused boarding in the past 14 days due to a medical reason related to  () are not allowed to enter. 4. passengers must travel to canada for essential purposes. non-essential purposes include tourism, sightseeing, recreation, entertainment, social visits and religious functions. - this does not apply to nationals of canada. - this does not apply to permanent residents of canada. - this does not apply to persons registered as an indian under the indian act. 5. passengers must have a quarantine plan upon arrival and are required to quarantine for a period of 14 days. 6. passengers who were in the cruise ship 'diamond princess' are subject to a mandatory 14-day isolation at a quarantine facility upon arrival in canada. 7. passports issued to nationals of north macedonia (rep.) which have expired on 18 march 2020 or later, are considered valid until 31 july 2020. 8. passengers must arrive at one of the following airports: calgary (yyc), montreal (yul), toronto (yyz), vancouver (yvr).  "
  },
  {
    "code":"CD",
    "iso_alpha2": "CD",
    "continent": "AF",
    "name": "Democratic Republic of the Congo",
    "score": "3.9 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 22.04.2020 1. Flights to Congo (Dem. Rep.) are suspended. - This does not apply to pre-approved repatriation flights. 2. Passengers and airline crew must go through medical screening upon arrival and present a completed Health Sanitary Card provided by Health Authorities.  "
  },
  {
    "code":"CF",
    "iso_alpha2": "CF",
    "continent": "AF",
    "name": "Central African Republic",
    "score": "5 (Extreme Warning)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 26.05.2020 1. bangui (bgf) is closed.  - this does not apply to: - emergency flights; - technical landings;  - humanitarian, medevac and repatriation flights;  - flights with a special authorization 2. airline crew are subject to mandatory quarantine for the duration of their rotation or rest period. 3. passengers arriving from a country with local transmission of  () must self-quarantine for 21 days upon arrival.  "
  },
  {
    "code":"CG",
    "iso_alpha2": "CG",
    "continent": "AF",
    "name": "Republic of the Congo",
    "score": "2.8 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 26.03.2020 Airports in Congo are closed.  "
  },
  {
    "code":"CH",
    "iso_alpha2": "CH",
    "continent": "EU",
    "name": "Switzerland",
    "score": "4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 30.06.2020 1. Passengers are not allowed to enter. - This does not apply to passengers arriving from Schengen Member States. - This does not apply to nationals or residents of Switzerland or Liechtenstein. - This does not apply to nationals of EEA Member States. - This does not apply to British nationals. - This does not apply to family members of nationals of EEA Member States. They must present proof of their relationship. - This does not apply to family members of British nationals. They must present proof of their relationship.  - This does not apply to residents of Schengen Member States returning directly via Switzerland to their country of residence.  2. Passengers are not allowed to transit if arriving from a non-Schengen Member State to another Schengen Member State. - This does not apply to nationals of EEA Member States and Switzerland. - This does not apply to British nationals. - This does not apply to family members of nationals of EEA Member States and Switzerland. - This does not apply to family members of British nationals. - This does not apply to residents of EEA Member States and Switzerland. - This does not apply to passengers with a visa issued after 16 March 2020 by Switzerland.  "
  },
  {
    "code":"CI",
    "iso_alpha2": "CI",
    "continent": "AF",
    "name": "Ivory Coast",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 02.06.2020 1. Flights to Cote d'Ivoire are suspended. - This does not apply to aircraft in state of emergency. - This does not apply to humanitarian flights (medevac, repatriation flights). 2. Airline crew are subject to quarantine.  "
  },
  {
    "code":"CK",
    "iso_alpha2": "CK",
    "continent": "OC",
    "name": "Cook Islands",
    "score": "4.5 (Extreme Warning)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 18.06.2020  Passengers are not allowed to enter. - This does not apply to Cook Islanders, passengers with a residence permit or an entry permit issued by the Cook Isl. They must have stayed in New Zealand for 30 consecutive days before they enter the Cook. Isl.  "
  },
  {
    "code":"CL",
    "iso_alpha2": "CL",
    "continent": "SA",
    "name": "Chile",
    "score": "3.6 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 03.07.2020  1. passengers are not allowed to enter until 9 july 2020. - this does not apply to nationals and residents of chile. 2. nationals and residents of chile are subject to quarantine for 14 days. 3. a completed affidavit for travellers to prevent  diseases () must be submitted before departure at <a href=https://www.c19.cl/formularios.html>https://www.c19.cl/formularios.html</a> .  "
  },
  {
    "code":"CM",
    "iso_alpha2": "CM",
    "continent": "AF",
    "name": "Cameroon",
    "score": "3.1 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 02.06.2020 1. Flights to Cameroon are suspended. - This does not apply to aircraft in state of emergency. - This does not apply to humanitarian flights (medevac, repatriation flights). 2. Airline crew are subject to quarantine.  "
  },
  {
    "code":"CN",
    "iso_alpha2": "CN",
    "continent": "AS",
    "name": "China",
    "score": "4.1 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 12.06.2020 1. The mainland of China has decided to temporarily suspend the entry into the mainland of China by foreign nationals holding visas or residence permits still valid to the time of this announcement, effective from 00:00 local time, 28 March 2020. Entry by foreign nationals with APEC Business Travel Cards will be suspended as well.  - Policies including port visas, 24/72/144-hour visa-free transit policy, Hainan 30-day visa-free policy, 15-day visa-free policy specified for foreign cruise-group-tour through Shanghai Port, Guangdong 144-hour visa-free policy specified for foreign tour groups from Hong Kong or Macao SAR, and Guangxi 15-day visa-free policy specified for foreign tour groups of ASEAN countries will also be temporarily suspended. Entry with diplomatic, service, courtesy or C visas will not be affected.  - Foreign nationals coming to the mainland of China for necessary economic, trade, scientific or technological activities or out of emergency humanitarian needs may apply for visas at Chinese embassies or consulates.  - Entry by foreign nationals with visas issued after this announcement will not be affected. 2. All passengers arriving at PEK will have a PCR test and be quarantined at the designated location in Beijing for 14 days.  3. Passengers arriving at Shanghai Pudong (PVG) or Shanghai Hongqiao (SHA) must undergo a Nucleic Acid Test (NAT) and a 14-day quarantine in designated places for medical observation. 4. Passengers who live in or have been in France, Germany, Iran, Italy, Japan, Korea (Rep.), Spain or USA in the past 14 days arriving at Guangzhou (CAN) or Shenzhen (SZX) must undergo 14-day quarantine at home or in designated places for medical observation. All passengers arriving at SZX will have a PCR test. 5. All passengers arriving at XMN will be quarantined for medical observation at the designated hotels for 14 days on their own expenses. - This does not apply to passengers under 18 years old, passengers above 70 years old, pregnant women and passengers suffering from illness. They must apply for permission to undergo a 14-day quarantine at home. 6. Airline crew of foreign airlines: - are not required to undergo nucleic acid test if they have a short stay after landing then depart immediately, and do not leave apron during the transition; OR - shall receive nucleic acid test in the first port of entry if they need to enter the country to rest or continue to operate domestic routes. The test results will be confirmed by the local government in accordance with the requirements of epidemic prevention management. Only if the test results are negative, crews can continue the operations; OR - are allowed to return to their home country for isolation treatment when agreed by the local joint control mechanism, if they are symptomatic, in close contact with infected persons or tested positive. Airlines and crews shall make all commitments to bear their responsibilities and also carry out strict protections. 7. A completed “Health Declaration Form must be presented upon arrival. The form can be obtained before departure at <a href=http://health.customsapp.com/>http://health.customsapp.com/</a> . 8. Nationals of China (People's Rep.) must present a green  code generated from reporting health information in a Wechat mini program.  "
  },
  {
    "code":"CO",
    "iso_alpha2": "CO",
    "continent": "SA",
    "name": "Colombia",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 01.07.2020 1. flights to colombia are suspended until 31 august 2020. - this does not apply to humanitarian flights. 2. passengers are not allowed to enter or transit colombia. - this does not apply to: - nationals and residents of colombia; - passengers with a diplomatic passport. 3. passengers are subject to quarantine for 14 days. 4. airline crew are subject to quarantine until their next flight.  5. a “control preventivo contra el  must be completed prior to arrival.  "
  },
  {
    "code":"CR",
    "iso_alpha2": "CR",
    "continent": "NA",
    "name": "Costa Rica",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 02.07.2020 1. Passengers are not allowed to enter until 1 August 2020. - This does not apply to nationals of Costa Rica. - This does not apply to passengers who have left Costa Rica before 25 March 2020 and have: - permanent residence in Costa Rica; or - temporary residence in Costa Rica; or - special category (Categoria Especial); or - non-resident subcategory Stay (No Residente subcategoria Estancia). 2. Nationals and residents of Costa Rica are subject to isolation for 14 days. 3. Epidemiological Form must be completed at <a target=_blank href=https://ccss.now.sh/>https://ccss.now.sh/</a> before departure.  "
  },
  {
    "code":"CU",
    "iso_alpha2": "CU",
    "continent": "NA",
    "name": "Cuba",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 01.07.2020 1. Flights to Cuba are suspended. - This does not apply to humanitarian flights. - This does not apply to flights landing in Cayo Coco (CCC), Cayo Largo del Sur (CYO) or Santa Clara (SNU). 2. Passengers are subject to quarantine for 14 days. - This does not apply to passengers arriving in Cayo Coco (CCC), Cayo Largo del Sur (CYO) or Santa Clara (SNU).  "
  },
  {
    "code":"CV",
    "iso_alpha2": "CV",
    "continent": "AF",
    "name": "Cape Verde",
    "score": "2.8 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 22.04.2020 Flights to Cape Verde are suspended. - This does not apply to special, repatriation and humanitarian flights.  "
  },
  {
    "code":"CW",
    "iso_alpha2": "CX",
    "continent": "OC",
    "name": "Christmas Island",
    "score": "0 (Information not available)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 22.06.2020 1. Passengers are not allowed to enter and transit. - This does not apply to passengers with a residence permit issued by Curacao. - This does not apply to passengers arriving from Aruba, Bonaire, St. Eustatius and Saba and St. Maarten. 2. Passengers arriving from Aruba, Bonaire, St. Eustatius and Saba and St. Maarten must complete a health declaration form on arrival. They are subject to medical screening. 3. Passengers arriving from Aruba, Bonaire, St. Eustatius and Saba and St. Maarten must have an insurance to cover medical expenses in Curacao.   "
  },
  {
    "code":"CY",
    "iso_alpha2": "CY",
    "continent": "EU",
    "name": "Cyprus",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 25.06.2020 1. passengers are not allowed to enter cyprus.  - this does not apply to passengers arriving from australia, austria, belgium, bulgaria, croatia, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), israel, italy, jordan, korea (rep.), latvia, lebanon, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, romania, slovakia, slovenia, spain, switzerland or united arab emirates. - this does not apply to residents of cyprus. - this does not apply to nationals of cyprus arriving from a country other than australia, austria, belgium, bulgaria, croatia, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), israel, italy, jordan, korea (rep.), latvia, lebanon, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, romania, slovakia, slovenia, spain, switzerland or united arab emirates if they reside in cyprus. - this does not apply to family members of nationals of cyprus arriving from a country other than australia, austria, belgium, bulgaria, croatia, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), israel, italy, jordan, korea (rep.), latvia, lebanon, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, romania, slovakia, slovenia, spain, switzerland or united arab emirates if the national of cyprus resides in cyprus. 2. passengers who have been in a country other than australia, austria, belgium, bulgaria, croatia, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), israel, italy, jordan, korea (rep.), latvia, lebanon, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, romania, slovakia, slovenia, spain, switzerland or united arab emirates in the past 14 days are not allowed to enter.  - this does not apply to nationals and residents of cyprus. - this does not apply to family members of nationals of cyprus. 3. passengers must have a cyprus flight pass obtained before departure at <a target=_blank href=https://www.cyprusflightpass.gov.cy/>https://www.cyprusflightpass.gov.cy</a> . 4. passengers arriving from belgium, france, ireland (rep.), israel, italy, jordan, lebanon, netherlands, poland, romania, spain or united arab emirates must have a medical certificate stating a negative  () test result issued at most 72 hours before departure. - nationals and residents of cyprus are subject to a  () test if they do not have this medical certificate. 5. nationals and residents of cyprus arriving from a country other than australia, austria, belgium, bulgaria, croatia, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), israel, italy, jordan, korea (rep.), latvia, lebanon, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, romania, slovakia, slovenia, spain, switzerland or united arab emirates are subject to a  () test and quarantine. 6. family members of nationals of cyprus arriving from a country other than australia, austria, belgium, bulgaria, croatia, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), israel, italy, jordan, korea (rep.), latvia, lebanon, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, romania, slovakia, slovenia, spain, switzerland or united arab emirates are subject to a  () test and quarantine.  "
  },
  {
    "code":"CZ",
    "iso_alpha2": "CZ",
    "continent": "EU",
    "name": "Czech Republic",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 01.07.2020 1. passengers are not allowed to enter.  - this does not apply to: - nationals of czechia;  - british nationals and nationals of andorra, austria, belgium, bulgaria, croatia, cyprus, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, monaco, montenegro, netherlands, norway, poland, portugal, romania, san marino, serbia, slovakia, slovenia, spain, sweden, switzerland and vatican city (holy see); - passengers with a residence permit issued by czechia; - passengers with a long-term residence permit issued by andorra, austria, belgium, bulgaria, croatia, cyprus, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, monaco, montenegro, netherlands, norway, poland, portugal, romania, san marino, serbia, slovakia, slovenia, spain, sweden, switzerland, united kingdom and vatican city (holy see); - spouses of british nationals or of nationals of andorra, monaco, san marino, switzerland, vatican city (holy see) and an eea member state residing in czechia. they must have an original marriage certificate or a copy (or a proof of the registered partnership) and a copy of the residence permit issued by czechia or a document confirming the residence in czechia, such as a lease contract or a copy of the czech national id card of the resident of czechia; - passengers younger than 21 years who are children of british nationals or of nationals of andorra, monaco, san marino, switzerland, vatican city (holy see) and an eea member state residing in czechia. they must have an original birth certificate or a copy, and a copy of the residence permit of the parent or a document confirming the residence in czechia, such as a lease contract or a copy of the czech national id card of the parent; - passengers with a d visa issued by czechia; - passengers with a c visa issued by czechia after 11 may 2020. 2. passengers must have a medical certificate with a negative  () pcr test result issued on arrival. - this does not apply to passengers arriving from andorra, austria, belgium, bulgaria, croatia, cyprus, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, monaco, montenegro, netherlands, norway, poland, portugal, romania, san marino, serbia, slovakia, slovenia, spain, sweden, switzerland, united kingdom or vatican city (holy see).   "
  },
  {
    "code":"DE",
    "iso_alpha2": "DE",
    "continent": "EU",
    "name": "Germany",
    "score": "3.1 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 03.07.2020 1. Passengers are not allowed to enter. This does not apply to: - passengers arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom; - nationals of Germany; - passengers with a residence permit issued by Germany; - residents of Australia, Canada, Georgia, Montenegro, New Zealand, Thailand, Tunisia and Uruguay; - passengers with a D Visa issued by Germany; - husband, wife, child and registered partner of nationals or residents of Germany; - nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland and their family members returning via Germany to their country of residence; - British nationals and their family members returning via Germany to their country of residence; - passengers in transit to their home country, if there is no other travel option. The purpose of travel and the entry requirements for the destination and transit countries must be proved; - US military personnel stationed in Germany and their family members； - merchant seamen who are going to sign up on board or leave Germany for the purpose of repatriation. 2. Passengers are not allowed to transit if arriving from a non-Schengen Member State to another Schengen Member State. - This does not apply to nationals of EEA Member States and Switzerland. - This does not apply to British nationals. - This does not apply to family members of nationals of EEA Member States and Switzerland. - This does not apply to family members of British nationals. - This does not apply to residents of EEA Member States and Switzerland. 3. For more information, please refer to the website <a href=https://www.bundespolizei.de/Web/DE/04Aktuelles/01Meldungen/2020/03/200317_faq.html;jsessionid=97A3BB54ABD2E6A6A7D1D39F30BEC55C.2_cid324?nn=5931604#doc13824392bodyText2>https://www.bundespolizei.de/Web/DE/04Aktuelles/01Meldungen/2020/03/200317_faq.html;jsessionid=97A3BB54ABD2E6A6A7D1D39F30BEC55C.2_cid324?nn=5931604#doc13824392bodyText2</a> . 4. Passengers are subject to quarantine for 14 days.   "
  },
  {
    "code":"DJ",
    "iso_alpha2": "DJ",
    "continent": "AF",
    "name": "Djibouti",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 24.03.2020 Flights to Djibouti are suspended.  "
  },
  {
    "code":"DK",
    "iso_alpha2": "DK",
    "continent": "EU",
    "name": "Denmark",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 29.06.2020 Passengers are not allowed to enter. -This does not apply to: - nationals and residents of Denmark; - residents of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Romania, Slovakia, Slovenia, Spain, Switzerland and United Kingdom; - residents of the Vasterbotten region in Sweden; - spouse, partner, parent or child of nationals of Denmark residing in Denmark;  - spouse, partner, parent or child of nationals of Denmark not residing in Denmark. They must travel together; - spouse, partner, parent or child of residents of Denmark; - passengers returning directly via Denmark to their country of residence;  "
  },
  {
    "code":"DM",
    "iso_alpha2": "DM",
    "continent": "NA",
    "name": "Dominica",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 16.04.2020 1.Passengers are not allowed to enter Dominica. -This does not apply to nationals of Dominica who will be placed in a 14-day mandatory quarantine.  2.Airline crew is not allowed to disembark.  "
  },
  {
    "code":"DO",
    "iso_alpha2": "DO",
    "continent": "NA",
    "name": "Dominican Republic",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 02.07.2020 1. Flights to Dominican Rep. restarted. 2. Passengers are subject to medical screening and must have a completed health declaration form.</p><p/>"
  },
  {
    "code":"DZ",
    "iso_alpha2": "DZ",
    "continent": "AF",
    "name": "Algeria",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 17.04.2020 Flights to Algeria are suspended.  "
  },
  {
    "code":"EC",
    "iso_alpha2": "EC",
    "continent": "SA",
    "name": "Ecuador",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 15.06.2020  1. Passengers are subject to medical screening and self-quarantine for 14 days. 2. A completed Declaracion de salud del viajero and Formulario migratorio especial must be presented upon arrival.  "
  },
  {
    "code":"EE",
    "iso_alpha2": "EE",
    "continent": "EU",
    "name": "Estonia",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 03.06.2020 1. passengers are not allowed to enter estonia. -this does not apply to:  - nationals and residents of estonia; - parent, child or spouse of nationals or residents of estonia; - passengers arriving from austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland or united kingdom. they must have no symptoms of illness and have stayed in those countries in the last 14 days; - nationals and residents of latvia and lithuania; - passengers who are entering estonia in order to go back home. they must not show any symptoms of  (); - nationals and residents of latvia who work in estonia. they must not show any symptoms of  (). 2. passengers are subject to quarantine.  "
  },
  {
    "code":"EG",
    "iso_alpha2": "EH",
    "continent": "AF",
    "name": "Western Sahara",
    "score": "0 (Information not available)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 01.07.2020  1. Flights to Egypt restarted. 2. A completed Public Health Card must be presented to immigration upon arrival. 3. Passengers must have an insurance to cover medical expenses in Egypt. - This does not apply to nationals and residents of Egypt.  "
  },
  {
    "code":"ER",
    "iso_alpha2": "ER",
    "continent": "AF",
    "name": "Eritrea",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 02.04.2020 Asmara (ASM) is closed.  "
  },
  {
    "code":"ES",
    "iso_alpha2": "ES",
    "continent": "EU",
    "name": "Spain",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 04.07.2020 1. Passengers are not allowed to enter until 8 July 2020.  This does not apply to: - nationals and residents of Spain; - passengers arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Sweden, Switzerland or United Kingdom; - residents of Andorra, Australia, Austria, Belgium, Bulgaria, Canada, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Georgia, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Montenegro, Netherlands, New Zealand, Norway, Poland, Portugal, Romania, Rwanda, San Marino, Serbia, Slovakia, Slovenia, Spain, Sweden, Thailand, Tunisia, Uruguay or Vatican City (Holy See); - passengers with a long-term visa issued by a Schengen Member State; - students of EEA Member States and Switzerland with a student card and a long-term D visa. 2. A completed Health Control Form must be presented upon arrival. 3. Residency permits and D visas that expired after 14 December 2019 are accepted for entry. These documents are valid 6 months after the state of alarm has ended.  "
  },
  {
    "code":"ET",
    "iso_alpha2": "ET",
    "continent": "AF",
    "name": "Ethiopia",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 06.07.2020 1. passengers must have a medical certificate with a negative  () test result issued at most 72 hours before arrival.  2. passengers without a medical certificate with a negative  () test result issued at most 72 hours before arrival are subject to medical screening. 3. passengers are subject to quarantine for 7 days at their own expense.  "
  },
  {
    "code":"FI",
    "iso_alpha2": "FI",
    "continent": "EU",
    "name": "Finland",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 15.06.2020 Passengers are not allowed to enter. - This does not apply to: - passengers arriving from Denmark, Estonia, Iceland, Latvia, Lithuania or Norway; - nationals of Finland and their family members;  - passengers with a residence permit issued by Finland;  - nationals and family members of nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland residing in Finland or returning via Finland to their country of residence; - passengers with a British passport and their family members residing in Finland or returning via Finland to their country of residence; - residents of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or the United Kingdom, returning via Finland to their country of residence; - passengers studying in Finland, if arriving from another EU or Schengen Member State; - military personnel.  "
  },
  {
    "code":"FJ",
    "iso_alpha2": "FJ",
    "continent": "OC",
    "name": "Fiji",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 30.03.2020  1. Passengers and airline crew are not allowed to enter Fiji.  - This does not apply to nationals of Fiji. 2. Nationals of Fiji must go into quarantine for a period of 14 days.  "
  },
  {
    "code":"FK",
    "iso_alpha2": "FK",
    "continent": "SA",
    "name": "Falkland Islands",
    "score": "4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 12.06.2020  1. Passengers are not allowed to enter.  - This does not apply to passengers with Falkland Isl. (Malvinas) status and residents of Falkland Isl. (Malvinas). 2. Passengers with Falkland Isl. (Malvinas) status and residents of Falkland Isl. (Malvinas) are subject to quarantine for 14 days.  "
  },
  {
    "code":"FM",
    "iso_alpha2": "FO",
    "continent": "EU",
    "name": "Faroe Islands",
    "score": "0 (Information not available)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 31.03.2020  1. passengers traveling to the state of chuuk must self-quarantine for 14 days in a  () free country before departure. 2. passengers and airline crew must go through medical screening upon arrival.  3. passengers are not allowed to enter the state of pohnpei. - this does not apply to residents of pohnpei. - this does not apply to medical and technical personnel. 4. passengers traveling to the state of pohnpei must have a medical certificate and must be quarantined for 14 days. 5. passengers traveling to the state of chuuk will be quarantined for 14 days.  "
  },
  {
    "code":"FR",
    "iso_alpha2": "FR",
    "continent": "EU",
    "name": "France",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 03.07.2020 1. passengers are not allowed to enter. - this does not apply to:    - nationals of france, their spouses and children;    - nationals of andorra, monaco, san marino, switzerland, vatican city (holy see) and an eea member state, their spouses and children;    - british nationals, their spouses and children;    - passengers arriving from andorra, monaco, san marino, switzerland, united kingdom, vatican city (holy see) or an eea member state;    - passengers arriving from australia, canada, korea rep., georgia, japan, montenegro, morocco, new-zealand, rwanda, serbia, thailand, tunisia or uruguay;    - passengers with a residence permit issued by france;    - passengers with a residence permit issued by andorra, monaco, san marino, switzerland, united kingdom, vatican city (holy see) or an eea member state;    - merchant seamen;    - passengers traveling to study. 2. a completed international travel certificate must be presented prior to boarding and to immigration upon arrival or when transiting france. the certificate must be obtained before departure via the french consular offices abroad or online at <a href=https://www.interieur.gouv.fr>https://www.interieur.gouv.fr</a>. - this does not apply to:    - passengers arriving from andorra, monaco, san marino, switzerland, united kingdom, vatican city (holy see) or an eea member state;    - passengers arriving from australia, canada, korea rep., georgia, japan, montenegro, morocco, new-zealand, rwanda, serbia, thailand, tunisia or uruguay. 3. passengers arriving in france:  - are subject to quarantine or isolation; and  - must present a completed declaration on honor to state that they do not have symptoms of  (). the declaration must be dated with the name and signature of the passenger.  "
  },
  {
    "code":"GA",
    "iso_alpha2": "GA",
    "continent": "AF",
    "name": "Gabon",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 06.07.2020 1. passengers arriving from austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland and united kingdom are not allowed to enter. - this does not apply to nationals and residents of gabon. 2. passengers must have a medical certificate with a negative  () test result issued at most 5 days before arrival.  3. passengers are subject to self- isolation for 14 days.  "
  },
  {
    "code":"GB",
    "iso_alpha2": "GB",
    "continent": "EU",
    "name": "United Kingdom",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 11.06.2020 1. Passengers are subject to self-isolation for 14 days. 2. A completed Public Health Passenger Locator Form must be presented to immigration upon arrival. The form can be obtained before departure at <a target=_blank href=https://visas-immigration.service.gov.uk/public-health-passenger-locator-form>https://visas-immigration.service.gov.uk/public-health-passenger-locator-form</a>.  "
  },
  {
    "code":"GD",
    "iso_alpha2": "GD",
    "continent": "NA",
    "name": "Grenada",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 29.06.2020  Airports in Grenada are closed.  "
  },
  {
    "code":"GE",
    "iso_alpha2": "GE",
    "continent": "AS",
    "name": "Georgia",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 30.06.2020  1. Flights to Georgia are suspended until 31 July 2020. - This does not apply to humanitarian, medevac and repatriation flights. 2. Passengers are subject to quarantine for 14 days.   "
  },
  {
    "code":"GF",
    "iso_alpha2": "GG",
    "continent": "EU",
    "name": "Guernsey",
    "score": "0 (Information not available)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 06.05.2020  1. a completed international travel certificate must be presented prior to boarding and to immigration upon arrival or when transiting french guiana. the certificate must be obtained before departure via the french consular offices abroad or online at <a target=_blank href=https://www.interieur.gouv.fr/>https://www.interieur.gouv.fr</a>. 2. passengers must go through a medical examination upon arrival and are subject to quarantine for a period of 14 days. - this does not apply to healthcare professionals related to  ().  "
  },
  {
    "code":"GH",
    "iso_alpha2": "GH",
    "continent": "AF",
    "name": "Ghana",
    "score": "3.6 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 30.06.2020 Flights to Ghana are suspended until 31 July 2020. - This does not apply to humanitarian, medevac and repatriation flights. 2. Passengers are subject to medical screening and quarantine. 3. Airline crew are subject to quarantine until their next flight.  "
  },
  {
    "code":"GI",
    "iso_alpha2": "GI",
    "continent": "EU",
    "name": "Gibraltar",
    "score": "4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 23.06.2020  () entry regulations lifted on 21 june 2020.  "
  },
  {
    "code":"GL",
    "iso_alpha2": "GL",
    "continent": "NA",
    "name": "Greenland",
    "score": "4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 24.04.2020 please see  () regulations for denmark.  "
  },
  {
    "code":"GM",
    "iso_alpha2": "GM",
    "continent": "AF",
    "name": "Gambia",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 10.06.2020 Flights to Gambia are suspended. - This does not apply to humanitarian, medevac and repatriation flights.  "
  },
  {
    "code":"GN",
    "iso_alpha2": "GN",
    "continent": "AF",
    "name": "Guinea",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 25.06.2020  guinea's borders are closed until 15 july 2020. - this does not apply to nationals of guinea with an approval from the government and a medical certificate stating that the passenger is not affected by  ().  "
  },
  {
    "code":"GP",
    "iso_alpha2": "GP",
    "continent": "NA",
    "name": "Guadeloupe",
    "score": "4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 06.05.2020  1. passengers are not allowed to enter the french west indies.  - this does not apply to: - passengers who reside in the french west indies; - passengers traveling for urgent health reasons; - passengers traveling for imperative business reasons. 2. a completed international travel certificate must be presented prior to boarding and to immigration upon arrival or when transiting the french west indies. the certificate must be obtained before departure via the french consular offices abroad or online at <a target=_blank href=https://www.interieur.gouv.fr/>https://www.interieur.gouv.fr</a>  3. passengers must go through a medical examination upon arrival and are subject to quarantine for a period of 14 days. - this does not apply to healthcare professionals related to  ().  "
  },
  {
    "code":"GQ",
    "iso_alpha2": "GQ",
    "continent": "AF",
    "name": "Equatorial Guinea",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 30.06.2020 1. flights to equatorial guinea restarted. 2. passengers and airline crew must have a medical certificate with a negative  () pcr test result issued at most 48 hours before arrival.  3. passengers and airline crew without a medical certificate with a negative  () pcr test result are subject to medical screening and quarantine.  "
  },
  {
    "code":"GR",
    "iso_alpha2": "GS",
    "continent": "AN",
    "name": "South Georgia and the South Sandwich Islands",
    "score": "0 (Information not available)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 06.07.2020 1. Passengers are not allowed to enter. -This does not apply to: - nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland and their family members; - British nationals and their family members; - nationals of Algeria, Australia, Canada, China (People's Rep.), Georgia, Japan, Korea (Rep.), Montenegro, Morocco, New Zealand, Rwanda, Thailand, Tunisia and Uruguay; - passengers with a residence permit issued by Greece. A certificate of application for renewal of a residence permit is not accepted; - passengers with a residence permit issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or the United Kingdom; - passengers with a long term visa issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or the United Kingdom; - nationals of North Macedonia (Rep.) returning via Thessaloniki (SKG) to continue by road to North Macedonia (Rep.). Their trip must be prearranged by the authorities; - passengers traveling on business; - military personnel. 2. Passengers are subject to medical screening and quarantine for 1 or 14 days. 3. Flights from Sweden and the United Kingdom are suspended. - This does not apply to humanitarian, medevac, military and repatriation flights. 4. Flights from Turkey are suspended until 15 July 2020. - This does not apply to humanitarian, medevac, military and repatriation flights. 5. Passengers must complete a Passenger Locator Form (PLF) 48 hours before check-in at <a href=https://travel.gov.gr/#/>https://travel.gov.gr/#/</a> . A  code generated from the completed form must be presented upon arrival.  "
  },
  {
    "code":"GT",
    "iso_alpha2": "GT",
    "continent": "NA",
    "name": "Guatemala",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 19.06.2020  Airports in Guatemala are closed until 15 August 2020.  - This does not apply to humanitarian, military or ambulance flights. Passengers are subject to quarantine for 7 days.  "
  },
  {
    "code":"GU",
    "iso_alpha2": "GU",
    "continent": "OC",
    "name": "Guam",
    "score": "4.5 (Extreme Warning)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 22.06.2020 1. passengers who have been in a country with confirmed  () cases for more than one week and do not have a medical certificate recognized by dphss (guam department of social health and services) with a negative  () test result issued at most 72 hours before arrival, are not allowed to enter. - this does not apply to residents of guam.  2. passengers are subject to quarantine for 14 days.  - this does not apply to passengers with a medical certificate with a negative  () test result issued at most within the last 72 hours. 3. airline crew are subject to quarantine until their next flight.  "
  },
  {
    "code":"GW",
    "iso_alpha2": "GW",
    "continent": "AF",
    "name": "Guinea-Bissau",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 26.05.2020 Flights to Guinea-Bissau are suspended. This does not apply to: - emergency flights;  - humanitarian, medical and rescue flights; - technical stops without passenger disembarkation; - other operational flights related to security.  "
  },
  {
    "code":"GY",
    "iso_alpha2": "GY",
    "continent": "SA",
    "name": "Guyana",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 02.07.2020 1. airports in guyana are closed until 31 july 2020. - this does not apply to medevac and repatriation flights. 2. passengers must have a medical certificate with a negative  () test result.  "
  },
  {
    "code":"HK",
    "iso_alpha2": "HK",
    "continent": "AS",
    "name": "Hong Kong",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 19.06.2020 1. Passengers are not allowed to enter Hong Kong SAR, China. - This does not apply to passengers with a Hong Kong SAR, China passport. - This does not apply to passengers with a British passport with nationality British National (Overseas) with the right of abode in Hong Kong SAR, China. - This does not apply to residents of Hong Kong SAR, China with a Permanent Identity Card. - This does not apply to residents of Hong Kong SAR, China with an Identity card accompanied by a valid work or study visa. - This does not apply to residents of Hong Kong SAR, China with an Identity card accompanied by a visa with Permission to remain extended until. They must enter within the validity of the permitted stay. - This does not apply to passengers who have only been in the mainland of China, Chinese Taipei or Macao SAR, China in the past 14 days. - This does not apply to the following passengers: a. Passengers travelling from the mainland of China or Chinese Taipei or Macao SAR, China and have not been to any other country/region in the past 14 days; b. Crew members of aircraft who need to commute to and from foreign places for performance of necessary duties or crew members of goods vessels; c. Government officials carrying out government duties including personnel of consular posts; d. Spouses and minor children of Hong Kong SAR, China residents; e. Personnel engaged in anti-epidemic work endorsed by the HKSAR Government. 2. All passengers who are eligible to enter Hong Kong SAR, China will be required to undergo 14 days compulsory quarantine. 3. All arriving passengers and crew members must present a completed Health Declaration Form to the Department of Health upon arrival. 4. Transit is only allowed if the connecting flight is booked on the same ticket. 5. Passengers are not allowed to transit via Hong Kong, SAR China to the Mainland of China.  "
  },
  {
    "code":"HN",
    "iso_alpha2": "HN",
    "continent": "NA",
    "name": "Honduras",
    "score": "3.7 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 22.04.2020 Airports in Honduras are closed. - This does not apply to humanitarian flights with an authorization issued 24h before departure by the Secretariat of tourism or Secretariat for foreign relations and international cooperation of Honduras.  "
  },
  {
    "code":"HR",
    "iso_alpha2": "HR",
    "continent": "EU",
    "name": "Croatia",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 02.07.2020 1. Passengers are not allowed to enter. This does not apply to: - nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland and their family members; - British nationals and their family members; - passengers with a long term residence permit or a long term D visa issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom;  - passengers entering Croatia to transit by land to a third country. They must prove that they can enter the destination country; - passengers traveling as tourists with a confirmation of accommodation booking; - passengers traveling on business with an invitation letter for a business meeting from a company in Croatia; - passengers with a diplomatic passport traveling on duty; - passengers traveling as students; - military personnel. 2. Passports and national ID cards issued to nationals of Croatia which expired on 11 March 2020 or later are considered valid.  "
  },
  {
    "code":"HT",
    "iso_alpha2": "HT",
    "continent": "NA",
    "name": "Haiti",
    "score": "4.4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 30.06.2020  1. Flights to Haiti restarted. 2. Passengers are subject to medical screening. 3. A completed Health Declaration Form must be presented to immigration upon arrival.  "
  },
  {
    "code":"HU",
    "iso_alpha2": "HU",
    "continent": "EU",
    "name": "Hungary",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 22.06.2020 1. Passengers are not allowed to enter Hungary. - This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Serbia, Slovakia, Slovenia, Spain, Sweden, Switzerland and their family members. - This does not apply to nationals of Korea (Rep.) and Japan traveling on business. - This does not apply to passengers with a signed and stamped letter issued by the Deputy-Chief Officer of the National Police. 2. Passenger with a signed and stamped letter issued by the Deputy-Chief Officer of the National Police are subject to 14 days quarantine.  "
  },
  {
    "code":"ID",
    "iso_alpha2": "ID",
    "continent": "AS",
    "name": "Indonesia",
    "score": "4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 03.07.2020  1. passengers are not allowed to enter and transit. - this does not apply to nationals of indonesia. - this does not apply to passengers with a temporary stay permit (itas) or permanent stay permit (itap). - this does not apply to passengers with a diplomatic or a service visa. - this does not apply to passengers with a diplomatic or service stay permit. - this does not apply to passengers with a visa issued after 31 march 2020. 2. passengers and airline crew must have a medical certificate with a negative  () pcr test result issued at most 7 days before arrival. 3. passengers without a medical certificate with a negative  () pcr test result are subject to medical screening and quarantine for 14 days. 4. airline crew without a medical certificate with a negative  () pcr test result are subject to medical screening and quarantine until their next flight. 5. deadhead crew will be given an entry stamp. they must: - have a valid crew id card or crew member certificate;  - provide written notification to immigration officer proving they will be on duty on the return flight. the notification must be received by immigration officer minimum 24 hours from arrival.  "
  },
  {
    "code":"IE",
    "iso_alpha2": "IE",
    "continent": "EU",
    "name": "Ireland",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 29.05.2020 Passengers arriving in Ireland (Rep.) are required to self-quarantine for 14 days and complete a Public Health Passenger Locator Form. - This does not apply when arriving from Northern Ireland.  - This does not apply to passengers with a diplomatic passport.  "
  },
  {
    "code":"IL",
    "iso_alpha2": "IM",
    "continent": "EU",
    "name": "Isle of Man",
    "score": "0 (Information not available)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 29.06.2020 1. Passengers are not allowed to enter and transit.  - This does not apply to nationals of Israel. - This does not apply to residents of Israel. 2. Passengers are subject to quarantine for 14 days. 3. A completed Health Declaration Form must be presented upon arrival.  "
  },
  {
    "code":"IN",
    "iso_alpha2": "IN",
    "continent": "AS",
    "name": "India",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 06.07.2020 Flights to India are suspended until 31 July 2020. - This does not apply to humanitarian, medical and relief flights.  "
  },
  {
    "code":"IQ",
    "iso_alpha2": "IQ",
    "continent": "AS",
    "name": "Iraq",
    "score": "4.7 (Extreme Warning)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 02.07.2020 Flights to Iraq are suspended until 15 July 2020. - This does not apply to emergency, humanitarian, medevac, military and repatriation flights.  "
  },
  {
    "code":"IR",
    "iso_alpha2": "IR",
    "continent": "AS",
    "name": "Iran",
    "score": "4.6 (Extreme Warning)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 22.05.2020 1. nationals of china (people's rep.) with a normal passport, passengers with a hong kong (sar china) passport and passengers with a macao (sar china) passport are no longer visa exempt. however, they can obtain a visa on arrival. 2. passengers are subject to medical screening and quarantine. 3. a completed self-declaration form concerning  () must be presented upon arrival. 4. based on the travel advisory restriction issued by united arab emirates government, nationals of united arab emirates are not allowed to travel to iran.  "
  },
  {
    "code":"IS",
    "iso_alpha2": "IS",
    "continent": "EU",
    "name": "Iceland",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 15.06.2020 1. passengers are not allowed to enter iceland.  - this does not apply to: - nationals of eea member states and switzerland; - passengers with a british passport;  - passengers with a residence permit issued by a schengen member state; - family members of nationals of eea member states, switzerland and of british nationals; - diplomats; - health and care workers traveling on duty; - humanitarian aid workers; - international organizations personnel; - passengers that require international protection;  - passengers traveling on family emergencies; - members of armed forces traveling on duty.  2. passengers traveling through iceland on their way to another schengen member state must have a written confirmation of their permission to enter the other schengen member state. 3. passengers are subject to a  () test or quarantine for 14 days. - this does not apply to passengers arriving from faroe isl. or greenland. 4. preregistration for visiting iceland must be completed at <a target=_blank href=http://visit..is/>http://visit..is/</a> before departure.  "
  },
  {
    "code":"IT",
    "iso_alpha2": "JE",
    "continent": "EU",
    "name": "Jersey",
    "score": "0 (Information not available)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 03.07.2020 1. passengers are not allowed to enter until 14 july 2020. - this does not apply to: - passengers arriving from andorra, austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), latvia, liechtenstein, lithuania, luxembourg, malta, monaco, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland or united kingdom; - nationals or residents of italy; - passengers traveling on business; - passengers returning via italy to their country of residence; - passengers arriving from algeria, australia, canada, georgia, japan, korea (rep.), montenegro, morocco, new zealand, rwanda, serbia, thailand, tunisia or uruguay. 2. residence permits issued by italy which have expired between 31 january and 31 july 2020, are considered valid until 31 august 2020. 3. passengers must present a completed self-declaration form to the transporting carrier and must communicate their entry to the department of prevention at local health units (asl) of the entrance district. - this does not apply to passengers arriving from andorra, austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), latvia, liechtenstein, lithuania, luxembourg, malta, monaco, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland or united kingdom.  4. passengers arriving in sardinia must present a completed health declaration form upon arrival. the form can be obtained at <a href=https://sus.regione.sardegna.it/sus/19/regimbarco/init>https://sus.regione.sardegna.it/sus/19/regimbarco/init</a> . 5. passengers are subject to quarantine for 14 days.   "
  },
  {
    "code":"JM",
    "iso_alpha2": "JM",
    "continent": "NA",
    "name": "Jamaica",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 16.06.2020 1. passengers are subject to medical screening and quarantine. 2. passengers must have a travel authorization obtained before departure at <a target=_blank href=https://www.visitjamaica.com/>https://www.visitjamaica.com/</a> . - this does not apply to residents of jamaica.  3. residents of jamaica must have a travel authorization obtained before departure at <a target=_blank href=https://jam19.moh.gov.jm/immigration.html>https://jam19.moh.gov.jm/immigration.html</a> .  "
  },
  {
    "code":"JO",
    "iso_alpha2": "JO",
    "continent": "AS",
    "name": "Jordan",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 29.06.2020  Flights to Jordan are suspended until 14 July 2020. - This does not apply to humanitarian, medevac and repatriation flights. <p> "
  },
  {
    "code":"JP",
    "iso_alpha2": "JP",
    "continent": "AS",
    "name": "Japan",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 01.07.2020 1. Passengers who have transited through or have been in Afghanistan, Albania, Algeria, Andorra, Antigua and Barbuda, Argentina, Armenia, Australia, Austria, Azerbaijan, Bahamas, Bahrain, Bangladesh, Barbados, Belarus, Belgium, Bolivia, Bosnia and Herzegovina, Brazil, Brunei Darussalam, Bulgaria, Cameroon, Canada, Cape Verde, Central African Rep., Chile, China (People's Rep.), Chinese Taipei, Congo (Dem. Rep.), Colombia, Costa Rica, Cote d'Ivoire, Croatia, Cuba, Cyprus, Czechia, Denmark, Djibouti, Dominica, Dominican Rep., Ecuador, Egypt, El Salvador, Equatorial Guinea, Estonia, Eswatini, Finland, France, Gabon, Georgia, Germany, Ghana, Greece, Grenada, Guatemala, Guinea, Guinea-Bissau, Guyana, Haiti, Honduras, Hong Kong (SAR China), Hungary, Iceland, India, Indonesia, Iran, Iraq, Ireland (Rep.), Israel, Italy, Jamaica, Kazakhstan, Korea (Rep.), Kosovo (Rep.), Kuwait, Kyrgyzstan, Latvia, Lebanon, Liechtenstein, Lithuania, Luxembourg, Macao (SAR China), Malaysia, Maldives, Malta, Mauritania, Mauritius, Mexico, Moldova (Rep.), Monaco, Montenegro, Morocco, Netherlands, New Zealand, Nicaragua, North Macedonia (Rep.), Norway, Oman, Pakistan, Panama, Peru, Philippines, Poland, Portugal, Qatar, Romania, Russian Fed., San Marino, Sao Tome and Principe, Saudi Arabia, Senegal, Serbia, Singapore, Slovakia, Slovenia, South Africa, Spain, St. Kitts and Nevis, St. Vincent and the Grenadines, Sweden, Switzerland, Tajikistan, Thailand, Turkey, Uruguay, USA, Ukraine, United Arab Emirates, United Kingdom, Vatican City (Holy See) or Viet Nam in the past 14 days are not allowed to enter until 31 July 2020. - This does not apply to nationals of Japan. - This does not apply to spouses or children of nationals of Japan if they can prove it. - This does not apply to residents of Japan with “Permanent Resident, Spouse or Child of Japanese National, Spouse or Child of Permanent Resident or Long Term Resident, who have departed Japan with Re-entry Permission by 2 April 2020. - This does not apply to residents of Japan with “Permanent Resident, Spouse or Child of Japanese National, Spouse or Child of Permanent Resident or Long Term Resident, who have departed Japan with Re-entry Permission between 3 April and 28 April 2020 and have only been in Afghanistan, Antigua and Barbuda, Argentina, Azerbaijan, Bahamas, Bangladesh, Barbados, Belarus, Cape Verde, Colombia, Djibouti, Dominican Rep., El Salvador, Equatorial Guinea, Gabon, Ghana, Guinea, Guinea Bissau, Honduras, India, Kazakhstan, Kuwait, Kyrgyzstan, Mexico, Maldives, Oman, Pakistan, Peru, Qatar, Russian Fed., Sao Tome and Principe, Saudi Arabia, South Africa, St. Kitts and Nevis, Tajikistan, United Arab Emirates, Ukraine or Uruguay.  - This does not apply to residents of Japan with “Permanent Resident, Spouse or Child of Japanese National, Spouse or Child of Permanent Resident or Long Term Resident, who have departed Japan with Re-entry Permission between 29 April and 15 May 2020 and have only been in Afghanistan, Argentina, Azerbaijan, Bahamas, Bangladesh, Cape Verde, Colombia, El Salvador, Equatorial Guinea, Gabon, Ghana, Guinea, Guinea Bissau, Honduras, India, Kazakhstan, Kyrgyzstan, Mexico, Maldives, Pakistan, South Africa, Sao Tome and Principe, Tajikistan or Uruguay.  - This does not apply to residents of Japan with “Permanent Resident, Spouse or Child of Japanese National, Spouse or Child of Permanent Resident or Long Term Resident, who have departed Japan with Re-entry Permission between 16 May and 26 May 2020 and have only been in Afghanistan, Argentina, Bangladesh, El Salvador, Ghana, Guinea, India, Kyrgyzstan, Pakistan, South Africa or Tajikistan. - This does not apply to residents of Japan with “Permanent Resident, Spouse or Child of Japanese National, Spouse or Child of Permanent Resident or Long Term Resident, who have departed Japan with Re-entry Permission between 27 May and 30 June 2020 and have only been in Algeria, Cameroon, Central African Rep., Costa Rica, Cuba, Eswatini, Georgia, Grenada, Guatemala, Guyana, Haiti, Iraq, Jamaica, Lebanon, Mauritania, Nicaragua, Senegal or St. Vincent and the Grenadines. - This does not apply to passengers with a Special Permanent Residence Permit. However, they must have a Re-entry Permit from a regional immigration officer. - This does not apply to US military personnel. 2. A completed Quarantine Questionnaire must be presented upon arrival. 3. Passengers and airline crew are subject to medical screening. 4. Visa exemption for passengers with passengers with a British passport, Hong Kong (SAR China) passport, Macao (SAR China) passport is suspended. 5. Visa exemption for nationals of Andorra, Argentina, Austria, Bahamas, Barbados, Belgium, Brunei Darussalam, Bulgaria, Costa Rica, Croatia, Czechia, Cyprus, Denmark, Dominican Rep., El Salvador, Estonia, Finland, France, Germany, Greece, Guatemala, Honduras, Hungary, Iceland, Indonesia, Iran, Ireland (Rep.), Israel, Italy, Korea (Rep.), Latvia, Lesotho, Liechtenstein, Lithuania, Luxembourg, Malaysia, Malta, Mexico, Monaco, Netherlands, Norway, Peru, Poland, Portugal, Romania, San Marino, Singapore, Slovakia, Slovenia, Spain, Suriname, Sweden, Switzerland, Thailand, Tunisia, United Arab Emirates, Uruguay and Vatican City (Holy See) is suspended. 6. Visa exemption for nationals of Azerbaijan, Bangladesh, Cambodia, Colombia, Georgia, India, Kazakhstan, Lao People's Dem. Rep., Mongolia, Myanmar, Nauru, Oman, Pakistan, Palau, Papua New Guinea, Paraguay, Qatar, Samoa, Solomon Isl., Turkmenistan, Ukraine, Uzbekistan and Viet Nam with a diplomatic, official or service passport is suspended. 7. Visa exemption granted to passengers with an APEC Business Travel Card issued by Brunei Darussalam, China (People's Rep.), Hong Kong (SAR China), Indonesia, Korea (Rep.), Malaysia, Mexico, Papua New Guinea, Peru, Philippines, Russian Fed., Singapore, Thailand or Viet Nam, is suspended. 8. Nationals of China (People's Rep.) with a passport issued in Hubei Province or Zhejiang Province (China People's Rep.) are not allowed to enter Japan.  - This does not apply when passengers can prove that they have not been in Hubei Province and Zhejiang Province the last 14 days.  9. Passengers who were in the cruise ship 'Westerdam' are not allowed to enter Japan. - This does not apply to nationals of Japan.  10. Visas issued on or before 8 March 2020 by the Embassies, Consulates-General and Consulate of Japan in China (People's Rep.), Hong Kong (SAR China), Korea (Rep.) or Macao (SAR China) are invalidated. 11. Visas issued on or before 20 March 2020 by the Embassies, Consulates-General and Consulate of Japan in Andorra, Austria, Belgium, Bulgaria, Croatia, Czechia, Cyprus, Denmark, Egypt, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland, United Kingdom or Vatican City (Holy See) are invalidated.  12. Visas issued on or before 27 March 2020 by the Embassies, Consulates-General and Consulate of Japan in Bahrain, Brunei Darussalam, Congo (Dem. Rep.), Indonesia, Israel, Malaysia, Philippines, Qatar, Singapore, Thailand or Viet Nam are invalidated.  13. Visas issued on or before 2 April 2020 by the Embassies, Consulates-General and Consulate of Japan in Afghanistan, Algeria, Angola, Antigua and Barbuda, Argentina, Azerbaijan, Bahamas, Bangladesh, Barbados, Belarus, Belize, Benin, Bhutan, Botswana, Burkina Faso, Burundi, Cambodia, Cameroon, Cape Verde, Central African Rep., Chad, Colombia, Comoros, Congo, Cook Isl., Costa Rica, Cuba, Djibouti, Dominican Rep., El Salvador, Equatorial Guinea, Eritrea, Eswatini (Swaziland), Ethiopia, Fiji, Gabon, Gambia, Georgia, Ghana, Grenada, Guatemala, Guinea, Guinea-Bissau, Guyana, Haiti, Honduras, India, Iraq, Jamaica, Jordan, Kazakhstan, Kenya, Kiribati, Kyrgyzstan, Kuwait, Lao People's Dem. Rep., Lebanon, Lesotho, Liberia, Libya, Madagascar, Malawi, Maldives, Mali, Marshall Isl., Mauritania, Mexico, Micronesia (Federated States), Mongolia, Mozambique, Myanmar, Namibia, Nauru, Nepal, Nicaragua, Niger, Nigeria, Niue, Oman, Pakistan, Palau, Palestinian Territory, Papua New Guinea, Paraguay, Peru, Russian Fed., Rwanda, Samoa, Sao Tome and Principe, Saudi Arabia, Senegal, Seychelles , Sierra Leone, Solomon Isl., Somalia, South Africa, South Sudan, Sri Lanka, St. Kitts and Nevis, St. Lucia, St. Vincent and Grenadines, Sudan, Suriname, Syria, Tajikistan, Tanzania, Timor-Leste, Togo, Tonga, Trinidad and Tobago, Tunisia, Turkmenistan, Tuvalu, Uganda, Ukraine, United Arab Emirates, Uruguay, Uzbekistan, Vanuatu, Venezuela, Yemen, Zambia or Zimbabwe are invalidated. 14. Passengers transiting through Tokyo (NRT) must transit on the same calendar day.  "
  },
  {
    "code":"KE",
    "iso_alpha2": "KE",
    "continent": "AF",
    "name": "Kenya",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 13.05.2020  1. Flights to Kenya are suspended. - This does not apply to: - aircraft in state of emergency; - operations related to humanitarian aid, evacuation, medevac, repatriation and diplomatic flights approved by appropriate authorities. 2. Flights exempted from the suspension must express their intention in writing to KCAA before departure. 3. Airline crew are required to self isolate at the designated airport hotels for the duration of their rest period. 4. Approved flights must provide a completed passengers declaration forms and manifests to Port Health, Immigration and customs.  "
  },
  {
    "code":"KG",
    "iso_alpha2": "KG",
    "continent": "AS",
    "name": "Kyrgyzstan",
    "score": "2.6 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 20.03.2020  Flights to Kyrgyzstan are suspended.  "
  },
  {
    "code":"KH",
    "iso_alpha2": "KH",
    "continent": "AS",
    "name": "Cambodia",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 02.07.2020 1. all visa exemptions, visas on arrival and e-visas are suspended. - this does not apply to passengers with a diplomatic visa (visa a) or an official visa (visa b) issued by cambodia.  2. passengers must have a medical certificate with a negative  () test result issued at most 72 hours before arrival. - this does not apply to nationals of cambodia. - this does not apply to passengers with a diplomatic visa (visa a) or an official visa (visa b) issued by cambodia. 3. passengers must have a proof of insurance policy with a minimum value of usd 50,000. they must deposit usd 3,000 at a designated bank on arrival. - this does not apply to nationals of cambodia.  - this does not apply to passengers with a diplomatic visa (visa a) or an official visa (visa b) issued by cambodia. - this does not apply to nationals of cambodia with a foreign passport and a visa k entry permit issued by cambodia. 4. passengers are subject to medical screening and quarantine for 14 days.  "
  },
  {
    "code":"KI",
    "iso_alpha2": "KI",
    "continent": "OC",
    "name": "Kiribati",
    "score": "2.5 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 23.03.2020  Tarawa (TRW) is closed.  "
  },
  {
    "code":"KM",
    "iso_alpha2": "KM",
    "continent": "AF",
    "name": "Comoros",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 12.06.2020  1. flights to comoros are suspended. 2. passengers must have a medical certificate with a negative  () test result issued before arrival.  "
  },
  {
    "code":"KN",
    "iso_alpha2": "KN",
    "continent": "NA",
    "name": "Saint Kitts and Nevis",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 12.04.2020 Airports in St. Kitts and Nevis are closed.  "
  },
  {
    "code":"KP",
    "iso_alpha2": "KP",
    "continent": "AS",
    "name": "North Korea",
    "score": "4.3 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 06.02.2020  1. Passengers traveling as tourists are not allowed to enter.  2. Passengers traveling on business or duty must spend 14 days in quarantine upon arrival.  "
  },
  {
    "code":"KR",
    "iso_alpha2": "KR",
    "continent": "AS",
    "name": "South Korea",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 01.07.2020  1. short-term visas (type c-1 and c-3) issued on or before 5 april are no longer valid. 2. visa exemptions for 90 nationalities with a normal passport are temporarily suspended. - this does not apply to airline crew. - this does not apply to passengers with an apec business travel card.  3. korean visas issued by the wuhan consulate in the hubei province are no longer valid. 4. visitors who have been in the hubei province (china people's rep.) in the past 14 days are not allowed to transit or enter korea (rep.).  5. nationals of china (people’s rep.) with a passport issued in the hubei province are not allowed to transit or enter korea (rep.). 6. passengers arriving from china (people's rep) must have a visa issued by korea (rep.) to transit through korea (rep.).  - this does not apply to nationals of albania, andorra, barbados, dominica, guyana, ireland (rep.), korea (rep.), malta, mexico, monaco, nicaragua, palau, san marino, slovenia, st. kitts and nevis, st. vincent and the grenadines, usa, vatican city (holy see) and venezuela.  - this does not apply to passengers with a british passport. - this does not apply to passengers with a diplomatic, consular, official, service or special passport. 7. passengers are subject to quarantine for 14 days and to a pcr test for  (). - this does not apply to nationals of china (people's rep.) traveling on business under the fast lane program and their accompanying family members. they must: - self-monitor their health conditions minimum 14 days before departure and hold a medical certificate to prove  () negative testing result issued at most 72 hours before departure, and - be tested on  () upon arrival. they must stay at designated quarantine facilities for 1 or 2 days until a negative test result is obtained. 8. nationals and residents of korea (rep.) are required to install 'self-quarantine safety protection mobile app'.  9. passengers and airline crew must install 'self-diagnosis mobile app' in their personal device and a completed health declaration form and a special quarantine declaration form must be presented to the quarantine desk upon arrival. 10. all flights must arrive at incheon international airport (icn) between 5:00 and 20:00. 11. passengers with a re-entry permit issued by korea (rep.) who left korea (rep.) after 1 june 2020 must have a medical certificate. the certificate must: - be issued by a local authorized medical institute at most 48 hours before departure; and - be written in english or korean; and  - include the date of examination, and the presence or absence of fever, cough, chills, headache, difficulty of breathing, muscle pain and pulmonary symptoms; and  - be signed by a medical examiner. - this does not apply to passengers with status diplomats (a-1), government officials (a-2, a-3) or overseas korean (f-4). 12. nationals of mongolia are not allowed to transit if they depart from mongolia or travel onward to mongolia.  - this does not apply to airline crew. 13. nationals of russian fed. are not allowed to transit if they depart from russian fed. or travel onward to russian fed.  - this does not apply to airline crew. 14. nationals of thailand are not allowed to transit if they depart from thailand or travel onward to thailand.  - this does not apply to airline crew. 15. passengers with a visa on an expired passport must present a printed visa grant notice and the expired passport to the immigration upon arrival.  "
  },
  {
    "code":"KW",
    "iso_alpha2": "KW",
    "continent": "AS",
    "name": "Kuwait",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 08.05.2020 1. Passengers are not allowed to enter Kuwait. - This does not apply to nationals of Kuwait and their first degree relatives. They must have a OK TO TRAVEL authorization obtained from the state of Kuwait embassy. - This does not apply to domestic workers if accompanied by a national of Kuwait. They must have a OK TO TRAVEL authorization obtained from the state of Kuwait embassy. - This does not apply to diplomatic passport holders, UN passport holders, members of UNESCO with prior approval from the government authorities. 2. Passengers must install 'Shlonik' in their personal device before departure. Airlines must inform Kuwait DGCA of passengers who are not able to install it. Such passengers must present their boarding pass upon arrival.  "
  },
  {
    "code":"KY",
    "iso_alpha2": "KY",
    "continent": "NA",
    "name": "Cayman Islands",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 14.05.2020 Flights to Grand Cayman (GCM) are suspended. - This does not apply to emergency, repatriation and Medevac flights. They must obtain a prior approval from the Civil Aviation in Cayman Isl.  "
  },
  {
    "code":"KZ",
    "iso_alpha2": "KZ",
    "continent": "AS",
    "name": "Kazakhstan",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 02.07.2020  1. airports are closed for international flights. - this does not apply to flights arriving from china (people's rep.), georgia, japan, korea (rep.), thailand or turkey. - this does not apply to repatriation and evacuation flights. - this does not apply to flights of airlines of kazakhstan. 2. passengers arriving from turkey must: - have a medical certificate stating a negative  () test result issued at most 5 days before arrival; or - be tested for  () at most 48 hours after arrival.  "
  },
  {
    "code":"LA",
    "iso_alpha2": "LA",
    "continent": "AS",
    "name": "Laos",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 02.07.2020 1. flights to lao people's dem. rep. are suspended until 31 july 2020. - this does not apply to humanitarian, medevac and repatriation flights. 2. passengers must have a medical certificate with a negative  () test result issued at most 72 hours before departure. 3. a completed health declaration form must be presented upon arrival.  4. passengers are subject to medical screening and quarantine for 14 days.  5. airline crew are subject to medical screening and quarantine until their next flight.   "
  },
  {
    "code":"LB",
    "iso_alpha2": "LB",
    "continent": "AS",
    "name": "Lebanon",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 01.07.2020  1. flights to lebanon restarted. 2. passengers must have a medical certificate with a negative  () pcr test result issued at most 96 hours before arrival.  3. passengers without a medical certificate with a negative  () pcr test result are subject to medical screening. 4. a health declaration form must be completed online at <a href=https://arcg.is/0gadng>https://arcg.is/0gadng</a> . 5. passengers are subject to medical screening. 6. passengers must have an insurance to cover medical expenses in lebanon. the medical insurance can be obtained before departure at <a href=http://www.19travelcare/web>www.19travelcare/web</a> or on arrival. - this does not apply to: - nationals and residents of lebanon benefiting from nssf or mfe; - military.  "
  },
  {
    "code":"LC",
    "iso_alpha2": "LC",
    "continent": "NA",
    "name": "Saint Lucia",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 15.06.2020 1. airports in st. lucia reopened. 2. passengers and airline crew: - must have a medical certificate with a negative  () test result issued at most 48 hours before arrival; and - are subject to medical screening and quarantine for 14 days.  "
  },
  {
    "code":"LI",
    "iso_alpha2": "LI",
    "continent": "EU",
    "name": "Liechtenstein",
    "score": "2.8 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 03.06.2020 1. Passengers are not allowed to enter. - This does not apply to nationals or residents of Switzerland or Liechtenstein. - This does not apply to passenger with a cross-border commuter permit who are entering Switzerland for work, with a C-visa issued by Switzerland for the purpose of business meetings as specialists in the field of health or official visit of great importance, with a D-visa issued by Switzerland or who have an assurance of a residence permit. - This does not apply to passengers traveling directly through Switzerland, provided that there are no reasons to believe that the country towards which they intend to leave Switzerland will refuse entry.  - This does not apply to passengers who have to travel to their place of work abroad, provided they can present a valid employment contract.  - This does not apply to passengers who are already legally residing within the EU/EFTA area and that are travelling for tourist purposes, provided that they can credibly demonstrate that they actually want to/can enter the destination country, e.g. by presenting a hotel booking, holiday apartment, etc.  - This does not apply to passengers who are entitled to freedom of movement (citizens of EU/EFTA-states) and have a professional reason for entering Switzerland and have a confirmation of registration. - This does not apply to passengers who are of great importance as specialists in the health sector. 2. Until and including 07.06.2020, passengers can only land at Basel (BSL), Geneva (GVA) or Zurich (ZRH).  "
  },
  {
    "code":"LK",
    "iso_alpha2": "LK",
    "continent": "AS",
    "name": "Sri Lanka",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 08.06.2020 1. Airports in Sri Lanka are closed. - This does not apply to humanitarian flights to Colombo (CMB).  "
  },
  {
    "code":"LR",
    "iso_alpha2": "LR",
    "continent": "AF",
    "name": "Liberia",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 30.06.2020 1. flights to liberia restarted. 2. passengers are subject to medical screening and quarantine. - this does not apply to passengers with a medical certificate with a negative  () test result.  "
  },
  {
    "code":"LS",
    "iso_alpha2": "LS",
    "continent": "AF",
    "name": "Lesotho",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 29.04.2020 passengers will be tested for  () and placed in quarantine for 14 days.  "
  },
  {
    "code":"LT",
    "iso_alpha2": "LT",
    "continent": "EU",
    "name": "Lithuania",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 26.06.2020 1. Passengers are not allowed to enter. -This does not apply to: - nationals and residents of Lithuania; - nationals of EEA Member States and Switzerland, if arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Luxembourg, Malta, Netherlands, Norway, Poland, Romania, Slovakia, Slovenia, Spain or Switzerland; - British nationals if arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Luxembourg, Malta, Netherlands, Norway, Poland, Romania, Slovakia, Slovenia, Spain or Switzerland; - residents of EEA Member States, Switzerland and United Kingdom, if arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Luxembourg, Malta, Netherlands, Norway, Poland, Romania, Slovakia, Slovenia, Spain or Switzerland;<span>  - family members of nationals of Lithuania; - family members of permanent residents of Lithuania; - NATO personnel and personnel working for them and their family members. 2. Passengers must arrive at Vilnius (VNO), Kaunas (KUN), Palanga (PLQ) or Siauliai (SQQ). 3. Transit through Lithuania is possible only for passengers traveling in groups on their way back to their country of residence. They must be escorted to the international border crossing points. 4. Nationals and residents of Lithuania arriving from Belgium, Ireland (Rep.), Portugal, Sweden or United Kingdom are subject to quarantine for 14 days. </span><span>5. Passengers arriving from Belgium or Ireland (Rep.) are subject to quarantine for 14 days.  </span>"
  },
  {
    "code":"LU",
    "iso_alpha2": "LU",
    "continent": "EU",
    "name": "Luxembourg",
    "score": "2.8 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 06.07.2020 1. Passengers are not allowed to enter. - This does not apply to: - British nationals and nationals of Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland and Vatican City (Holy See); - passengers arriving from Austria, Belgium, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Italy, Latvia, Liechtenstein, Lithuania, Malta, Netherlands, Norway, Poland, Portugal, Slovakia, Slovenia, Spain, Sweden or Switzerland; - passengers with a long-term residence permit issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Ireland (Rep.), Italy, Latvia, Lithuania, Luxembourg, Malta, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden or the United Kingdom;  - residents of Algeria, Australia, Canada, Georgia, Japan, Korea (Rep.),  Montenegro, Morocco, New Zealand, Rwanda, Serbia, Thailand, Tunisia and Uruguay; - passengers with a long-term D visa issued by a Schengen Member State; - family members of a national of Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland or Vatican City (Holy See);  - military personnel; - merchant seamen;  - passengers traveling to study. </p> "
  },
  {
    "code":"LV",
    "iso_alpha2": "LY",
    "continent": "AF",
    "name": "Libya",
    "score": "5 (Extreme Warning)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 03.06.2020 1. Passengers are not allowed to enter and transit Latvia.  - This does not apply to nationals and residents of Estonia, Latvia and Lithuania.  - This does not apply to nationals and residents of Switzerland and an EEA Member State traveling from Switzerland or an EEA Member State. 2. Passengers who have been in other countries than Estonia and Lithuania in the past 14 days are subject to self-isolation at their place of residence for 14 days.  "
  },
  {
    "code":"MA",
    "iso_alpha2": "MA",
    "continent": "AF",
    "name": "Morocco",
    "score": "3.1 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 26.05.2020  Flights to Morocco are suspended. - This does not apply to VIP flights with an authorization issued by the Ministry of Foreign Affairs of Morocco.  "
  },
  {
    "code":"MC",
    "iso_alpha2": "MC",
    "continent": "EU",
    "name": "Monaco",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 02.06.2020 1. passengers arriving from a non-schengen member state are not allowed to enter france. - this does not apply to: - nationals of france, their spouses and children; - nationals of andorra, monaco, san marino, switzerland, vatican city (holy see) and an eea member state, their spouses and children, on their way home; - british nationals, their spouses and children, on their way home; - passengers with a residence permit issued by france; - passengers with a residence permit issued by andorra, monaco, san marino, switzerland, united kingdom, vatican city (holy see) or an eea member state, on their way home; - healthcare professionals and researchers related to  ();  - personnel of diplomatic and consular missions and international organizations headquartered or having an office in france, their spouses and children; - merchant seamen. 2. a completed international travel certificate must be presented prior to boarding and to immigration upon arrival or when transiting france. the certificate must be obtained before departure via the french consular offices abroad or online at <a target=_blank href=https://www.interieur.gouv.fr>https://www.interieur.gouv.fr</a>. 3. passengers are subject to quarantine or isolation. 4. passengers must complete a declaration on honor to state that they do not have symptoms of  (). the declaration must be dated with the name and signature of the passenger.  "
  },
  {
    "code":"MD",
    "iso_alpha2": "MD",
    "continent": "EU",
    "name": "Moldova",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 02.07.2020  1. Passengers are not allowed to enter until 15 July 2020. - This does not apply to: - nationals of Moldova (Rep.) and their family members; - passengers with a residence permit or a long-stay visa issued by Moldova (Rep.). 2. Passengers are subject to self-isolation for 14 days.  "
  },
  {
    "code":"ME",
    "iso_alpha2": "MF",
    "continent": "NA",
    "name": "Saint Martin",
    "score": "4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 01.07.2020 1. passengers are not allowed to enter montenegro.  - this does not apply to nationals and residents of montenegro.  - this does not apply to passengers who have been in albania, algeria, andorra, angola, australia, austria, bahamas, barbados, belgium, bosnia and herzegovina, brunei darussalam, bulgaria, cambodia, china (people's rep.), costa rica, croatia, cuba, cyprus, czechia, denmark, estonia, fiji, finland, france, georgia, germany, greece, hungary, iceland, indonesia, ireland (rep.), israel, italy, jamaica, japan, jordan, korea (rep.), kosovo (rep.), latvia, lebanon, lithuania, luxembourg, madagascar, malaysia, malta, mauritius, monaco, mongolia, morocco, mozambique, netherlands, new zealand, nicaragua, norway, palestinian territory, papua new guinea, paraguay, philippines, poland, portugal, romania, senegal, seychelles, slovakia, slovenia, spain, sweden, switzerland, tajikistan, thailand, trinidad and tobago, tunisia, turkey, ukraine, uruguay, uzbekistan, venezuela, viet nam or zambia in the past 15 days.  2. nationals and residents of montenegro are subject to self-isolation for 14 days.  - this does not apply to passengers who have been in algeria, andorra, angola, australia, austria, bahamas, barbados, belgium, brunei darussalam, bulgaria, cambodia, china (people's rep.), costa rica, croatia, cuba, cyprus, czechia, denmark, estonia, fiji, finland, france, georgia, germany, greece, hungary, iceland, indonesia, ireland (rep.), italy, jamaica, japan, jordan, korea (rep.), latvia, lebanon, lithuania, luxembourg, madagascar, malaysia, malta, mauritius, monaco, mongolia, morocco, mozambique, netherlands, new zealand, nicaragua, norway, palestinian territory, papua new guinea, paraguay, philippines, poland, portugal, romania, senegal, seychelles, slovakia, slovenia, spain, sweden, switzerland, tajikistan, thailand, trinidad and tobago, tunisia, uruguay, uzbekistan, venezuela, viet nam or zambia in the past 15 days.  - this does not apply to passengers who have been in albania, bosnia and herzegovina, israel, kosovo (rep.), turkey or ukraine in the past 15 days and have a medical certificate stating a negative  () test result issued at most 72 hours before arrival.  3. passengers who have been in albania, bosnia and herzegovina, israel, kosovo (rep.), turkey or ukraine in the past 15 days must have a medical certificate with a negative  () test result issued at most 72 hours before arrival.  "
  },
  {
    "code":"MG",
    "iso_alpha2": "MG",
    "continent": "AF",
    "name": "Madagascar",
    "score": "3.1 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 20.04.2020 Flights to Madagascar are suspended.  "
  },
  {
    "code":"MH",
    "iso_alpha2": "MH",
    "continent": "OC",
    "name": "Marshall Islands",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 03.04.2020  Passengers are not allowed to enter Marshall Isl.  "
  },
  {
    "code":"MK",
    "iso_alpha2": "MK",
    "continent": "EU",
    "name": "Macedonia",
    "score": "2.3 (Low Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 01.07.2020  () entry regulations lifted on 1 july 2020.  "
  },
  {
    "code":"ML",
    "iso_alpha2": "ML",
    "continent": "AF",
    "name": "Mali",
    "score": "4.7 (Extreme Warning)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 06.07.2020 1. Passengers are not allowed to enter. - This does not apply to nationals and residents of Mali. - This does not apply to humanitarian, medevac and repatriation fights. 2. Passengers are subject to quarantine for 14 days.   "
  },
  {
    "code":"MM",
    "iso_alpha2": "MM",
    "continent": "AS",
    "name": "Myanmar",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 29.06.2020 1. Visa issuance is suspended. 2. Flights to Myanmar are suspended until 31 July 2020. - This does not apply to relief flights. - This does not apply to medical evacuation flights. - This does not apply to special flights approved by the Department of Civil Aviation. 3. Airline crew are subject to quarantine until their next departure flight.  "
  },
  {
    "code":"MN",
    "iso_alpha2": "MN",
    "continent": "AS",
    "name": "Mongolia",
    "score": "4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 06.05.2020  1. Passengers are not allowed to enter Mongolia. - This does not apply to nationals of Mongolia.  - This does not apply to residents of Mongolia who are direct family members of a national of Mongolia. - This does not apply to accredited staff and their direct family members of diplomatic missions and offices of international organizations in Mongolia.  - This does not apply to international freight transport drivers and railway train personnel of Mongolia, Russian Fed. and China (People’s Rep.).  2. Nationals of Mongolia will be placed in quarantine for 21 days at designated facilities upon arrival. After the quarantine period ends, they shall be under self-isolation at home for 14 days.  3. Residents of Mongolia who are direct family members of a national of Mongolia will be placed in quarantine for 21 days at designated facilities upon arrival. After the quarantine period ends, they shall be under self-isolation at home for 14 days.  4. Accredited staff and their direct family members of diplomatic missions and offices of international organizations in Mongolia will be quarantined for 21 days at designated facilities upon arrival. After the quarantine period ends, they shall be under self-isolation at home for 14 days.   "
  },
  {
    "code":"MO",
    "iso_alpha2": "MO",
    "continent": "AS",
    "name": "Macao",
    "score": "2.7 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 29.04.2020  1. passengers are not allowed to enter macao sar, china. - this does not apply to residents of macao sar, china. - this does not apply to residents of the mainland of china if they have not visited a foreign country 14 days prior to arrival. - this does not apply to residents of chinese taipei or hong kong sar, china if they have not visited a foreign country 14 days prior to arrival. 2. passengers who reside or have been in the hubei province, china in the past 14 days are not allowed to enter macao sar, china unless they prove with a valid certificate that they are not infected with the  (). 3. all passengers must obtain a  () nucleic acid test report issued by a local medical institution within 7 days confirming that they have been tested negative for  () before they can board their flight. 4. macao sar, china registered non-resident workers (holders of the non-resident worker's identification card) are banned from entering macao sar, china except holders of non-resident worker’s identification card who have resident status in the mainland of china, hong kong sar, china and chinese taipei. they will have to undergo medical observation at the designated place for 14 days if they have been to chinese taipei or hong kong sar, china in the past 14 days. 5. residents of macao sar, china must: - undergo medical observation at the designated place for 14 days if they have been to foreign country, hong kong sar, china and chinese taipei in the past 14 days; - go through a six-to-eight hour medical examination if they have made multiple unusual entries into the mainland of china on one day; - present a medical certificate of no infection with  () upon entry into macao sar, china if they have been to hubei province, china in the past 14 days. 6. residents from chinese taipei or hong kong sar, china who have not visited a foreign country 14 days prior to arrival will need to go to designated places for a 14-day medical observation. 7. residents from the mainland of china who have not visited a foreign country, hong kong sar , china or chinese taipei 14 days prior to arrival will need to go through a six to eight hour medical examination if they come from guangdong, henan, hunan, anhui, jiangsu, shandong, sichuan, heilongjiang, zhejiang, chongqing, beijing or shanghai. if they have visited hong kong sar, china or chinese taipei 14 days prior to arrival, they will need to go to designated places for a 14-day medical observation.  "
  },
  {
    "code":"MP",
    "iso_alpha2": "MQ",
    "continent": "NA",
    "name": "Martinique",
    "score": "4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 20.06.2020 1. a declaration form must be completed online at <a href=http://www.governor.gov.mp//travel>www.governor.gov.mp//travel</a> at least 3 days before arrival. 2. residents of northern mariana isl. are subject to self-quarantine for 14 days. 3. passengers are subject to quarantine for 14 days. - this does not apply to passengers with a pcr test issued at most 3 days before arrival.  "
  },
  {
    "code":"MR",
    "iso_alpha2": "MR",
    "continent": "AF",
    "name": "Mauritania",
    "score": "3.7 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 26.03.2020 All airports in Mauritania are closed.  "
  },
  {
    "code":"MS",
    "iso_alpha2": "MS",
    "continent": "NA",
    "name": "Montserrat",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 27.03.2020 Passengers are not allowed to enter Montserrat. - This does not apply to passengers from Montserrat. - This does not apply to passengers who have a permit of permanent residence. - This does not apply to husband, wife, child or other dependents of a person who is from or resides in Montserrat.  "
  },
  {
    "code":"MT",
    "iso_alpha2": "MT",
    "continent": "EU",
    "name": "Malta",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 02.07.2020 1. Passengers are not allowed to enter until 15 July 2020. - This does not apply to: - nationals and residents of Malta. - passengers arriving from Austria, Croatia, Cyprus, Czechia, Denmark, Estonia, France (except Ile-De-France), Finland, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy (except Emilia Romagnia, Lombardy and Piemonte regions), Latvia, Lithuania, Luxembourg, Norway, Poland (except Katowice), Slovakia, Spain (except Madrid, Catalonia, Castilla-La-Mancha, Castile and Leon) or Switzerland. They must have been in one of these countries for at least 14 days before departure. - humanitarian, medevac and repatriation flights.  2. Passengers and airline crew are subject to self-quarantine for 14 days. 3. A completed Public Health Passenger Locator Form must be presented upon arrival.  "
  },
  {
    "code":"MU",
    "iso_alpha2": "MU",
    "continent": "AF",
    "name": "Mauritius",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 18.06.2020  1. Passengers are not allowed to enter and transit until 31 August 2020. - This does not apply to nationals or residents of Mauritius, their spouses and children. They are subject to quarantine. 2. Airline crew are subject to quarantine until their next flight.  "
  },
  {
    "code":"MV",
    "iso_alpha2": "MV",
    "continent": "AS",
    "name": "Maldives",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 02.07.2020 1. Suspension of visa on arrival facilities. 2. Nationals and residents of Maldives are subject to quarantine. 3. Passengers traveling to Maldives for a purpose other than tourism are subject to quarantine for 14 days. 4. Airline crew are subject to medical screening. 5. A completed Health Declaration Card and an Immigration Arrival Card must be presented upon arrival. Effective 15 July 2020: 1. Visa on arrival facility will restart. 2. Passengers traveling as tourists must have a hotel reservation confirmation for the entire stay in a registered tourist facility.  3. Passengers and airline crew are subject to medical screening. 4. A completed Health Declaration Card and Immigration Arrival Card must be presented upon arrival.  "
  },
  {
    "code":"MW",
    "iso_alpha2": "MW",
    "continent": "AF",
    "name": "Malawi",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 28.04.2020 1. Passengers are not allowed to enter Malawi. - This does not apply to nationals of Malawi. - This does not apply to passengers who reside in Malawi.  2. Nationals and residents of Malawi are required to self-isolate. They will be monitored by health personnel.  "
  },
  {
    "code":"MX",
    "iso_alpha2": "MX",
    "continent": "NA",
    "name": "Mexico",
    "score": "3.6 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 19.06.2020 A completed Cuestionario de indentificacion de factores de riesgo en viajeros must be presented to immigration upon arrival. The form can be found at <a href=https://afac.hostingerapp.com/>https://afac.hostingerapp.com/</a> .  "
  },
  {
    "code":"MY",
    "iso_alpha2": "MY",
    "continent": "AS",
    "name": "Malaysia",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 02.07.2020  1. passengers are not allowed to enter malaysia until 31 august 2020. - this does not apply to nationals of malaysia. - this does not apply to permanent residents of malaysia with a mypr card. - this does not apply to passengers with a malaysia my second home (mm2h). they must have medical certificate stating a negative  () test result issued at most 3 days before arrival and a printed entry permission from ministry of tourism, arts and culture. - this does not apply to spouses or children of nationals of malaysia. they must have a sticker label visa in the passport specifically indicating they are either spouses or children.  - this does not apply to passengers with a diplomatic passport. - this does not apply to passengers with official passport on a diplomatic mission. - this does not apply to students with a medical certificate with a negative  () test result issued at most 3 days before arrival. 2. passengers arriving in malaysia: - are subject to self-quarantine for 14 days; and - are subject to medical screening; and - must install 'mysejahtera app' in their smart phone. 3. airline crew arriving in malaysia: - are subject to quarantine until their next flight; and - must install 'mysejahtera app' in their smart phone.  "
  },
  {
    "code":"MZ",
    "iso_alpha2": "MZ",
    "continent": "AF",
    "name": "Mozambique",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 04.06.2020  1. passengers arriving from countries with cases of  () or who have been in contact with infected persons are subject to quarantine for 14 days. 2. airline crew who disembark are subject to quarantine during their rotation/rest period of maximum of 24 hours.  "
  },
  {
    "code":"NA",
    "iso_alpha2": "NA",
    "continent": "AF",
    "name": "Namibia",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 03.07.2020  1. Flights to Namibia are suspended until 30 September 2020. - This does not apply to humanitarian, medevac and repatriation flights. 2. Passengers and airline crew are subject to medical screening and quarantine.  "
  },
  {
    "code":"NC",
    "iso_alpha2": "NC",
    "continent": "OC",
    "name": "New Caledonia",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 01.04.2020 Flights to New Caledonia are suspended.  "
  },
  {
    "code":"NE",
    "iso_alpha2": "NE",
    "continent": "AF",
    "name": "Niger",
    "score": "4.1 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 30.06.2020 Flights to Niger are suspended until 11 July 2020. - This does not apply to humanitarian, medevac, military and repatriation flights.  "
  },
  {
    "code":"NF",
    "iso_alpha2": "NF",
    "continent": "OC",
    "name": "Norfolk Island",
    "score": "0 (Information not available)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 27.05.2020 1. Passengers are not allowed to enter Australia.  - This does not apply to nationals of Australia.  - This does not apply to the immediate family members of nationals of Australia.  - This does not apply to permanent residents of Australia and their immediate family members.  - This does not apply to nationals of New Zealand residing in Australia.  - This does not apply to diplomats accredited to Australia and currently resident in Australia, and their immediate family members. 2. Passengers and airline crew are required to self-isolate for a period of 14 days at their first arrival location in Australia. If their duration of stay is less than 14 days, they must self-isolate for the entire duration of stay. - This does not apply to airline crew with the appropriate personal protective equipment. 3. Airline crew who are nationals or residents of Australia must self-isolate at their place of residence (or hotel) between flights, or for 14 days, whichever is shorter. Airline crew who are not nationals or residents of Australia must self-isolate in their hotel on arrival until their next flight. 4. When passengers transit through Australia for 8 to 72 hours, they must go to mandatory quarantine at the state designated facility until the time of the departing flight. 5. For repatriation charter flights, airlines are advised to contact the Australian Border Force (ABF) as early as possible in the planning process. Airlines should not confirm or schedule flights before discussing arrangements with the ABF repatriation team.  "
  },
  {
    "code":"NG",
    "iso_alpha2": "NG",
    "continent": "AF",
    "name": "Nigeria",
    "score": "3.7 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 25.06.2020 1. flights to nigeria are suspended. - this does not apply to nationals and residents of nigeria. 2. nationals and residents of nigeria: - must complete a health declaration form; - must have a medical certificate with a negative  () test result issued at most 5 days before arrival; - are subject to quarantine for 14 days. 3. residence permits which have expired on 22 march 2020 or later, are considered valid.  "
  },
  {
    "code":"NI",
    "iso_alpha2": "NI",
    "continent": "NA",
    "name": "Nicaragua",
    "score": "4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 01.05.2020 Airports in Nicaragua are closed. - This does not apply to humanitarian flights with a flight authorization requested 72 hours prior to flight. The passenger manifest must be submitted with the request.   "
  },
  {
    "code":"NL",
    "iso_alpha2": "NL",
    "continent": "EU",
    "name": "Netherlands",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 06.07.2020 1. passengers are not allowed to enter. -this does not apply to: - nationals of the netherlands;  - nationals of andorra, austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, monaco, montenegro, north macedonia (rep.), norway, poland, portugal, romania, san marino, serbia, slovakia, slovenia, spain, sweden, switzerland and vatican city (holy see), returning via netherlands to their country of residence;  - british nationals returning via netherlands to their country of residence; - passengers arriving from austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, lithuania, liechtenstein, luxembourg, malta, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland or the united kingdom; - passengers with a residence permit issued by the netherlands; - passengers with a long-term residence permit issued by austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, ireland (rep.), italy, latvia, lithuania, luxembourg, malta, poland, portugal, romania, slovakia, slovenia, spain, sweden or the united kingdom;  - family members of a national of an eea member state or switzerland, with a residence permit issued by austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland or the united kingdom, to family members of a union citizen; - passengers with a long-term d visa issued by austria, belgium, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, slovakia, slovenia, spain, sweden or switzerland; - residents of algeria, australia, canada, georgia, japan, korea (rep.), montenegro, morocco, new zealand, rwanda, serbia, thailand, tunisia and uruguay; - military personnel. 2. a completed 'health declaration form' for passengers departing from high risk  () countries must be presented prior to boarding. 3. passengers departing from high risk  () countries are subject to self-quarantine for 14 days.  "
  },
  {
    "code":"NO",
    "iso_alpha2": "NO",
    "continent": "EU",
    "name": "Norway",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 16.06.2020 1. Passengers are not allowed to enter Norway.  - This does not apply to nationals and residents of Norway. - This does not apply to passengers arriving from Denmark, Finland, Iceland or Gotland of Sweden. - This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland and passengers with a British passport if they reside, work or have property in Norway. If they cannot prove their residency in Norway, they must be able to prove their nationality in one of the countries listed above. - This does not apply to family members of nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland and passengers with a British passport, if they are already residing in Norway or are moving to Norway. - This does not apply to nationals of Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland, Vatican City (Holy See) and passengers with a British passport if they are transiting via Norway to return to their country of residence. - This does not apply to passengers with a visa issued by Norway after 15 March 2020. - This does not apply to visa exempt nationals who have been granted a residence permit, but have not yet received the residence card (a letter from UDI with the approval of the residence permit will document that the permit has been granted). This also goes for family members of EEA citizens who have been granted a residence card, but the card has not been issued yet.  - This does not apply to passengers with a D-visa in their passport. - This does not apply to spouses/cohabitants and children of holders of Norwegian diplomatic passport. - This does not apply to the following passengers: passengers with an ID card as diplomat or a Schengen residence card issued to diplomatic staff; NATO staff with travel order; seamen in transit to or from ships. 2. Passengers are subject to quarantine for 10 days. - This does not apply to passengers arriving from Denmark, Finland, Iceland or Gotland of Sweden.  3. Airline crew and passengers must fill out the public health information form and hand it over to the local airport authority upon arrival. 4. Passengers are only allowed to travel to Svalbard after they have stayed in quarantined in other parts of Norway.  "
  },
  {
    "code":"NP",
    "iso_alpha2": "NP",
    "continent": "AS",
    "name": "Nepal",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 02.07.2020 1. Flights to Nepal are suspended until 21 July 2020.  - This does not apply to medical and repatriation flights. 2. Passengers are subject to self-quarantine for 14 days. 3. A completed Passengers Locator Card must be presented to the health desk upon arrival.  "
  },
  {
    "code":"NR",
    "iso_alpha2": "NP",
    "continent": "AS",
    "name": "Nepal",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 07.03.2020  1. Passengers and airline crew who have transited through or have been in China (People's Rep.), Hong Kong (SAR China), Iran, Italy, Korea (Rep.) or Macao (SAR China) in the past 21 days are not allowed to enter Nauru.  2. Passengers and airline crew must complete a Health Declaration Card and submit it to the Health Personnel when arriving in Nauru. They will undergo health screening before entering Nauru.  "
  },
  {
    "code":"NU",
    "iso_alpha2": "NU",
    "continent": "OC",
    "name": "Niue",
    "score": "4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 20.03.2020 Passengers who have been in Australia, Austria, Belgium, Bulgaria, China (People's Rep.), Chinese Taipei, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hong Kong (SAR China), Hungary, Iceland, Ireland (Rep.), Indonesia, Iran, Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Macao (SAR China), Netherlands, Norway, Poland, Portugal, Romania, Singapore, Slovakia, Slovenia, Spain, Sweden, Switzerland, Thailand, USA or United Kingdom in the past 14 days are not allowed to enter Niue. - This does not apply to nationals and resident of Niue.  "
  },
  {
    "code":"NZ",
    "iso_alpha2": "NZ",
    "continent": "OC",
    "name": "New Zealand",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 22.06.2020 1. Passengers are not allowed to enter. - This does not apply to nationals of New Zealand (including Cook Isl., Niue, Tokelau). - This does not apply to the immediate family members of nationals of New Zealand. - This does not apply to passengers with a permanent resident visa and their immediate family members. - This does not apply to nationals of Australia ordinarily resident in New Zealand. 2. Passengers are not allowed to transit. - This does not apply to nationals of Australia and New Zealand. - This does not apply to residents of New Zealand. - This does not apply to passengers with a visa issued by New Zealand. - Effective until 4 September 2020, this does not apply to nationals of Fiji returning directly via New Zealand to Fiji. - Effective until 19 September 2020, this does not apply to passengers in Cook Isl., Fiji, French Polynesia, Kiribati, Micronesia (Federated States), Nauru, New Caledonia, Niue, Northern Mariana Isl., Samoa, Samoa (American), Solomon Isl., Tonga, Tuvalu or Vanuatu, if they are returning via New Zealand to their country of residence. 3. Transit is only allowed for maximum 24 hours at Auckland (AKL). 4. Passengers are subject to medical screening and quarantine for 14 days.  - This does not apply to passengers in transit. 5. Airline crew must use appropriate personal protective equipment (PPE). They are not subject to quarantine.  "
  },
  {
    "code":"OM",
    "iso_alpha2": "OM",
    "continent": "AS",
    "name": "Oman",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 07.05.2020  Passengers are not allowed to enter Oman. - This does not apply to nationals of Oman.  "
  },
  {
    "code":"PA",
    "iso_alpha2": "PA",
    "continent": "NA",
    "name": "Panama",
    "score": "2.8 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 21.04.2020 1. Flights to Panama are suspended. - This does not apply to humanitarian flights. 2. Passengers are subject to quarantine for 14 days.  "
  },
  {
    "code":"PE",
    "iso_alpha2": "PE",
    "continent": "SA",
    "name": "Peru",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 01.07.2020 1. Passengers are not allowed to enter Peru until 31 July 2020. - This does not apply to nationals and residents of Peru. 2. Nationals and residents of Peru are subject to quarantine for 14 days. 3. Airline crew must self-isolate at a hotel for the entire duration of stay. 4. A completed Declaracion Jurada de Salud must be presented upon arrival.  "
  },
  {
    "code":"PF",
    "iso_alpha2": "PF",
    "continent": "OC",
    "name": "French Polynesia",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 06.05.2020 1. passengers are not allowed to enter french polynesia.  - this does not apply to passengers who reside in french polynesia. 2. a completed international travel certificate must be presented prior to boarding and to immigration upon arrival or when transiting french polynesia. the certificate must be obtained before departure via the french consular offices abroad or online at <a target=_blank href=https://www.interieur.gouv.fr/>https://www.interieur.gouv.fr</a>. 3. passengers must go through a medical examination upon arrival and are subject to quarantine for a period of 14 days. - this does not apply to healthcare professionals related to  (). 4. airline crew for repatriation flights are subject to a medical control and will complete a declaration on honour stating they will have to respect the sanitary measures requirements of self-isolation for 14 days. - this does not apply if they are in transit and stay in the aircraft. - this does not apply if they are authorized to go back on their company flight in case there is layover for one day or one night.  "
  },
  {
    "code":"PG",
    "iso_alpha2": "PG",
    "continent": "OC",
    "name": "Papua New Guinea",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 28.05.2020 1. Passengers can only land at Port Moresby (POM). 2. Passengers who reside in Papua New Guinea must depart from Brisbane (BNS), Cairns (CNS) or Singapore. 3. Passengers must be quarantined for 14 days at designated hotels in Port Moresby. 4. Passengers and airline crew must obtain State of Emergency (SOE) controller approval to enter.  "
  },
  {
    "code":"PH",
    "iso_alpha2": "PH",
    "continent": "AS",
    "name": "Philippines",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 18.06.2020 1. passengers are not allowed to enter.  - this does not apply to nationals of the philippines.  - this does not apply to spouses or children of nationals of the philippines.  2. passengers and airline crew  are subject to a  () test and quarantine. 3. a completed case investigation form must be presented upon arrival.   "
  },
  {
    "code":"PK",
    "iso_alpha2": "PK",
    "continent": "AS",
    "name": "Pakistan",
    "score": "4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 24.06.2020 1. Flights to Gwadar (GWD) and Turbat (TUK) are suspended.  - This does not apply to diplomatic, special and flights of national carriers. They must have a special approval from the competent authority for transporting stranded passengers.  2. A completed International Passenger Health Declaration Form must be presented upon arrival.  3. Passengers and airline crew are subject to medical screening and quarantine for 14 days.   "
  },
  {
    "code":"PL",
    "iso_alpha2": "PL",
    "continent": "EU",
    "name": "Poland",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 01.07.2020 1. Flights to Poland are suspended until 14 July 2020. - This does not apply to flights arriving from Albania, Austria, Belgium, Bulgaria, Canada, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Georgia, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Montenegro, Netherlands, Norway, Romania, Slovakia, Slovenia, Spain, Switzerland or Ukraine.  - This does not apply to humanitarian, medevac and repatriation flights. 2. Passengers are subject to quarantine for 14 days. - This does not apply to passengers arriving from Albania, Austria, Belgium, Bulgaria, Canada, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Georgia, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Montenegro, Netherlands, Norway, Romania, Slovakia, Slovenia, Spain, Switzerland or Ukraine.  "
  },
  {
    "code":"PM",
    "iso_alpha2": "PN",
    "continent": "OC",
    "name": "Pitcairn",
    "score": "0 (Information not available)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 02.06.2020 1. passengers arriving from a non-schengen member state are not allowed to enter france. - this does not apply to: - nationals of france, their spouses and children; - nationals of andorra, monaco, san marino, switzerland, vatican city (holy see) and an eea member state, their spouses and children, on their way home; - british nationals, their spouses and children, on their way home; - passengers with a residence permit issued by france; - passengers with a residence permit issued by andorra, monaco, san marino, switzerland, united kingdom, vatican city (holy see) or an eea member state, on their way home; - healthcare professionals and researchers related to  ();  - personnel of diplomatic and consular missions and international organizations headquartered or having an office in france, their spouses and children; - merchant seamen. 2. a completed international travel certificate must be presented prior to boarding and to immigration upon arrival or when transiting france. the certificate must be obtained before departure via the french consular offices abroad or online at <a target=_blank href=https://www.interieur.gouv.fr>https://www.interieur.gouv.fr</a>. 3. passengers are subject to quarantine or isolation. 4. passengers must complete a declaration on honor to state that they do not have symptoms of  (). the declaration must be dated with the name and signature of the passenger.  "
  },
  {
    "code":"PR",
    "iso_alpha2": "PS",
    "continent": "AS",
    "name": "Palestinian Territory",
    "score": "3.7 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 06.04.2020 1. Passengers will be quarantined for 14 days. 2. Passengers must present a completed Puerto Rico Department of Health form upon arrival.  "
  },
  {
    "code":"PT",
    "iso_alpha2": "PT",
    "continent": "EU",
    "name": "Portugal",
    "score": "3.6 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 03.07.2020 1. passengers are not allowed to enter.  - this does not apply to nationals of portugal. - this does not apply to residents of portugal. - this does not apply to passengers arriving from algeria, canada, china (people's rep.), korea (rep.), morocco and tunisia. - this does not apply to passengers arriving from angola, brazil, cape verde, guinea-bissau, mozambique, sao tome and principe and usa traveling as students. - this does not apply to passengers with a long term visa issued by portugal. - this does not apply to nationals of austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden and switzerland, if they are arriving from austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden or switzerland. - this does not apply to family members of nationals of austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden and switzerland, if they are arriving from austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden or switzerland. - this does not apply to passengers with a long term visa issued by austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, ireland (rep.), italy, latvia, lithuania, luxembourg, malta, netherlands, poland, portugal, romania, slovakia, slovenia, spain, sweden or united kingdom, returning via portugal to their country of residence.  - this does not apply to passengers with a residence permit issued by austria, belgium, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, ireland (rep.), italy, latvia, lithuania, luxembourg, malta, netherlands, poland, portugal, romania, slovakia, slovenia, spain, sweden or united kingdom, returning via portugal to their country of residence.  2. flights to portugal are suspended. - this does not apply to flights arriving from angola, austria, belgium, brazil (sao paulo (gru) and rio de janeiro (rio)), bulgaria, canada, cape verde, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, guinea-bissau, hungary, iceland, ireland (rep.), italy, latvia, lithuania, luxembourg, malta, mozambique, netherlands, norway, poland, portugal, romania, sao tome and principe, slovakia, slovenia, south africa, sweden, switzerland, usa, united kingdom or venezuela. - this does not apply to medevac, humanitarian and repatriation flights. 3. passengers arriving in madeira must complete an online health form 12 hours to 48 hour before departure on <a href=http://apps.iasaude.pt/s-alerta/questionarios/viagem/>http://apps.iasaude.pt/s-alerta/questionarios/viagem/</a> . passengers are subject to quarantine if they do not have a certificate with a negative  () result issued at most 72 hours before departure.  4. passengers arriving in azores are subject to medical screening and quarantine. - this does not apply to passengers with a certificate with a negative  () result issued at most 72 hours before departure. 5. passengers arriving from angola, brazil, cape verde, guinea-bissau, mozambique, sao tome and principe and usa must have a medical certificate with a negative  () test result issued at most 72 hours before departure.  "
  },
  {
    "code":"PW",
    "iso_alpha2": "PW",
    "continent": "OC",
    "name": "Palau",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 06.02.2020 Passengers and airline crew who have transited through or have been in China (People's Rep.), Hong Kong (SAR China) or Macao (SAR China) in the past 14 days are not allowed to enter Palau.  "
  },
  {
    "code":"PY",
    "iso_alpha2": "PY",
    "continent": "SA",
    "name": "Paraguay",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 17.04.2020  Flights to Paraguay are suspended. - This does not apply to health services and repatriation flights.  "
  },
  {
    "code":"QA",
    "iso_alpha2": "QA",
    "continent": "AS",
    "name": "Qatar",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 15.06.2020 1. Passengers are not allowed to enter Qatar. - This does not apply to nationals of Qatar. - This does not apply to residents of Qatar with a Permanent Residence card. 2. Nationals and residents of Qatar with a Permanent Residence card of Qatar are subject to quarantine for 14 days. They must have a hotel reservation for this period.   <p>"
  },
  {
    "code":"RE",
    "iso_alpha2": "RE",
    "continent": "AF",
    "name": "Reunion",
    "score": "4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 30.06.2020 1. passengers are not allowed to enter. - this does not apply to: - residents of reunion, their spouses and children; - passengers arriving from andorra, monaco, san marino, switzerland, united kingdom, vatican city (holy see) or an eea member state; - merchant seamen.  2. a completed international travel certificate must be presented prior to boarding and to immigration upon arrival or when transiting reunion. the certificate must be obtained before departure via the french consular offices abroad or online at <a href=https://www.interieur.gouv.fr/actualites/l-actu-du-ministere/attestation-de-deplacement-et-de-voyage>https://www.interieur.gouv.fr/actualites/l-actu-du-ministere/attestation-de-deplacement-et-de-voyage</a>.  3. passengers without a medical certificate with a negative  () pcr test are subject to quarantine for 14 days.  4. passengers with a medical certificate with a negative  () pcr test issued at most 72 hours before arrival are subject to quarantine for 7 days.  5. passengers must complete a declaration on honor to state that they do not have symptoms of  (). the declaration must be dated with the name and signature of the passenger.   "
  },
  {
    "code":"RO",
    "iso_alpha2": "RO",
    "continent": "EU",
    "name": "Romania",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 24.06.2020 1. Passengers are not allowed to enter Romania. - This does not apply to: - nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland; - British nationals; - family members of nationals of Romania; - passengers with a residence permit or a long-stay visa issued by Romania; - humanitarian, international organizations and military personnel; 2. Flights from Belgium, French Overseas Territories, Iran, Netherlands, Spain, Turkey, USA and the United Kingdom to Romania are suspended. - This does not apply to humanitarian and medevac flights. 3. Passengers must be isolated at home for 14 days.  "
  },
  {
    "code":"RS",
    "iso_alpha2": "RS",
    "continent": "EU",
    "name": "Serbia",
    "score": "4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 22.05.2020  () entry regulations lifted on 22 may 2020.  "
  },
  {
    "code":"RU",
    "iso_alpha2": "RU",
    "continent": "EU",
    "name": "Russia",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 26.03.2020 Passengers are not allowed to enter the Russian Fed.  - This does not apply to nationals of the Russian Fed.;  - This does not apply to accredited or appointed employees of diplomatic missions, consular offices, international organizations located in Russian Fed. and their family members; - This does not apply to members of official delegations; - This does not apply to travelers with diplomatic, business or normal visas issued in connection with the death of a close relative, as well as visas issued by special decision of the Russian Ministry of Foreign Affairs; - This does not apply to passengers from visa-free countries coming in connection with the death of a close relative, having copies of death certificate, as well as a document confirming family relations; - This does not apply to passengers who are family members (spouses, parents, kids, adoptive parents, adopted), guardians and trustees of citizens of the Russian Fed., subject to the presentation of a copy of a document confirming the relationship status; - This does not apply to passengers permanently residing in the Russian Fed., as well as transiting through airports without entering the Russian Fed.  "
  },
  {
    "code":"RW",
    "iso_alpha2": "RW",
    "continent": "AF",
    "name": "Rwanda",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 22.04.2020 1. Flights to Kigali International Airport (KGL) are suspended. 2. Nationals and residents of Rwanda will be subject to a mandatory 14-day quarantine at designated locations.  "
  },
  {
    "code":"SA",
    "iso_alpha2": "SA",
    "continent": "AS",
    "name": "Saudi Arabia",
    "score": "3.1 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 19.05.2020 Flights to Saudi Arabia are suspended. - This does not apply to technical stops, humanitarian, medevac and repatriation flights. These flights are subject to prior approval from GACA.   "
  },
  {
    "code":"SB",
    "iso_alpha2": "SB",
    "continent": "OC",
    "name": "Solomon Islands",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 04.05.2020 1. passengers and airline crew are not allowed to enter solomon isl.  - this does not apply to nationals and residents of solomon isl.  - this does not apply to passengers with prior written authorization issued by the prime minister.  2. nationals and residents of solomon isl. who have been in countries with confirmed cases of  () will be put in quarantine for a period of 14 days upon arrival. 3. passengers with prior written authorization issued by the prime minister who have been in countries with confirmed cases of  () will be put in quarantine for a period of 14 days upon arrival. 4. passengers must present a completed traveler’s public health declaration card and provide full details of their place of stay, travel itinerary and current personal contact details in solomon isl. 5. passengers and airline crew must provide details of their international travel history for the period of 14 days prior to arrival in solomon isl.  "
  },
  {
    "code":"SC",
    "iso_alpha2": "SC",
    "continent": "AF",
    "name": "Seychelles",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 17.06.2020 1. airports in seychelles re-opened. 2. passengers and airline crew are not allowed to enter and transit.  - this does not apply to: a. nationals and residents of seychelles; and b. passengers and airline crew arriving directly from australia, austria, botswana, china (people's rep.), croatia, greece, hungary, israel, japan, luxembourg, mauritius, monaco, namibia, new zealand, norway, slovakia, slovenia, switzerland or thailand.  3. a completed application for entry into seychelles must be submitted to the public health commissioner before boarding. the form can be obtained at <a target=_blank href=http://tourism.gov.sc>http://tourism.gov.sc</a> .  4. passengers must have a medical certificate with a negative  () test result issued at most 48 hours before arrival and are subject to medical screening. 5. nationals and residents of seychelles are subject to quarantine for 14 days. 6. visitors must have a hotel reservation confirmation.  "
  },
  {
    "code":"SD",
    "iso_alpha2": "SD",
    "continent": "AF",
    "name": "Sudan",
    "score": "4.1 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 29.06.2020 Flights to Sudan are suspended until 12 July 2020.  - This does not apply to humanitarian, medical and repatriation flights.  "
  },
  {
    "code":"SE",
    "iso_alpha2": "SE",
    "continent": "EU",
    "name": "Sweden",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 03.07.2020 Passengers are not allowed to enter until 31 August 2020. -This does not apply to: - passengers arriving from Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Switzerland and United Kingdom; - nationals of Sweden; - family members of nationals of Sweden; - passengers with a residence permit issued by Sweden; - nationals of Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Switzerland and Vatican City (Holy See), and their family members, returning via Sweden to their country of residence; - passengers with a British passport and their family members, returning via Sweden to their country of residence; - passengers with a residence permit issued by Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Switzerland, United Kingdom or Vatican City (Holy See), returning via Sweden to their country of residence; - passengers with a national visa issued by Sweden; - passengers with a national visa issued by Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, San Marino, Slovakia, Slovenia, Spain, Switzerland, United Kingdom or Vatican City (Holy See). The visa must be valid for more than 3 months; - military personnel; - passengers traveling as students; - merchant seamen; - effective 4 July 2020, residents of Algeria, Australia, Canada, Georgia, Japan, Korea (Rep.), Montenegro, Morocco, New Zealand, Rwanda, Serbia, Thailand, Tunisia and Uruguay.  "
  },
  {
    "code":"SG",
    "iso_alpha2": "SG",
    "continent": "AS",
    "name": "Singapore",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 29.04.2020 1. Passengers traveling as short-term visitors are not allowed to transit or enter Singapore.  - This does not apply to returning residents of Singapore (Singapore Citizens, Permanent Residents or passengers with a Long-Term Pass (including passengers with a Work Pass, Student's Pass, Dependent’s Pass, and Long-Term Visit Pass)). Upon entry into Singapore, they must serve a 14-day self-isolation at dedicated Stay-Home-Notice (SHN) facilities.  - Passengers with a new or existing Work Pass will be allowed entry if they have an approval letter from the Ministry of Manpower (MOM) or the Immigration and Checkpoints Authority (ICA).  - Passengers with a Long-Term Visit Pass (LTVP) or a Long-Term Visit Pass In-Principle Approval (LTVP IPA) issued by the Immigration and Checkpoints Authority (ICA), will be allowed entry if they have an Approval Letter for Entry (ALE) issued by the Immigration and Checkpoints Authority (ICA). - Passengers with a Student's Pass (STP) or a Student's Pass In-Principle Approval (STP IPA), will be allowed entry if they have an Approval Letter for Entry (ALE) issued by the Ministry of Education (MOE) or the Immigration and Checkpoints Authority (ICA). 2. Short-term visitors will be allowed entry into Singapore if they have an Approval Letter for Entry (ALE) from the Immigration and Checkpoints Authority (ICA), Ministry of Trade and Industry (MTI), Ministry of Foreign Affairs (MFA) or the Ministry of Health (MOH). They could still be subjected to the prevailing health screening requirements upon entry. Possession of an Approval Letter for Entry (ALE) does not guarantee the issuance of a Visit Pass to enter Singapore. 3. Passengers entering Singapore, including Singapore Citizens, Permanent Residents and passengers with a Long-Term Pass (LTP), must submit a health declaration. This can be done via the SG Arrival Card (SGAC) e-Service (<a target=_blank href=https://eservices.ica.gov.sg/sgarrivalcard>https://eservices.ica.gov.sg/sgarrivalcard</a>) or via the mobile application (to be downloaded from Apple AppStore or Google Play). 4. Airlines must inform passengers to submit their health declaration via the SG Arrival Card (SGAC) e-Service before arriving in Singapore. 5. The paper-based embarkation/disembarkation card is discontinued. All airlines must stop distributing these cards for flights planned to arrive in Singapore on or after 27 March 2020, 0900 hours. 6. Airline crew of foreign airlines, who are Singapore Citizens, Permanent Residents or long-term pass holders entering Singapore, will be issued with a Stay-Home Notice (SHN). Such crew with travel history to Brunei Darussalam, Cambodia, France, India, Indonesia, Lao People's Dem. Rep., Malaysia, Myanmar, Philippines, Switzerland, Thailand, USA, United Kingdom or Viet Nam within the last 14 days must serve the SHN at Crowne Plaza Changi Airport. Those who do not have travel history to the listed countries within the last 14 days may serve the SHN at their residence in Singapore. The SHN must be served until their next departure flight out of Singapore or for 14 days, whichever is earlier. 7. Airline crew of foreign airlines, who are not Singapore Citizens, Permanent Residents or long-term pass holders, will not be allowed to enter Singapore, or transit through Singapore. This does not apply to flights that require a layover due to flight time limitations or an aircraft-on-ground (AOG) situation in Singapore. In this case, airlines may layover their flight and cabin crew at Crowne Plaza Changi Airport. They will be issued with an SHN which shall be served until their next departure flight out of Singapore. 8. For flights that require a layover due to flight time limitations or an aircraft-on-ground (AOG) situation in Singapore, airlines may layover their flight and cabin crew at Crowne Plaza Changi Airport. They will be issued with an SHN which shall be served until their next departure flight out of Singapore.  "
  },
  {
    "code":"SH",
    "iso_alpha2": "SH",
    "continent": "AF",
    "name": "Saint Helena",
    "score": "0 (Information not available)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 29.03.2020 1. Passengers are not allowed to enter St. Helena. - This does not apply to passengers who reside in St. Helena. - This does not apply to passengers with a long-term permit. - This does not apply to temporary contractors. - This does not apply to sponsored Technical Cooperation Officers. - This does not apply to passengers traveling to Ascension. - This does not apply to persons authorized in advance by the Governor. 2. All new arrivals will be subject to compulsory isolation for 14 days when entering St. Helena.  "
  },
  {
    "code":"SI",
    "iso_alpha2": "SJ",
    "continent": "EU",
    "name": "Svalbard and Jan Mayen",
    "score": "0 (Information not available)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 01.07.2020 1. Passengers are not allowed to enter. - This does not apply to passengers arriving from Albania, Andorra, Armenia, Austria, Bahrain, Belarus, Bolivia, Bosnia and Herzegovina, Brazil, Cayman Isl., Chile, Croatia, Cyprus, Czechia, Denmark, Djibouti, Dominican Rep., Estonia, Finland, France, Gabon, Germany, Gibraltar, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Kosovo (Rep.), Kuwait, Latvia, Liechtenstein, Lithuania, Maldives, Malta, Moldova (Rep.), North Macedonia (Rep.), Norway, Oman, Panama, Peru, Portugal, Puerto Rico, Qatar, Russian Fed., Sao Tome and Principe, Saudi Arabia, Serbia, Singapore, Slovakia, South Africa, Spain, Sweden, Switzerland, USA, United Arab Emirates or United Kingdom. - This does not apply to nationals and residents of Slovenia. - This does not apply to nationals of Andorra, Monaco, Montenegro, North Macedonia (Rep.), San Marino, Serbia and Vatican City (Holy See) returning via Slovenia to their country of residence. - This does not apply to passengers with a diplomatic passport. 2. Passengers are subject to quarantine for 14 days.  "
  },
  {
    "code":"SK",
    "iso_alpha2": "SK",
    "continent": "EU",
    "name": "Slovakia",
    "score": "2.8 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 24.06.2020 1. flights to slovakia are suspended. - this does not apply to flights from austria, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, germany, greece, hungary, iceland, latvia, liechtenstein, lithuania, malta, monaco, montenegro, norway, poland, slovenia and switzerland. - this does not apply to medevac flights and flights carrying residents of slovakia. 2. passengers are not allowed to enter. - this does not apply to passengers arriving from austria, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, germany, greece, hungary, iceland, latvia, liechtenstein, lithuania, malta, monaco, montenegro, norway, poland, slovenia or switzerland. - this does not apply to nationals and residents of slovakia. 3. passengers who have visited a country other than austria, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, germany, greece, hungary, iceland, latvia, liechtenstein, lithuania, malta, monaco, montenegro, norway, poland, slovenia and switzerland in the past 14 days must have a medical certificate with a negative  () test result issued at most 96 hours before arrival. 4. passengers who have visited a country other than austria, bulgaria, croatia, cyprus, czechia, denmark, estonia, finland, germany, greece, hungary, iceland, latvia, liechtenstein, lithuania, malta, monaco, montenegro, norway, poland, slovenia and switzerland in the past 14 days are subject to medical screening and quarantine.  "
  },
  {
    "code":"SL",
    "iso_alpha2": "SL",
    "continent": "AF",
    "name": "Sierra Leone",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 02.07.2020 1. Flights to Sierra Leone are suspended until 15 July 2020. - This does not apply to humanitarian, medevac and repatriation flights. 2. Passengers are subject to medical screening and quarantine at their own expense.  "
  },
  {
    "code":"SM",
    "iso_alpha2": "SM",
    "continent": "EU",
    "name": "San Marino",
    "score": "4.5 (Extreme Warning)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 03.06.2020 1. Passengers are not allowed to enter - This does not apply to: - nationals or residents of Italy; - passengers traveling on business; - passengers traveling for urgent health reasons; - healthcare personnel traveling on duty; - passengers traveling for emergency reasons; - passengers returning via Italy to their country of residence; - passengers arriving from Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom. 2. Residence permits issued by Italy which have expired between 31 January and 31 July 2020, are considered valid until 31 August 2020. 3. Passengers must present a completed self-declaration form to the transporting carrier and must communicate their entry to the Department of Prevention at local health units (ASL) of the entrance district.  - This does not apply to passengers arriving from Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom.  4. Passengers are subject to quarantine for 14 days.  - This does not apply to passengers arriving from Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom.  - This does not apply to passengers traveling on business if their stay in Italy does not exceed 72 hours and if granted, the additional 48 hours of a justified extension for specific needs.  "
  },
  {
    "code":"SN",
    "iso_alpha2": "SN",
    "continent": "AF",
    "name": "Senegal",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 30.06.2020 Flights to Senegal are suspended until 15 July 2020.  "
  },
  {
    "code":"SO",
    "iso_alpha2": "SO",
    "continent": "AF",
    "name": "Somalia",
    "score": "5 (Extreme Warning)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 08.06.2020 Airports in Somalia are closed. - This does not apply to medical and humanitarian flights or technical landings where passengers and airline crew do not disembark. These flights must have a pre-authorization from the Somali Civil Aviation Authority obtained at <a href=mailto:scaa@scaa.gov.so>scaa@scaa.gov.so</a> . - This does not apply to emergency flights.  "
  },
  {
    "code":"SR",
    "iso_alpha2": "SR",
    "continent": "SA",
    "name": "Suriname",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 09.04.2020 Airports in Suriname are closed. - This does not apply to repatriation flights.  "
  },
  {
    "code":"SS",
    "iso_alpha2": "SS",
    "continent": "AF",
    "name": "South Sudan",
    "score": "5 (Extreme Warning)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 22.04.2020 Flights to South Sudan are suspended. - This does not apply to humanitarian and evacuation flights with an approval from the High Level Task Force of South Sudan.  "
  },
  {
    "code":"ST",
    "iso_alpha2": "ST",
    "continent": "AF",
    "name": "Sao Tome and Principe",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 30.06.2020 Flights to Sao Tome and Principe are suspended until 14 July 2020. - This does not apply to humanitarian, medevac, military and repatriation flights.  "
  },
  {
    "code":"SV",
    "iso_alpha2": "SV",
    "continent": "NA",
    "name": "El Salvador",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 24.06.2020  1. El Salvador (SAL) is closed until 22 July 2020. - This does not apply to humanitarian flights. 2. Passengers are subject to quarantine for 14 days.  "
  },
  {
    "code":"SX",
    "iso_alpha2": "SV",
    "continent": "NA",
    "name": "El Salvador",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 01.07.2020 1. passengers are not allowed to enter. - this does not apply to: - nationals of the netherlands with a resident permit issued by st. maarten.  - passengers arriving from anguilla, antigua and barbuda aruba, bonaire, st. eustatius and saba, curacao, guadeloupe, martinique, st. barthelemy, st. kitts and nevis, st. lucia or virgin isl. (british). they must have been in those countries for a minimum of 14 days before their departure.  - passengers arriving from austria, belgium, bulgaria, canada, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland or usa.  2. passengers arriving from austria, belgium, bulgaria, canada, croatia, cyprus, czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, romania, slovakia, slovenia, spain, sweden, switzerland or usa must have a medical certificate with a negative  () pcr test result issued at most 72 hours before arrival.  3. airline crew are subject to quarantine until their next departure flight.  "
  },
  {
    "code":"SY",
    "iso_alpha2": "SY",
    "continent": "AS",
    "name": "Syria",
    "score": "5 (Extreme Warning)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 02.07.2020 Flights to Syria are suspended until 9 July 2020. - This does not apply to humanitarian, medevac, military and repatriation flights. </p> "
  },
  {
    "code":"SZ",
    "iso_alpha2": "SZ",
    "continent": "AF",
    "name": "Swaziland",
    "score": "2.3 (Low Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 25.05.2020 1. Passengers are not allowed to enter Eswatini.  - This does not apply to nationals and residents of Eswatini. 2. Nationals and residents of Eswatini are subject to quarantine in designated locations for a period of 14 days.   "
  },
  {
    "code":"TC",
    "iso_alpha2": "TC",
    "continent": "NA",
    "name": "Turks and Caicos Islands",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 10.04.2020 Airports in Turks and Caicos Isl. are closed.   "
  },
  {
    "code":"TD",
    "iso_alpha2": "TD",
    "continent": "AF",
    "name": "Chad",
    "score": "3.7 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 26.04.2020 Airports in Chad are closed.  "
  },
  {
    "code":"TG",
    "iso_alpha2": "TG",
    "continent": "AF",
    "name": "Togo",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 25.04.2020 Flights to Togo are suspended. - This does not apply to repatriation flights.  "
  },
  {
    "code":"TH",
    "iso_alpha2": "TH",
    "continent": "AS",
    "name": "Thailand",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 01.07.2020 1. passengers and airline crew are not allowed to enter thailand until 31 july 2020. - this does not apply to: - nationals and residents of thailand; - passengers who are spouses, parents or children of a national of thailand; - airline crew with a return scheduled flight; - students. 2. passengers must have a medical certificate with a negative  () test result. 3. passengers must have an insurance to cover medical expenses in thailand. 4. passengers are subject to medical screening and quarantine. 5. airline crew are subject to self-isolation until their next flight.  "
  },
  {
    "code":"TJ",
    "iso_alpha2": "TJ",
    "continent": "AS",
    "name": "Tajikistan",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 30.06.2020  Flights to Tajikistan are suspended until 15 July 2020. - This does not apply to humanitarian, medevac and repatriation flights. 2. Passengers are subject to quarantine for 14 days.  3. Airline crew are subject to quarantine until their next flight.  "
  },
  {
    "code":"TL",
    "iso_alpha2": "TL",
    "continent": "OC",
    "name": "East Timor",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 03.06.2020 1. Passengers are not allowed to enter. - This does not apply to: - nationals and residents of Timor-Leste; - passengers born in Timor-Leste; - legal representatives of Timorese minors.  2. Passengers allowed to enter are subject to isolation for 14 days.  "
  },
  {
    "code":"TM",
    "iso_alpha2": "TM",
    "continent": "AS",
    "name": "Turkmenistan",
    "score": "3.6 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 25.06.2020 1. flights to turkmenistan are suspended until 20 july 2020. - this does not apply to repatriation flights of nationals and residents of turkmenistan. - this does not apply to technical stops if airline crew do not disembark the aircraft. 2. passengers arriving in turkmenistan:  - must have a medical certificate stating a negative  () test result issued at most 72 hours before departure by the competent authority of the county of residency; and - are subject to be tested for  on arrival and to self-isolation for 14 days.  "
  },
  {
    "code":"TN",
    "iso_alpha2": "TN",
    "continent": "AF",
    "name": "Tunisia",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 02.07.2020 1. passengers are not allowed to enter. - this does not apply to nationals of tunisia and passengers with a permanent residence permit issued by tunisia. - this does not apply to passengers arriving from andorra, antigua and barbuda, australia, austria, azerbaijan, bahamas, barbados, belize, bosnia and herzegovina, brunei darussalam, bulgaria, burkina faso, burundi, cambodia, cameroon, canada, chad, china (people's rep.), chinese taipei, comoros, cote d'ivoire, croatia, cuba, cyprus, czechia, denmark, djibouti, dominica, dominican rep., ecuador, el salvador, estonia, fiji, finland, france, gambia, georgia, germany, ghana, grenada, guinea, guyana, hungary, iceland, india, indonesia, iran, ireland (rep.), italy, jamaica, japan, jordan, kazakhstan, korea (rep.), kyrgyzstan, lao people's dem. rep., latvia, lebanon, liechtenstein, lithuania, luxembourg, malaysia, maldives, mali, malta, mauritius, mexico, monaco, mongolia, montenegro, morocco, nepal, new zealand, nicaragua, niger, norway, pakistan, paraguay, portugal, romania, senegal, serbia, seychelles, sierra leone, slovakia, spain, sri lanka, st. kitts and nevis, st. maarten, switzerland, tajikistan, thailand, timor-leste, togo, trinidad and tobago, uganda, uruguay, uzbekistan, viet nam, yemen or zambia.  2. passengers arriving from azerbaijan, bahamas, belize, bosnia and herzegovina, bulgaria, burkina faso, burundi, cameroon, canada, comoros, cyprus, czechia, djibouti, dominican rep., ecuador, el salvador, france, gambia, georgia, ghana, guinea, guyana, hungary, india, iran, jamaica, jordan, kazakhstan, korea (rep.), kyrgyzstan, latvia, lebanon, liechtenstein, lithuania, malaysia, maldives, mali, mexico, mongolia, montenegro, nepal, nicaragua, pakistan, paraguay, portugal, romania, senegal, serbia, sierra leone, spain, sri lanka, togo, uganda, uzbekistan, yemen or zambia must have a medical certificate with a negative  () pcr test result issued at most 72 hours before departure. 3. passengers are subject to quarantine for 14 days. 4. a completed health declaration form must be presented before boarding and to immigration upon arrival.  "
  },
  {
    "code":"TO",
    "iso_alpha2": "TO",
    "continent": "OC",
    "name": "Tonga",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 27.02.2020  1. passengers and airline crew arriving from or transiting through china (people's rep.), chinese taipei, hong kong (sar china) or macao (sar china) are not allowed to enter tonga. this does not apply if they have stayed in a country with no confirmed cases of  () for a period of minimum 14 days before entering tonga. they must have an official medical clearance undertaken within 3 days prior to arrival in tonga.  - this does not apply to nationals of tonga and their immediate family members.  - this does not apply to permanent residents of tonga and their immediate family members.  - this does not apply to airline crew on direct flights from china (people's rep.) who have been using appropriate personal protective equipment (ppe).  2. passengers must complete a 'traveler's arrival health declaration card' and submit it to the ministry of health border control when arriving in tonga.  "
  },
  {
    "code":"TR",
    "iso_alpha2": "TR",
    "continent": "AS",
    "name": "Turkey",
    "score": "3.6 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 12.06.2020 1.  () entry regulations lifted on 12 june 2020.  2. passengers and airline crew are subject to medical screening.  "
  },
  {
    "code":"TT",
    "iso_alpha2": "TT",
    "continent": "NA",
    "name": "Trinidad and Tobago",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 02.07.2020  Airports in Trinidad and Tobago are closed until 19 July 2020. - This does not apply if permitted by the Minister with responsibility for national security.  "
  },
  {
    "code":"TV",
    "iso_alpha2": "TV",
    "continent": "OC",
    "name": "Tuvalu",
    "score": "2.5 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 26.03.2020 Tuvalu's borders are closed.  "
  },
  {
    "code":"TW",
    "iso_alpha2": "TW",
    "continent": "AS",
    "name": "Taiwan",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 30.06.2020 1. passengers are not allowed to enter. - this does not apply to passengers with a chinese taipei travel document. - this does not apply to passengers with an alien resident certificate. - this does not apply to passengers with a diplomatic or an official passport traveling on duty. - this does not apply to passengers traveling on business. they must be able to prove their business travel purpose. - this does not apply to passengers with a special entry permit for  outbreak visa. 2. passengers are not allowed to transit. - this does not apply to passengers transiting through taoyuan (tpe) for a connecting flight within 8 hours operated by the same carrier group. they must not arrive from or depart to the mainland of china. 3. passengers are subject to quarantine for 14 days. 4. passengers must have a medical certificate in english with a negative  () test result issued at most 3 days before departure. - this does not apply to passengers with a chinese taipei travel document. - this does not apply to passengers with alien resident certificate for students. - this does not apply to passengers with a visa with remark dc, fd, fo, o, fl, fc, fs or er. - this does not apply to passengers with a mofa id. 5. a completed quarantine system for entry form must be submitted before departure at <a href=https://hdhq.mohw.gov.tw/>https://hdhq.mohw.gov.tw/</a> .  "
  },
  {
    "code":"TZ",
    "iso_alpha2": "TZ",
    "continent": "AF",
    "name": "Tanzania",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 06.07.2020 1. Passengers and airline crew are subject to medical screening and quarantine. 2. A completed Health Form must be presented to the Ministry of Health personnel upon arrival.   "
  },
  {
    "code":"UA",
    "iso_alpha2": "UA",
    "continent": "EU",
    "name": "Ukraine",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 23.06.2020 1. Flights to Ukraine restarted. 2. Passengers must have insurance to cover medical expenses in Ukraine. 3. Passengers are subject to quarantine.  "
  },
  {
    "code":"UG",
    "iso_alpha2": "UG",
    "continent": "AF",
    "name": "Uganda",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 26.06.2020 1. Flights to Uganda are suspended. - This does not apply to humanitarian, medevac and repatriation flights. 2. Passengers are subject to medical screening and quarantine. 3. Airline crew are subject to quarantine for 14 days.  "
  },
  {
    "code":"US",
    "iso_alpha2": "US",
    "continent": "NA",
    "name": "United States",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 08.06.2020 1. passengers who have transited or have been in austria, belgium, brazil, china (people's rep.), czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, iran, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, slovakia, slovenia, spain, sweden, switzerland or in the united kingdom (excluding overseas territories outside of europe), in the past 14 days are not allowed to enter the usa. -this does not apply to: - nationals and permanent residents of the usa; - spouses of nationals and of permanent residents of the usa; - parents/legal guardians of an unmarried and younger than 21 years national or permanent resident of the usa; - the unmarried and younger than 21 years brother or sister of a national or permanent resident of the usa, who is unmarried and younger than 21 years; - the child/foster child/ward of a national or permanent resident of the usa; - passengers with the following visas: a-1, a-2, c-1, c-1/d, c-2, c-3, d, e-1 (as an employee of tecro or teco or the employee's immediate family members), g-1, g-2, g-3, g-4, ir-4, ih-4, nato-1 through nato-4, or nato-6 visa; - members of the u.s. armed forces, spouses, and children of members of the u.s. armed forces; - passengers with evidence of traveling at the invitation of the usa government for a purpose related to the containment/mitigation of the  (); - passengers with documents issued by the u.s. department of homeland security, u.s. customs and border protection, or u.s. department of state indicating that the passenger is exempt from the restriction; - b1 crew crewmembers that are engaged in lightering, outer continental shelf (ocs) activity, wind farm activity, private air/sea crew and other similar crewmember actives. 2. passengers who have been in one of the countries listed in bullet number 1 in the past 14 days but are exempt from the restriction to enter the usa, must arrive at one of the following airports: atlanta (atl), boston (bos), chicago (ord), dallas, (dfw), detroit (dtw), ft. lauderdale (fll), honolulu (hnl), houston (iah), los angeles (lax), miami (mia), new york (jfk or ewr), san francisco (sfo), seattle (sea) and washington (iad). 3. passengers who have been in austria, belgium, brazil, china (people's rep.), czechia, denmark, estonia, finland, france, germany, greece, hungary, iceland, iran, ireland (rep.), italy, latvia, liechtenstein, lithuania, luxembourg, malta, netherlands, norway, poland, portugal, slovakia, slovenia, spain, sweden, switzerland or united kingdom (excluding overseas territories outside of europe) in the past 14 days but are exempt from the restriction to enter the usa, must self-quarantine for 14 days once they reach their final destination. 4. passports issued to nationals of belarus which have expired between 30 april 2020 and 31 july 2020, are considered valid with an extension of 3 months.  "
  },
  {
    "code":"UY",
    "iso_alpha2": "UY",
    "continent": "SA",
    "name": "Uruguay",
    "score": "3.4 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 23.06.2020  1. Flights to Uruguay are suspended. - This does not apply to humanitarian and repatriation flights.  2. Nationals and residents of Uruguay are subject to quarantine for 14 days. 3. Passengers can only land at Montevideo (MVD) and Punta del Este (PDP).   "
  },
  {
    "code":"UZ",
    "iso_alpha2": "UZ",
    "continent": "AS",
    "name": "Uzbekistan",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 24.03.2020 Flights to Uzbekistan are suspended.  "
  },
  {
    "code":"VA",
    "iso_alpha2": "VA",
    "continent": "EU",
    "name": "Vatican",
    "score": "5 (Extreme Warning)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 03.06.2020 1. Passengers are not allowed to enter - This does not apply to: - nationals or residents of Italy; - passengers traveling on business; - passengers traveling for urgent health reasons; - healthcare personnel traveling on duty; - passengers traveling for emergency reasons; - passengers returning via Italy to their country of residence; - passengers arriving from Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom. 2. Residence permits issued by Italy which have expired between 31 January and 31 July 2020, are considered valid until 31 August 2020. 3. Passengers must present a completed self-declaration form to the transporting carrier and must communicate their entry to the Department of Prevention at local health units (ASL) of the entrance district.  - This does not apply to passengers arriving from Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom.  4. Passengers are subject to quarantine for 14 days.  - This does not apply to passengers arriving from Andorra, Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Monaco, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom.  - This does not apply to passengers traveling on business if their stay in Italy does not exceed 72 hours and if granted, the additional 48 hours of a justified extension for specific needs.  "
  },
  {
    "code":"VC",
    "iso_alpha2": "VC",
    "continent": "NA",
    "name": "Saint Vincent and the Grenadines",
    "score": "2.5 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 19.06.2020 1. regulations related to  () have been lifted. 2. passengers are subject to medical screening and quarantine for 14 days.  "
  },
  {
    "code":"VE",
    "iso_alpha2": "VE",
    "continent": "SA",
    "name": "Venezuela",
    "score": "4.4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 25.06.2020  Flights to Venezuela are suspended until 12 July 2020. - This does not apply to humanitarian flights.  "
  },
  {
    "code":"VG",
    "iso_alpha2": "VG",
    "continent": "NA",
    "name": "British Virgin Islands",
    "score": "3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 04.06.2020 Passengers are not allowed to enter. - This does not apply to residents of Virgin Isl. (British).  "
  },
  {
    "code":"VI",
    "iso_alpha2": "VI",
    "continent": "NA",
    "name": "U.S. Virgin Islands",
    "score": "4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 04.06.2020 Passengers are subject to medical screening and quarantine.  "
  },
  {
    "code":"VN",
    "iso_alpha2": "VN",
    "continent": "AS",
    "name": "Vietnam",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 22.05.2020 1. passengers are not allowed to enter viet nam. - this does not apply to passengers on diplomatic or official duty. they will be subject to mandatory medical declaration and self-isolation. - this does not apply to passengers who are experts, business managers or highly skilled workers. they will be subject to mandatory medical declaration and self-isolation. - this does not apply to passengers approved by national steering committee on  prevention and control. 2. for transportation of nationals of vietnam returning to vietnam, airlines must contact the vietnamese diplomatic representative agency in the local country in advance. 3. all passengers will be placed on quarantine at a designated facility for 14 days upon arrival.  4. all visa issuances are suspended. 5. all passengers must fill out a quarantine form prior to arrival.  6. passengers who travel for diplomatic or official purpose will undergo a medical examination at the border.  7. nationals of italy and korea (rep.) with a normal passport are no longer visa exempt.  8. nationals of denmark, finland, france, germany, norway, spain, sweden and passengers with a british passport are no longer visa exempt. 9. passengers with a certificate of visa exemption issued by viet nam are no longer visa exempt if they reside in china (people's rep.), denmark, finland, france, germany, iran, italy, korea (rep.), norway, spain, sweden or united kingdom.  10. nationals of belarus, japan and russian fed. with a normal passport are no longer visa exempt. 11. nationals of belarus, japan and russian fed. with a normal passport and with a certificate of visa exemption issued by viet nam are no longer visa exempt. 12. airline crew are subject to mandatory medical declaration as well as observing self-quarantine during their stay until the next flight schedule.  "
  },
  {
    "code":"VU",
    "iso_alpha2": "VU",
    "continent": "OC",
    "name": "Vanuatu",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 30.03.2020  Vanuatu ports of entry are closed.  "
  },
  {
    "code":"WF",
    "iso_alpha2": "WF",
    "continent": "OC",
    "name": "Wallis and Futuna",
    "score": "0 (Information not available)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 01.04.2020 Flights to New Caledonia are suspended.  "
  },
  {
    "code":"WS",
    "iso_alpha2": "WS",
    "continent": "OC",
    "name": "Samoa",
    "score": "3.5 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 21.03.2020  1. all travelers, including returning residents entering samoa, must have a medical certificate issued by a registered medical practitioner issued within 3 days before their arrival into samoa.  2. passengers who have transited through or have been in australia, austria, bahrain, belgium, canada, china (people’s rep.), chinese taipei, czechia, denmark, france, germany, greece, hong kong (sar china), iceland, italy, iran, japan, korea (rep.), kuwait, luxembourg, macao (sar china), malaysia, netherlands, norway, qatar, singapore, spain, sweden, switzerland, thailand, united arab emirates or usa are not allowed to enter samoa. passengers must: a) spend at least 14 days in self-quarantine in a country of last port and must have a medical clearance within (3) days prior to final route to samoa. this must be their final stop before travelling to samoa.  b) provide proof of test results done within 5 days for the  (). passengers with  () positive test will not be allowed to enter samoa. 3. all travelers, including returning residents entering samoa, are required to undergo medical examination by a registered medical practitioner within 3 days before arrival. medical clearance report is required for check-in prior to issuing of boarding passes.  4. all travelers entering samoa, including samoan passport holders who are permanent residents of american samoa, are required to have medical examination within 3 days before entering. it has to be signed by the attending physician and counter-signed by the motusa tuileama nua, director of public health, american samoa.  5. compulsory screening of all arriving passengers and crew to samoa is in effect at all ports of entry. all are required to comply and produce additional documents when asked.  6. a special health declaration card has to be filled out by all passengers inflight or on arrival in to samoa.  "
  },
  {
    "code":"XK",
    "iso_alpha2": "YE",
    "continent": "AS",
    "name": "Yemen",
    "score": "5 (Extreme Warning)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 29.06.2020 1. regulations related to  () have been lifted. 2. passengers are subject to medical screening.  "
  },
  {
    "code":"YT",
    "iso_alpha2": "YT",
    "continent": "AF",
    "name": "Mayotte",
    "score": "4 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"published 06.05.2020  1. a completed international travel certificate must be presented prior to boarding and to immigration upon arrival or when transiting mayotte. the certificate must be obtained before departure via the french consular offices abroad or online at <a target=_blank href=https://www.interieur.gouv.fr/>https://www.interieur.gouv.fr</a>. 2. passengers must go through a medical examination upon arrival and are subject to quarantine for a period of 14 days. - this does not apply to healthcare professionals related to  ().  "
  },
  {
    "code":"ZA",
    "iso_alpha2": "ZA",
    "continent": "AF",
    "name": "South Africa",
    "score": "3.6 (High Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 12.06.2020 1. Flights to South Africa are suspended. - This does not apply to repatriation, medevac and emergency flights. 2. Nationals and residents of South Africa are subject to medical screening and quarantine for 21 days.  "
  },
  {
    "code":"ZM",
    "iso_alpha2": "ZM",
    "continent": "AF",
    "name": "Zambia",
    "score": "3.2 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 27.03.2020 1. All flights must arrive at Lusaka (LUN). 2. Passengers and airline crew must quarantine for at least 14 days at their own costs.  "
  },
  {
    "code":"ZW",
    "iso_alpha2": "ZW",
    "continent": "AF",
    "name": "Zimbabwe",
    "score": "3.3 (Medium Risk)",
    "updated": "2020-07-06 07:20:09",
    "description":"Published 19.05.2020 1. Except for BUQ, HRE and VFA, airports are closed. 2. BUQ, HRE and VFA airports are open for the following flights: - flights carrying staff for essential services or sick persons to hospitals and other health care providers;  - flights carrying a member of the staff of a foreign mission or agency going to or from such mission or agency, or a citizen, resident or protected subject of a foreign country going to or from a foreign mission of the country of which he or she is the citizen, resident or subject, for the purpose of obtaining services or assistance at such mission; - flights carrying police, defence forces personnel and other enforcement officers.  If any new travel restrictions will be imposed, we will ensure that Timatic is updated accordingly. We are monitoring this outbreak very closely and we will keep you posted on the developments."
  }
]