[
  {
    "continent": "",
    "iso_alpha2": "AE",
    "name": "United Arab Emirates",
    "score": "Partially restricted",
    "updated": "From July 7, 2020, foreign nationals may enter Dubai for tourism. All persons must carry a certificate issued no more than 96 hours prior to departure showing a negative test result for COVID-19 and undergo additional testing upon arrival in Dubai. Persons currently holding a valid residence visa for Dubai may apply for a return permit from the Federal Authority for Identity and Citizenship (ICA). Issued permits are valid for 21 days from the date of approval. Persons seeking to return to Dubai must apply for a Return Permit for Residents Outside the UAE from the General Directorate of Residency and Foreigners Affairs (GDRFA) – Dubai. More information is available at: https://u.ae/en/information-and-services/justice-safety-and-the-law/handling-the-covid-19-outbreak/travelling-amid-covid-19/travelling-to-the-uaeFrom August 1, 2020, persons arriving in (or transiting through) Abu Dhabi must carry proof of a negative result for COVID-19 issued no more than 96 hours prior to departure using a polymerase chain reaction (PCR) test performed by a UAE-approved testing provider. This policy does not apply to persons 12 years of age or younger, or persons with a recognized disability. Information on approved testing providers is available at the following URL: https://screening.purehealth.ae/application"
  },
  {
    "continent": "",
    "iso_alpha2": "AF",
    "name": "Afghanistan",
    "score": "Entry prohibited",
    "updated": "All commercial flights have been suspended until further notice."
  },
  {
    "continent": "",
    "iso_alpha2": "AG",
    "name": "Antigua and Barbuda",
    "score": "Partially restricted",
    "updated": "From July 1, 2020, all persons arriving in Antigua and Barbuda by air must carry documentation issued no more than 7 days prior to departure showing a negative result for COVID-19 using a real time reverse transcription polymerase chain reaction (RT-PCR) test. Persons arriving by sea are subject to quarantine measures in accordance with guidelines established by local health authorities. Passengers disembarking in Antigua and Barbuda must complete a health declaration and undergo a health screening for symptoms of COVID-19. All persons, regardless of their mode of transportation, will be monitored for COVID-19 for up to 14 days following their arrival in accordance with local health guidelines. More information is available at the following URL: https://visitantiguabarbuda.com/travel-advisory/"
  },
  {
    "continent": "",
    "iso_alpha2": "AL",
    "name": "Albania",
    "score": "Partially restricted",
    "updated": "Albania’s land border with Greece is closed until at least July 15, 2020."
  },
  {
    "continent": "",
    "iso_alpha2": "AM",
    "name": "Armenia",
    "score": "Partially restricted",
    "updated": "From September 11, 2020, all persons arriving in Armenia are subject to screening for COVID-19 performed by the Healthcare and Labor Inspectorate. Persons exhibited symptoms consistent with COVID-19 will be hospitalized for treatment. All others must self-isolate for 14 days or, during the self-isolation period, undergo a polymerase chain reaction (PCR) test for COVID-19. Those who test negative may end their self-isolation. All land border checkpoints are closed to foreign nationals. This policy does not apply to family members of Armenia nationals and lawful residents, representative of diplomatic missions, consular posts, international organizations, or their family members, persons arriving to attend the funeral or memorial service of a close relative, crews on cross-border cargo transportation, and persons granted special permission on a case-by-case basis by the local commander of the border guard."
  },
  {
    "continent": "",
    "iso_alpha2": "AO",
    "name": "Angola",
    "score": "Entry prohibited",
    "updated": "Foreign nationals are prohibited from entering Angola. This policy does not apply to long-term residents, diplomats, or persons engaged in the transportation of cargo, freight, or humanitarian aid. All persons arriving in Angola must carry proof of a negative test result for COVID-19 issued no more than 72 hours prior to departure. Upon arrival, all persons must submit a travel registration form and undergo a 14-day quarantine. More information is available at the following URL: https://viagem.covid19.gov.ao/en/"
  },
  {
    "continent": "",
    "iso_alpha2": "AR",
    "name": "Argentina",
    "score": "Entry prohibited",
    "updated": "Foreign nationals are prohibited from entering Argentina. This policy does not apply to legal residents. A nationwide home quarantine order is in effect until at least November 29, 2020. Most international flights are suspended."
  },
  {
    "continent": "",
    "iso_alpha2": "AS",
    "name": "American Samoa",
    "score": "Partially restricted",
    "updated": "Travelers from affected foreign countries or regions (Mainland China, Hong Kong SAR, South Korea)entering American Samoa have to spend 14 days in a country or region not affected by the coronavirus and acquire a 3-day health clearance — day 11 of the 14 days — before entry."
  },
  {
    "continent": "",
    "iso_alpha2": "AT",
    "name": "Austria",
    "score": "Partially restricted",
    "updated": "From October 8, 2020, foreign nationals are prohibited from entering Austria. This policy does not apply to citizens or lawful residents from countries or regions in the European Union, countries or regions associated with the Schengen Area, Australia, Japan, Canada, South Korea, New Zealand, United Kingdom, or Uruguay. All persons (including Austrian nationals) traveling from a country or region considered by Austrian authorities as high-risk for COVID-19 exposure must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Persons who do not carry such proof must undergo testing within 48 hours of arrival and self-isolate while awaiting their results. This policy does not apply to persons transiting through Austria. Additional information, including a current list of high-risk locations, is available at the following URL: https://www.austria.info/en/service-and-facts/coronavirus-information"
  },
  {
    "continent": "",
    "iso_alpha2": "AU",
    "name": "Australia",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Australia. This policy does not apply to lawful residents and their immediate family members, or persons traveling from New Zealand. Additional exemptions are possible on a case-by-case basis. Persons should apply online for an exemption at least 2 weeks prior to their intended departure. All persons arriving in Australia (including Australian nationals) must undergo a 14-day quarantine in a designated facility at their port of arrival. This policy does not apply to persons traveling from New Zealand to New South Wales, the Australian Capital Territory, the Northern Territory, or Victoria aboard special quarantine-free flights provided such persons have not traveled outside of New Zealand during the 14 days prior to their arrival in Australia. Applications for exemption from Australian travel restrictions are available at the following URL: https://travel-exemptions.homeaffairs.gov.au/tep"
  },
  {
    "continent": "",
    "iso_alpha2": "AW",
    "name": "Aruba",
    "score": "Entry prohibited",
    "updated": "From March 29, 2020, all persons are prohibited from entering Aruba. A 24-hour curfew is in place."
  },
  {
    "continent": "",
    "iso_alpha2": "AZ",
    "name": "Azerbaijan",
    "score": "Partially restricted",
    "updated": "All persons arriving in Azerbaijan will be screened for COVID-19. In cases of suspected exposure, persons will undergo further evaluation and quarantine at a designated facility. All others must self-isolate for 14-days after entry. Chinese and Iranian nationals are prohibited from entering Azerbaijan and the Azerbaijani government has suspended the issuing of new visas to persons holding Chinese or Iranian passports. All land border checkpoints with Iran, Georgia, Russia, and Turkey are closed. Persons wishing to travel to Azerbaijan must apply for a visa at an Azerbaijani embassy or consulate abroad. The issuing of e-visas is suspended."
  },
  {
    "continent": "",
    "iso_alpha2": "BA",
    "name": "Bosnia and Herzegovina",
    "score": "Partially restricted",
    "updated": "From September 10, 2020, foreign nationals arriving in Bosnia and Herzegovina must hold proof of a negative test result for COVID-19 issued no more than 48 hours prior to departure."
  },
  {
    "continent": "",
    "iso_alpha2": "BB",
    "name": "Barbados",
    "score": "Partially restricted",
    "updated": "Travelers will be screened, those showing symptoms will be quarantined."
  },
  {
    "continent": "",
    "iso_alpha2": "BD",
    "name": "Bangladesh",
    "score": "Partially restricted",
    "updated": "The Bangladeshi government has suspended all visa-on-arrival services until further notice. Foreign nationals must visit a Bangladeshi embassy or consulate abroad and produce a valid medical certificate showing they have not tested positive for COVID-19 in order to obtain a visa. Persons arriving in Bangladesh via air will undergo screening for COVID-19 upon arrival. Foreign nationals arriving from countries impacted by COVID-19 must undergo a 14-day quarantine."
  },
  {
    "continent": "",
    "iso_alpha2": "BE",
    "name": "Belgium",
    "score": "Partially restricted",
    "updated": "The Belgian government will designate countries / regions as either green (low risk), orange (moderate risk), or red (high risk) for COVID-19 infection based on determinations by Belgian national health authorities. Persons arriving from green countries or regions may enter Belgium. This includes persons traveling from Australia, Canada, Japan, New Zealand, Rwanda, South Korea, Thailand, and Uruguay. Persons arriving from orange countries or regions must undergo testing for COVID-19 and quarantine upon arrival. Travel is prohibited from red countries or regions. Updated listings are available at the following URL: https://diplomatie.belgium.be/enAll persons entering Belgium with the intention to remain more than 48 hours must complete a passenger locator form within 48 hours of arrival via the following URL: https://travel.info-coronavirus.be/public-health-passenger-locator-formFrom November 2, 2020, stricter lockdown measures are inforce nationwide including restrictions on social gatherings and events. More information is available at the following URL: https://www.info-coronavirus.be/en/"
  },
  {
    "continent": "",
    "iso_alpha2": "BF",
    "name": "Burkina Faso",
    "score": "Partially restricted",
    "updated": "From August 1, 2020, persons arriving in Burkina Faso must carry proof of a negative result for COVID-19 issued no more than 5 days prior to departure using a polymerase chain reaction (PCR) test performed by an approved healthcare service provider in their place of departure."
  },
  {
    "continent": "",
    "iso_alpha2": "BG",
    "name": "Bulgaria",
    "score": "Partially restricted",
    "updated": "Foreign nationals arriving in Bulgaria may need to show proof of a negative result for COVID-19 using a polymerase chain reaction (PCR) test and undergo a 14-day quarantine. This policy does not apply to persons traveling from certain countries / regions. An official list of such locations is available from Bulgarian authorities at the following URL: https://bulgariatravel.org/en/useful/practical-information-for-tourists-covid-19/"
  },
  {
    "continent": "",
    "iso_alpha2": "BH",
    "name": "Bahrain",
    "score": "Partially restricted",
    "updated": "From September 4, 2020, foreign nationals are prohibited from entering Bahrain. This policy does not apply to lawful residents, citizens from countries or regions in the Gulf Cooperation Council (GCC) who are eligible for visa-free travel to Bahrain, persons eligible to obtain a visa on arrival, persons holding a valid eVisa, diplomats, military personnel, airline crew members, or persons who hold official, service, or United Nations passports. Upon arrival, all persons must, at their own expense, undergo a polymerase chain reaction (PCR) test for COVID-19 and self-isolate while awaiting their test results. Persons intending to remain in Bahrain for more than 10 days must undergo an addition PCR test on the 10th day following arrival. The Bahraini government has announced the resumption of visa-on-arrival services for 68 countries and regions. To determine their eligibility, travelers should visit the following URL: https://evisa.gov.bh/"
  },
  {
    "continent": "",
    "iso_alpha2": "BI",
    "name": "Burundi",
    "score": "Partially restricted",
    "updated": "All persons arriving at Melchior Ndadaye International Airport (BJM) in Bujumbura must have the following: 1) a valid entry visa and a valid residence visa, 2) proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test, and 3) proof of a valid reservation at a specially-designated arrival hotel. All persons must, at their own expense of US$100, undergo an additional PCR test upon arrival and self-isolate 1-2 days at a designated hotel while awaiting results. Should any passenger on an arriving flight test positive for COVID-19, all persons on the same fight must undergo a second post-arrival PCR test and self-isolate while awaiting results. Persons who test positive will be transferred to an appropriate care center. All persons seeking to depart Burundi must have proof of a negative PCR test issued no more than 72 hours prior to scheduled departure as well as an invoice showing payment in full of US$100 for testing costs."
  },
  {
    "continent": "",
    "iso_alpha2": "BJ",
    "name": "Benin",
    "score": "Partially restricted",
    "updated": "All non-essential travel to Benin is prohibited. Persons seeking to enter Benin must undergo screening for COVID-19 and those exhibiting symptoms will be quarantined. Persons arriving at Cotonou Cadjehoun Airport (COO) must, at their own expense, undergo testing for COVID-19 upon arrival and again after 15 days. The cost of testing is 50,000 West African CFA francs. Persons who test positive will be sent to designated facilities for quarantine and treatment. All travelers must complete the health declaration form found at the following URL prior to arrival in Benin: https://centresurveillancesanitaire.bj/"
  },
  {
    "continent": "",
    "iso_alpha2": "BN",
    "name": "Brunei Darussalam",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering or transiting through Brunei Darussalam. From September 15, 2020, the following categories of persons may apply for an Entry Pass to travel to Brunei Darussalam: essential business or official travelers, students, persons traveling for medical treatment, and persons traveling for compassionate or other special circumstances such as family reunions with Bruneian nationals or lawful residents. All persons traveling with an Entry Pass must hold proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test and self-isolate for up to 14 days upon arrival. Additional information is available at the following URL: http://www.pmo.gov.bn/travelportal/Home.aspx"
  },
  {
    "continent": "",
    "iso_alpha2": "BO",
    "name": "Bolivia",
    "score": "Partially restricted",
    "updated": "From September 1, 2020, persons arriving in Bolivia via air must show proof of a negative test result for COVID-19 issued no more than 7 days prior to departure and confirmed by a local Bolivian embassy or consulate where the test was performed. All land and river border checkpoints remain closed."
  },
  {
    "continent": "",
    "iso_alpha2": "BR",
    "name": "Brazil",
    "score": "Partially restricted",
    "updated": "The entry into Brazil by foreign nationals is restricted to arrivals by air. All land and sea border checkpoints remain closed. This policy does not apply to foreign nationals crossing land border checkpoints from Paraguay provided they are in compliance with all relevant immigration provisions including having a valid visa where appropriate. Further exemptions to land border restrictions exist for permanent residents, foreign professionals employed by a non-governmental aid organization recognized by the Brazilian government, foreign officials accredited by the Brazilian government, spouses, domestic partners, sons or daughters, fathers or mothers, or caregivers of a Brazilian citizen, any person whose entrance into Brazil is deemed by the government to be in the public interest, or persons engaged in the transportation of cargo. Persons seeking humanitarian access and cross-border migrant workers may enter with appropriate documentation."
  },
  {
    "continent": "",
    "iso_alpha2": "BS",
    "name": "Bahamas",
    "score": "Partially restricted",
    "updated": "All persons traveling to the Bahamas must show proof of a negative result for COVID-19 issued no more than 5 days prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. This policy does not apply to children 10 years of age or younger. All travelers must apply online for a Bahamas Travel Health Visa prior to departure. This includes a mandatory opt-in for travel health insurance valid for the duration of stay in the Bahamas. Travel Health Visa applications are available at the following URL: https://travel.gov.bs/"
  },
  {
    "continent": "",
    "iso_alpha2": "BT",
    "name": "Bhutan",
    "score": "Entry prohibited",
    "updated": "From March 25, 2020, all land border checkpoints are closed."
  },
  {
    "continent": "",
    "iso_alpha2": "BW",
    "name": "Botswana",
    "score": "Entry prohibited",
    "updated": "International flights are suspended and cross-border movement between neighboring countries / regions (including Eswatini and Lesotho) is restricted. Foreign nationals who have visited countries or regions the Botswanan government considers high-risk for COVID-19 are prohibited from entering. Botswanan nationals returning from such locations must undergo a 14-day quarantine upon arrival. A nationwide state of emergency is in effect and all persons seeking to travel to different regions within Botswana must obtain a movement permit. More information is available at the following URL: https://covid19.gov.bw/"
  },
  {
    "continent": "",
    "iso_alpha2": "BY",
    "name": "Belarus",
    "score": "Partially restricted",
    "updated": "From October 29, 2020, all persons arriving in Belarus must self-isolate for 10 days upon arrival. This policy does not apply to persons arriving from the following countries / regions: Austria, Albania, China, Estonia, Finland, Germany, Greece, Hungary, Italy, Latvia, Monaco, Montenegro, Norway, Serbia, and Spain. An official list from the Belarusian government is available at the following URL: http://minzdrav.gov.by/ru/novoe-na-sayte/Belarusian land border checkpoints with Latvia, Lithuania, Poland, and Ukraine are closed. This policy does not apply to persons holding diplomatic passports or crew members engaged in the cross-border transportation of goods or passengers. To better facilitate arrival, foreign nationals are encouraged to carry proof of a negative result for COVID-19 issued no more than 48 hours prior to departure using a polymerase chain reaction (PCR) test."
  },
  {
    "continent": "",
    "iso_alpha2": "BZ",
    "name": "Belize",
    "score": "Partially restricted",
    "updated": "From October 1, 2020, all persons arriving in Belize must undergo a polymerase chain reaction (PCR) test for COVID-19. This policy does not apply to persons who carry proof of a negative PCR test result issued no more than 72 hours prior to departure. Persons who test positive must undergo a 14-day quarantine at their own expense. All persons are required to install the latest version of the Belize Travel Health app onto their mobile devices and submit the requested information therein no more than 72 hours prior to departure. Additional details are available at the following URL: https://www.belizetourismboard.org/news-and-gallery/belize-covid-19-update/"
  },
  {
    "continent": "",
    "iso_alpha2": "CA",
    "name": "Canada",
    "score": "Entry prohibited",
    "updated": "Foreign nationals are prohibited from entering Canada. This policy does not apply to lawful permanent residents, persons with special authorization, persons registered under Canada’s Indian Act, or protected persons. Further exemptions exist for foreign nationals who are an immediate or extended family member of a Canadian citizen or permanent residents and who intend to remain in Canada for more than 15 days, persons authorized by the Canadian Public Health Agency to enter Canada for compassionate reasons, and persons who meet specific criteria for exemption from Canadian travel restrictions. All persons entering Canada must undergo a 14-day quarantine at a suitable location. Prior to departure, travelers must submit their personal information and a quarantine plan online via the ArriveCAN website or mobile application. Quarantine plans must include details on how the traveler intends to proceed to their quarantine location, how the traveler will obtain necessary items such as food, and how the traveler will access essential services or medical care if necessary. Border officials will access this information at the port of entry. Canada’s land border with the United States is closed to all non-essential travel until further notice. Be advised, some province-level authorities in Canada have implemented additional policies and restrictions for persons arriving into their jurisdictions. Additional information, including about the ArriveCAN system, is available at the following URL: https://www.canada.ca/en/immigration-refugees-citizenship/services/coronavirus-covid19/travel-restrictions-exemptions.html"
  },
  {
    "continent": "",
    "iso_alpha2": "CD",
    "name": "Democratic Republic of the Congo",
    "score": "Partially restricted",
    "updated": "From October 31, 2020, all persons must submit a registration form online and obtain a QR code for travel to DR Congo. Upon arrival, all persons must undergo a polymerase chain reaction (PCR) test for COVID-19. Persons traveling domestically must carry proof of a negative PCR test result issued no more than 7 days prior to their date of travel. Persons departing Kinshasa for destinations abroad must present their travel documents at the Congolese National Institute for Biomedical Research (INRB) 72 hours prior to their scheduled departure in order to undergo a PCR test for COVID-19. Registration forms are available from the INRB the following URL: https://inrbcovid.com/"
  },
  {
    "continent": "",
    "iso_alpha2": "CF",
    "name": "Central African Republic",
    "score": "Entry prohibited",
    "updated": "Persons arriving at Bangui M'Poko International Airport (BFG) must complete a health questionnaire and undergo a 14-day quarantine. The wearing of face masks is mandatory in public spaces."
  },
  {
    "continent": "",
    "iso_alpha2": "CG",
    "name": "Republic of the Congo",
    "score": "Partially restricted",
    "updated": "From August 24, 2020, persons arriving in the Republic of the Congo must undergo a reverse transcription polymerase chain reaction (RT-PCR) test for COVID-19 upon arrival. This policy does not apply to persons who carry proof of a negative RT-PCR test result issued no more than 72 hours prior to departure. Persons who test positive on arrival will be transferred to a designated location for treatment. All other persons must self-isolate for 14 days. A daily curfew is in effect from 22:00 (10:00 p.m.) to 05:00 (5:00 a.m.) nationwide, expect for Brazzaville and Pointe-Noire where curfew begins at 20:00 (8:00 p.m.)."
  },
  {
    "continent": "",
    "iso_alpha2": "CH",
    "name": "Switzerland",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Switzerland. This policy does not apply to persons arriving from countries or regions in the European Union, countries or regions associated with the Schengen Area, Algeria, Andorra, Australia, Canada, Georgia, Japan, Morocco, Monaco, New Zealand, Rwanda, Romania, San Marino, South Korea Thailand, Tunisia, Uruguay, or Vatican City. Persons arriving from countries or regions deemed by the Swiss Federal Office of Public Health to be at increased risk for COVID-19 infection must undergo a 10-day quarantine upon arrival."
  },
  {
    "continent": "",
    "iso_alpha2": "CI",
    "name": "Côte d'Ivoire",
    "score": "Partially restricted",
    "updated": "All persons arriving in Côte d'Ivoire must provide proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test and complete an online travel declaration form at the following URL: http://www.deplacement-aerien.gouv.ci/"
  },
  {
    "continent": "",
    "iso_alpha2": "CK",
    "name": "Cook Islands",
    "score": "Partially restricted",
    "updated": "From March 25, all travelers will be denied entry, except for: New Zealand passport holders; New Zealand Permanent Resident holder; Australia Citizens and Permanent Residents who normally live in New Zealand; Cook Islanders; Permanent Residents of the Cook Islands; Cook Islands Work permit holders; Cook Island Residents permit holders.Entry will also be permitted for any immediate family (partner or spouse, legal guardian and dependent children) if they are travelling with one of the above persons. All new arrivals are required to undergo supervised quarantine for 14 days upon arrival."
  },
  {
    "continent": "",
    "iso_alpha2": "CL",
    "name": "Chile",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Chile. This policy does not apply to lawful residents. All border checkpoints are closed until further notice. A nationwide curfew is in effect nightly from 22:00 (10:00 p.m.) to 05:00 (5:00 a.m.). All international flights are suspended."
  },
  {
    "continent": "",
    "iso_alpha2": "CM",
    "name": "Cameroon",
    "score": "Partially restricted",
    "updated": "From October 6, 2020, all persons traveling to Cameroon must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test."
  },
  {
    "continent": "",
    "iso_alpha2": "CN",
    "name": "Mainland China",
    "score": "Partially restricted",
    "updated": "New COVID-19 Testing Requirements for Travel to Mainland China <span style=font-family: Arial; font-size: 15px; white-space: pre-wrap; display: inline !important;>From December 1, 2020, all persons (including Chinese nationals) traveling from abroad to destinations in Mainland China must have proof of dual negative results for COVID-19 using both a nucleic acid test and a serological test for IgM antibodies. Both tests must be performed no more than 48 hours prior to departure and results must be submitted for approval to a local Chinese embassy or consulate. Chinese nationals should upload results into their mobile Health QR Code app in order to obtain a green code containing an HS designation, which they must present to airline staff prior to boarding. Foreign nationals are advised to check with their local Chinese embassy or consulate for instructions on how to submit copies of their negative test results, their passport information page, and a signed health declaration form for inspection and verification. Foreign nationals from certain countries and regions will, upon verification of their information, receive a QR code containing an HDC designation, which they must present to airline staff prior to boarding. All travelers are advised to check with a local Chinese embassy or consulate in all jurisdictions they intend to pass through on their way to China in order to confirm testing and document verification requirements. Whenever possible, travelers are strongly encouraged to book direct flights to China in order to avoid complications with testing and document verification in connecting locations. Limited exemptions to this policy exist. All persons (including Chinese nationals) must undergo a 14-day quarantine at a designated location upon arrival in Mainland China. This policy includes an option for persons entering via Shanghai to undergo a 7-day quarantine in a designated location followed by 7 days of self-isolation at home. Foreign nationals instructed to upload their travel information electronically may do so via the following URL: https://hrhk.cs.mfa.gov.cn/H5/<b style=font-size: 15px; white-space: pre-wrap;> <b style=font-size: 15px; white-space: pre-wrap;>Limited Resumption of Entry for Foreign Nationals From November 5, 2020, foreign nationals holding valid residence permits for work, personal affairs, or family reunions many once again enter Mainland China. This policy does not apply to persons traveling from certain countries / regions, including Bangladesh, Belgium, Ethiopia, France, India, Italy, Nigeria, Philippines, Russia, Ukraine, and the United Kingdom. All travelers should consult their local Chinese embassy or consulate for the latest information regarding travel to Mainland China from their location. Persons whose residence permits in the approved categories expired after March 28, 2020, may apply for a new entry visa at a Chinese embassy or consulate abroad provided their reasons for traveling to Mainland China have not changed. Such persons should bring the expired residence permit and supporting documentation with them when they reapply. All persons traveling to Mainland China are required to abide by all epidemic control and prevention measures currently in place.<b style=font-size: 15px; white-space: pre-wrap;>Resumption of Visa Applications for Certain Persons From August 25, 2020, persons from the following countries / regions are once again eligible to submit applications for a Chinese visa provided they meet certain criteria: Albania, Austria, Belgium, Bosnia and Herzegovina, Brunei Darussalam, Bulgaria, Cambodia, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Indonesia, Ireland, Italy, Japan, Laos, Latvia, Lithuania, Luxembourg, Malaysia, Malta, Montenegro, Myanmar, Netherlands, Norway, North Macedonia, Poland, Portugal, Romania, Serbia, Singapore, Slovakia, Slovenia, Spain, Sri Lanka, Sweden, Switzerland, Thailand, Timor-Leste, and Vietnam. In order to apply, persons must fall into one of the following categories:1) Persons who hold a valid Foreigner’s Residence Permit issued for work or who need to travel to China for family reunions or private matters;2) Persons who hold an Invitation Letter (PU/TE) or Verification Confirmation of Invitation issued by a provincial authority for cultural, economic, scientific, sporting, technological, or trade purposes;3) Persons who hold a Notification Letter of Foreigners Work Permit and a Invitation Letter (PU/TE) or a Verification Confirmation of Invitation for work in China;4) Persons intending to visit an immediate family member (including parents, spouses, children, grandparents, or grandchildren) who is in a critical medical condition, or to attend to funeral arrangements for said person. Documentation proving the relationship is required;5) Spouses or children under 18 of a Chinese national, or who themselves hold a valid Chinese Foreign Permanent Resident ID Card and who intend to visit China for the purposes of family reunion;6) Persons (including an accompanying spouse or children under the age of 18) intending to travel to China to care for their Chinese parents. Documentation proving the relationship is required;7) Persons who qualify to apply for a crew (C) visa.Persons are required to make an appointment online with the nearest Chinese Visa Application Centre before submitting any application materials in person. More information is available at the following URL:  https://www.visaforchina.org/<b style=font-size: 15px; white-space: pre-wrap;>Fast Lane Immigration Clearance for Singaporean Nationals From June 8, 2020, Singaporean nationals traveling to one of the following 6 provinces or municipalities in China for business purposes may qualify for special fast lane immigration clearance: Chongqing, Guangdong, Jiangsu, Shanghai, Tianjin, or Zhejiang. To use fast lane, travelers must be sponsored by either a company or a government agency in China, which will file an application on the traveler's behalf with local provincial or municipal authorities. If approved, the traveler will receive an official invitation letter. Travelers must then apply for a visa from the Chinese embassy in Singapore and submit a health declaration to Chinese authorities.No more than 48 hours prior to departure, fast lane travelers must undergo a polymerase chain reaction (PCR) test for COVID-19. Airlines will conduct pre-boarding checks to verify the traveler holds approval for fast lane clearance, a negative PCR test result, a return air ticket, and a valid visa. Failure to produce these documents may result in a denial of permission to board the aircraft.Upon arrival, fast lane travelers will undergo an additional PCR test and a serology test at their own expense. Travelers must then remain in a location designated by the local provincial or municipal government while awaiting their test results. Upon confirmation of a negative test result, the host company or government agency will ensure the traveler is transported between their designated accommodation and workplace for the duration of their stay. Fast lane travelers are required to use the local Health QR code system for the duration of their stay in China. Fast lane travelers are not permitted to use public transportation while in China.<b style=font-size: 15px; white-space: pre-wrap;>Fast-Track Immigration Clearance for Korean Nationals From May 1, 2020, Korean nationals traveling to China for business purposes may qualify for special fast-track immigration clearance provided they meet the following criteria:1) They are sponsored by a Korean or Chinese firm in China that has successfully applied for permission to use the fast-track program;2) They hold a letter of invitation from the sponsoring firm;3) They were issued a valid visa by a Chinese embassy or consulate in Korea.Prior to departing for China, persons using the fast-track program must:1) Self-monitor for 14 days for symptoms of COVID-19;2) Obtain a certificate issued no more than 72 hours prior to scheduled departure from a healthcare provider designated by the Ministry of Health and Welfare stating they have tested negative for COVID-19.Upon arrival in China, persons using the fast-track program must:1) Undergo 1-2 days quarantine at a designated location;2) Test negative for COVID-19 on both a polymerase chain reaction (PCR) and a serological (antibody) test;3) Use prearranged transportation to their final destination upon confirmation of negative test results.Korea nationals using the fast-track program are restricted to the following regions in China: Anhui Province, Chongqing Municipality, Guangdong Province, Jiangsu Province, Liaoning Province, Shaanxi Province, Shandong Province, Shanghai Municipality, Sichuan Province, and Tianjin Municipality.<b style=font-size: 15px; white-space: pre-wrap;>Quarantine-Free Entry for Persons Traveling from Macau SAR From August 12, 2020, persons traveling from Macau SAR to destinations in Mainland China are eligible for quarantine-free entry provided they meet the following criteria:1) They hold valid travel documents to visit Mainland China;2) They have not traveled outside Macau SAR or Mainland China during the 14 consecutive days prior to their intended arrival in Mainland China;3) They hold proof of a negative test for COVID-19 issued no more than 7 days prior to departure using a PCR test, or can show their official health code contains that information;4) They comply with all relevant epidemic prevention and control measures including submitting a health declaration form upon arrival in Mainland China.Persons unable to satisfy these requirements will be required to undergo a 14-day quarantine.<b style=font-size: 15px; white-space: pre-wrap;>All Others From September 28, 2020, the following policies are in place:1) Residents of Hong Kong SAR, Macau SAR, and Taiwan must undergo a nucleic acid test for COVID-19 and a 14-day quarantine upon arrival in Mainland China. This policy provides a limited exemption for travelers from Macau SAR (see above);2) The following visa-free or temporary visa arrangements are temporarily suspended:Port visas, 24/72/144-hour visa-free transit, Hainan 30-day visa-free entry, 15-day visa-free entry for foreign cruise ships or groups tours at Shanghai Port, Guangdong 144-hour visa-free entry for foreign tour groups from Hong Kong SAR or Macau SAR, and Guangxi 15-day visa-free entry for foreign tour groups from ASEAN countries.3) Diplomatic, service, courtesy, or C visas are not impacted;4) Foreign nationals coming to China for necessary economic, trade, scientific or technological activities, or for emergency humanitarian needs may continue to apply for visas at Chinese embassies or consulates. Foreign nationals holding visas issued after these policies were implemented may enter China.Be advised, many provincial authorities in China have implemented additional policies and restrictions on both Chinese and foreign nationals arriving into their jurisdictions. You are advised to verify all local requirements at your destination."
  },
  {
    "continent": "",
    "iso_alpha2": "CO",
    "name": "Colombia",
    "score": "Entry prohibited",
    "updated": "Foreign nationals are prohibited from entering Colombia. This policy does not apply to lawful residents arriving via special authorized flights. All air and land border checkpoints are closed to passenger traffic until further notice."
  },
  {
    "continent": "",
    "iso_alpha2": "CR",
    "name": "Costa Rica",
    "score": "Partially restricted",
    "updated": "From November 1, 2020, foreign nationals traveling to Costa Rica must fulfill the following requirements: 1) hold a valid visa (if required), 2) submit a Health Pass form online prior to departure, 3) hold proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test, and 4) carry travel insurance valid for use in Costa Rica with a minimum coverage amount of US$50,000 including at least US$2,000 for lodging expenses incurred as a result of the pandemic. This policy does not apply to diplomats. Health Pass forms are available online at the following URL: https://salud.go.crUntil November 1, 2020, Costa Rican authorities have restricted the locations from where persons can travel to Costa Rica. More information is available at the following URL: https://www.visitcostarica.com/en/costa-rica/planning-your-trip/entry-requirements"
  },
  {
    "continent": "",
    "iso_alpha2": "CU",
    "name": "Cuba",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Cuba until further notice. This policy does not apply to foreign workers employed in Cuba. All persons allowed to enter must undergo a 14-day quarantine. Cargo flights and shipments are permitted; however, crew members aboard such vessels are subject to health monitoring."
  },
  {
    "continent": "",
    "iso_alpha2": "CV",
    "name": "Cape Verde",
    "score": "Partially restricted",
    "updated": "From October 12, 2020, all persons must show proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test."
  },
  {
    "continent": "",
    "iso_alpha2": "CW",
    "name": "Curacao",
    "score": "Entry prohibited",
    "updated": "From March 24, 2020, all persons are prohibited from entering Curaçao. A 24-hour curfew is in place."
  },
  {
    "continent": "",
    "iso_alpha2": "CY",
    "name": "Cyprus",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Cyprus. This policy does not apply to nationals from the following countries or regions: Australia, Canada, Denmark, Estonia, Finland, Germany, Greece, Hong Kong SAR, Iceland, Ireland, Italy, Japan, Latvia, Liechtenstein, Lithuania, Mainland China, New Zealand, Norway, Poland, Rwanda, San Marino, Serbia, South Korea, Sweden, Thailand, United Kingdom, Uruguay, and Vatican City.Persons traveling from certain countries / regions must present a certificate showing a negative test result for COVID-19 using a polymerase chain reaction (PCR) test performed no more than 72 hours prior to departure for Cyprus. More information is available at the following URL: more information is available at: https://cyprusflightpass.gov.cy/en/country-categoriesAll persons traveling to Cyprus should apply online for the CyprusFlightPass 24 hours before their scheduled flight time. Applications may be found at: https://cyprusflightpass.gov.cy/"
  },
  {
    "continent": "",
    "iso_alpha2": "CZ",
    "name": "Czech Republic",
    "score": "Entry prohibited",
    "updated": "From October 21, 2020, foreign nationals are prohibited from entering the Czech Republic. This policy does not apply for persons traveling for essential reasons and cross-border workers. Additional information is available at the following URL: https://www.mvcr.cz/mvcren/article/coronavirus-information-of-moi.aspx"
  },
  {
    "continent": "",
    "iso_alpha2": "DE",
    "name": "Germany",
    "score": "Partially restricted",
    "updated": "From November 8, 2020, foreign nationals are prohibited from entering Germany. This policy does not apply to citizens from countries or regions in the European Union, countries or regions associated with the Schengen Area, Australia, New Zealand, Thailand, United Kingdom, or Uruguay. Further exemptions exist for persons performing essential functions in Germany, persons traveling to Germany for essential reasons, or the unmarried partners of German nationals or legal residents currently living in Germany. Travelers from Hong Kong SAR, Japan, Macau SAR, Mainland China, and South Korea will be permitted to travel to Germany once the German government confirms those locations allow reciprocal access for German nationals. All persons (including German nationals) who, within 10 days of their scheduled departure for Germany, have visited a country or region the Robert-Koch-Institut has designated as a high-risk location must submit an online health registration form prior to departure. The current list of high-risk locations is available from the following URL: https://www.rki.de/DE/Content/InfAZ/N/Neuartiges_Coronavirus/Transport/Archiv_Risikogebiete/EN-Tab.htmlProof of registration is required for entry into Germany and all persons having visited a high-risk area must undergo a 14-day quarantine upon arrival. This policy provides exceptions for travelers who present a certificate showing a negative result for COVID-19 issued no more than 48 hours prior to departure using a polymerase chain reaction (PCR) test performed by a testing provider recognized by the Robert-Koch-Institut. Persons unable to produce such a certificate must undergo testing no more than 10 days following their arrival and are required to self-isolate while awaiting their test results. All persons entering Germany from abroad will have the option to undergo free testing for COVID-19 upon arrival. Be advised, many state-level authorities in Germany have implemented additional policies and restrictions for persons arriving into their jurisdictions.  Health registration forms are available at the following URL: https://www.einreiseanmeldung.de/"
  },
  {
    "continent": "",
    "iso_alpha2": "DJ",
    "name": "Djibouti",
    "score": "Normal",
    "updated": "From July 17, 2020, all persons arriving in Djibouti are subject to testing for COVID-19 at their own expense."
  },
  {
    "continent": "",
    "iso_alpha2": "DK",
    "name": "Denmark",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Denmark. This policy does not apply to persons arriving from countries or regions in the European Union (with the exception of Belgium, Bulgaria, Luxembourg, Malta, Romania, and Spain) countries or regions associated with the Schengen Area (with the exception of Andorra and Monaco), Australia, Japan, New Zealand, Singapore, South Korea, Thailand, and Uruguay. Foreign nationals seeking to travel to Denmark must have a worthy purpose or present documentation showing a minimum stay of 6 nights. This policy does not apply to persons arriving from Norway, the provinces of Scania, Halland, or Blekinge in Sweden, or the state of Schleswig-Holstein in Germany. Health screening will occur at border checkpoints and persons exhibiting symptoms of illness will be denied entry. Additional information is available at the following URL: https://politi.dk/en/coronavirus-in-denmark/travelling-in-or-out-of-denmark/is-my-country-open-or-banned"
  },
  {
    "continent": "",
    "iso_alpha2": "DM",
    "name": "Dominica",
    "score": "Partially restricted",
    "updated": "All persons traveling to Dominica must fill in and submit a health questionnaire online at least 24 hours prior to departure and obtain a notification of clearance to travel. Upon arrival, all persons must present their notification for inspection as well as proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction test. Health questionnaire forms are available at the following URL: http://domcovid19.dominica.gov.dm . Health questionnaires and additional information are available at the following URL: https://discoverdominica.com/travel-advisory-for-dominica"
  },
  {
    "continent": "",
    "iso_alpha2": "DO",
    "name": "Dominican Republic",
    "score": "Partially restricted",
    "updated": "From September 15, 2020, all persons arriving in the Dominican Republic will undergo temperature screening. Additionally, between 3% and 10% of arriving passengers will be randomly selected to undergo rapid testing for COVID-19. All persons exhibiting symptoms consistent with COVID-19 must undergo testing. Symptomatic persons and those who test positive will be isolated. All persons are required to fill in and submit a Traveler's Health Affidavit. More information is available at the following URL: https://www.godominicanrepublic.com/newsroom/coronavirus/"
  },
  {
    "continent": "",
    "iso_alpha2": "DZ",
    "name": "Algeria",
    "score": "Entry prohibited",
    "updated": "The government declared state of emergency on March 17, all borders have been closed, all air and sea travel have been suspended. From July 9, 2020, the government has imposed a partial confinement for at least 15 days."
  },
  {
    "continent": "",
    "iso_alpha2": "EC",
    "name": "Ecuador",
    "score": "Partially restricted",
    "updated": "From September 15, 2020, all persons arriving in Ecuador must have proof of a negative result for COVID-19 issued no more than 10 days prior to departure using a polymerase chain reaction (PCR) test and cannot be exhibiting symptoms consistent with COVID-19. Upon arrival, all persons must undergo additional rapid-result testing for COVID-19 and a period of Mandatory Preventive Isolation (APO). Those who test positive will be isolated and given a PCR test for confirmation. All land and sea border checkpoints are closed."
  },
  {
    "continent": "",
    "iso_alpha2": "EE",
    "name": "Estonia",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Estonia. This policy does not apply to persons arriving from countries or regions in the European Union, countries or regions associated with the Schengen Area, or the United Kingdom. Foreign nationals arriving in Estonia must self-isolate for 14 days. This policy does not apply to persons who, within 14 days of their arrival in Estonia, have remained within a country / region where the rate of new COVID-19 infections does not exceed 15 per 100,000 inhabitants."
  },
  {
    "continent": "",
    "iso_alpha2": "EG",
    "name": "Egypt",
    "score": "Partially restricted",
    "updated": "From September 1, 2020, all persons (including Egyptian nationals) must present proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. This policy does not apply to those age six or under. Upon arrival, all persons must undergo temperature screening and must comply with all relevant epidemic prevention measures."
  },
  {
    "continent": "",
    "iso_alpha2": "ER",
    "name": "Eritrea",
    "score": "Entry prohibited",
    "updated": "From March 25, 2020, commercial passenger flights to and from Eritrea are suspended. From April 2, 2020, a nationwide lockdown is in effect."
  },
  {
    "continent": "",
    "iso_alpha2": "ES",
    "name": "Spain",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Spain. This policy does not apply to persons arriving from countries or regions in the European Union, countries or regions associated with the Schengen Area, Australia, Japan, New Zealand, Rwanda, Singapore, South Korea, Thailand, and Uruguay. Further exemptions exist for persons engaged in the transportation of cargo, diplomatic staff and consular agents accredited in Spain and travelling in the course of their official duties, and people who normally reside on Spanish territory. From November 23, 2020, all persons arriving from locations considered high-risk for the spread of COVID-19 based on determinations by Spanish health authorities must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Upon arrival, all persons must undergo health screening and those suspected of suffering from COVID-19 must undergo additional testing. All persons arriving in Spain from a country or region not listed above must undergo a 14-day quarantine upon arrival. Additionally, all persons traveling to Spain by air must fill in an online sanitary control form (FCS) prior to departure via the following URL: https://www.spth.gob.es/createA current list of high-risk locations is available from the Spanish government at the following URL (in Spanish): https://www.mscbs.gob.es/en/profesionales/saludPublica/ccayes/alertasActual/nCov/spth.htm"
  },
  {
    "continent": "",
    "iso_alpha2": "ET",
    "name": "Ethiopia",
    "score": "Partially restricted",
    "updated": "From September 23, 2020, all persons traveling to Ethiopia must present proof of a negative result for COVID-19 issued no more than 120 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. This policy does not apply to children age 12 years or younger or to transit passengers. All persons traveling on diplomatic or service passports, including their immediate family members, who do not carry proof of a negative RT-PCR test result must self-isolate for 14 days upon arrival."
  },
  {
    "continent": "",
    "iso_alpha2": "FI",
    "name": "Finland",
    "score": "Partially restricted",
    "updated": "From October 10, 2020, foreign nationals are prohibited from entering Finland. This policy does not apply to persons arriving from Australia, Cyprus, Japan, Latvia, Liechtenstein, New Zealand, Rwanda, South Korea, Thailand, Uruguay, or Vatican City. Further exemptions exist for persons traveling for work-related or essential reasons from countries or regions in the European Union, countries or regions associated with the Schengen Area, or the United Kingdom. Persons from other third-countries / regions may travel to Finland only for essential reasons. This does not include recreational travel. More information is available at the following URL: https://valtioneuvosto.fi/en/information-on-coronavirus/current-restrictionsForeign nationals arriving from locations where the rate of new COVID-19 infections exceeds 25 cases per 100,000 inhabitants according to the Finnish Institute for Health and Welfare must do one of the following: 1) self-isolate for 14 days upon arrival, 2) present a certificate showing a negative test result for COVID-19 issued no more than 72 hours prior to departure, undergo a second COVID-19 test 72 hours after arrival in Finland, and self-isolate while awaiting test results, or 3) undergo testing for COVID-19 upon arrival, again after 72 hours, and self-isolate while awaiting test results."
  },
  {
    "continent": "",
    "iso_alpha2": "FJ",
    "name": "Fiji",
    "score": "Entry prohibited",
    "updated": "Until July 31, 2020, all international flights on Fiji Airways are cancelled. Domestic flights will begin to resume May 15, 2020. A nationwide curfew from 20:00 (8:00 p.m.) to 05:00 (5:00 a.m.) is in effect."
  },
  {
    "continent": "",
    "iso_alpha2": "FM",
    "name": "Micronesia",
    "score": "Entry prohibited",
    "updated": "All persons are prohibited from entering Micronesia until further notice."
  },
  {
    "continent": "",
    "iso_alpha2": "FR",
    "name": "France",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering France. This policy does not apply to persons arriving from countries or regions in the European Union, Andorra, Australia, Iceland, Japan, Liechtenstein, Monaco, New Zealand, Norway, Rwanda, San Marino, Singapore, South Korea, Switzerland, Thailand, United Kingdom, and Vatican City. Further exemptions exist for spouses and children of French nationals, foreign nationals (and their spouses and children) holding valid French or European residence permits and who normally reside in France, diplomats, consular officials, and staff of international organizations working in France, foreign healthcare workers helping to combat COVID-19, crew members engaged in the international transportation of passengers or cargo, crew or personnel operating a merchant or fishing vessel, students with a long-stay visa (VLS) or short-stay visa (VCS) for study, professors or researchers employed or invited by a French higher education establishment or research laboratory, persons holding a Talent Passport or ICT posted worker long-stay visa, and persons traveling to France to receive treatment in a public or private hospital.Foreign nationals traveling from a country or region not listed above must carry the following documents: 1) an exempted international movement certificate for travel to metropolitan France and 2) a certificate stating the traveler is not exhibiting symptoms consistent with COVID-19. Persons who have visited one of the following locations within the 30 days of their scheduled departure for France must present proof of a negative test result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test: Algeria, Bahrain, China, DR Congo, Ecuador, Iran, Iraq, Israel, Lebanon, Morocco, Panama, Russia, South Africa, Turkey, Ukraine, United Arab Emirates, United States, and Zimbabwe. Persons without such documentation are prohibited from boarding flights bound for France. All persons arriving from a location not listed above must either: 1) present proof of a negative PCR test result for COVID-19 issued no more than 72 hours prior to departure, or 2) undergo PCR testing upon arrival in France. Certificates required by foreign nationals are available from the French Ministry of the Interior’s website at the following URL: https://www.interieur.gouv.fr/Actualites/L-actu-du-Ministere/Attestation-de-deplacement-et-de-voyage"
  },
  {
    "continent": "",
    "iso_alpha2": "GA",
    "name": "Gabon",
    "score": "Partially restricted",
    "updated": "From October 16, 2020, all persons must carry proof of a negative result for COVID-19 issued no more than 5 days prior to departure using a polymerase chain reaction (PCR) test administrated by a testing provider approved by health authorities in the location of departure. Upon arrival, all persons must undergo an additional PCR test at their own expense of up to 20,000 CFA francs and remain isolated until receiving confirmation of a negative result. All non-residents must undergo isolation at a designated location. This policy does not apply to persons aged six or under. Children aged 15 or under may enter Gabon without a visa provided they are accompanied by a parent or legal guardian who holds a valid visa. A nationwide curfew is in effect daily from 22:00 (10:00 p.m.) to 05:00 (5:00 a.m.)."
  },
  {
    "continent": "",
    "iso_alpha2": "GB",
    "name": "United Kingdom",
    "score": "Partially restricted",
    "updated": "All persons (including UK nationals) must fill in a Public Health Passenger Locator Form online to provide their journey and contact details no more than 48 hours prior to departure for the UK. This policy does not apply to persons arriving from Ireland, the Channel Islands, or the Isle of Man. Upon arrival, all persons must proceed directly to their place of residence and self-isolate for 14-days while remaining indoors. This does not apply to persons requiring urgent medical treatment, support from social services, food and medicine that cannot be delivered, those who need to attend the funeral of a close relative, or in case of emergency at the place of isolation. Visitors are not allowed during the self-isolation period, unless they are providing essential care. Note that Scotland and Wales each maintain their own lists of countries and regions subject to self-isolation requirements. The Public Health Passenger Locator Form can be found at the following URL: https://visas-immigration.service.gov.uk/public-health-passenger-locator-formFrom November 28, 2020, the UK self-isolation policy does not apply to persons arriving from one of the following locations, provided such persons have not visited any other country or region within 14 days of their departure for the United Kingdom: Akrotiri and Dhekelia, Anguilla, Antigua and Barbuda, Aruba, Australia, Bahrain, Barbados, Bermuda, Bonaire, Sint Eustatius, and Saba, British Antarctic Territory, British Indian Ocean Territory, British Virgin Islands, Brunei Darussalam, Bhutan, Cambodia, Cayman Islands, Chile, Crete, Cuba, Dominica, Estonia, Falkland Islands, Faroe Islands, Fiji, Finland, Gibraltar, Greenland, Grenada, Hong Kong SAR, Iceland, Ireland, Israel, Japan, Kiribati, Laos, Latvia, Macau SAR, Malaysia, Maldives, Mauritius, Micronesia, Mongolia, Montserrat, Namibia, New Caledonia, New Zealand, Northern Mariana Islands, Norway, Pitcairn, Henderson, Ducie and Oeno Islands, Qatar, Rwanda, Saint Barthelemy, Saint Kitts and Nevis, Saint Lucia, Saint Vincent and the Grenadines, Samoa, Seychelles, Singapore, South Georgia and the South Sandwich Islands, South Korea, Sri Lanka, St Helena Ascension and Tristan da Cunha, St Pierre and Miquelon, Taiwan, Thailand, the Channel Islands, the Isle of Man, the Solomon Islands, Timor-Leste, Tonga, Turks and Caicos Islands, United Arab Emirates, Uruguay, US Virgin Islands, Vanuatu, Vietnam. An updated list including sub-national regions is available at the following URL: https://www.gov.uk/guidance/coronavirus-covid-19-travel-corridors"
  },
  {
    "continent": "",
    "iso_alpha2": "GD",
    "name": "Grenada",
    "score": "Partially restricted",
    "updated": "All persons traveling to Grenada must have proof of a negative result for COVID-19 issued no more than 7 days prior to departure using a polymerase chain reaction (PCR) test and submit document online including their travel information and a “Waiver of Liability Agreement.” This policy do not apply to children age 5 or under. Upon arrival, all persons must undergo screening for COVID-19. Additional information is available at the following URL: https://covid19.gov.gd/travel/"
  },
  {
    "continent": "",
    "iso_alpha2": "GE",
    "name": "Georgia",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Georgia. This policy does not apply to nationals and permanent residents of the following countries/regions provided they arrive via air from one of these locations: Croatia, Cyprus, Estonia, France, Germany, Greece, Italy, Latvia, Lithuania, Luxemburg, Netherlands, Poland, Portugal, Romania, Spain, and Sweden. Additional exemptions exist for persons traveling from other locations for business reasons provided they receive special permission from relevant authorities in Georgia prior to departure. Business travelers must, at their own expense, undergo polymerase chain reaction (PCR) testing for COVID-19 every 72 hours or complete a 14-day quarantine.Nationals and permanent residents from Estonia, France, Germany, Latvia, and Lithuania who arrive via air from one of those locations must fill in an online form detailing their travel history during the 14 days prior to their departure and undergo a PCR test for COVID-19 upon arrival in Georgia. Nationals and permanent residents from Croatia, Cyprus, Greece, Italy, Luxemburg, Netherlands, Poland, Portugal, Romania, Spain, and Sweden must additionally undergo a 14-day quarantine at their own expense. Health declaration forms are available at the following URL: https://stopcov.ge/en"
  },
  {
    "continent": "",
    "iso_alpha2": "GH",
    "name": "Ghana",
    "score": "Partially restricted",
    "updated": "From September 1, 2020, persons arriving at Kotoka International Airport (ACC) in Accra must hold proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test performed by an accredited laboratory. This policy does not apply to persons returning to Ghana within 7 days of their last departure. Upon arrival, all persons age 5 and older must, at their own expense, undergo an additional test for COVID-19. Pre-payment for testing in the amount of US$150 must be made online prior to departure at the following URL: https://myfrontierhealthcare.com/Home/Ghana . Travelers must also submit a health declaration form online at the following URL: https://www.ghs-hdf.org/hdf/ ."
  },
  {
    "continent": "",
    "iso_alpha2": "GL",
    "name": "Greenland",
    "score": "Partially restricted",
    "updated": "From June 15, 2020, foreign nationals are prohibited from entering Greenland. This policy does not apply to citizens or lawful permanent residents from Denmark, the Faroe Islands, Germany, Iceland, and Norway. The total number of persons who may fly to Greenland each week is capped at 600. Persons arriving in Greenland must produce a certificate issued no more than 120 hours prior to departure showing a negative test result for COVID-19 and complete a personal locator form (Sumut form) detailing their travel itinerary. This form is available at: https://www.sumut2020.gl . Upon arrival, all persons must proceed directly to quarantine and undergo an additional test for COVID-19 after 5 days in isolation."
  },
  {
    "continent": "",
    "iso_alpha2": "GM",
    "name": "Gambia",
    "score": "Partially restricted",
    "updated": "From October 16, 2020, all persons must provide proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test."
  },
  {
    "continent": "",
    "iso_alpha2": "GN",
    "name": "Guinea",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Guinea. This policy does not apply to persons who hold long-stay family or professional visas, spouses of Guinean nationals, lawful residents, humanitarian personnel, diplomatic personnel, or technical experts. All persons arriving on Guinea must complete a health declaration form and present proof of a negative result for COVID-19 issued no more than 5 days prior to departure using a polymerase chain reaction (PCR) test. Upon arrival, all persons are subject to health screening. Persons exhibiting symptoms consistent with COVID-19 will be isolated and transferred to the Guinean Epidemiological Treatment Center (CT-Epi)."
  },
  {
    "continent": "",
    "iso_alpha2": "GQ",
    "name": "Equatorial Guinea",
    "score": "Partially restricted",
    "updated": "From June 15, air and sea travel will be resumed, and all passengers from abroad must have a negative PCR test result certificate no olders than 48 hours. All passengers have to undergo a mandatory quarantine for 14 days after entry at their own expense. Restaurants, shops, places of worship, and hotels will also be allowed to reopen, provided they follow hygiene standards."
  },
  {
    "continent": "",
    "iso_alpha2": "GR",
    "name": "Greece",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Greece. This policy does not apply to residents from countries or regions in the European Union, countries or regions associated with the Schengen Area, Australia, Canada, Georgia, Japan, Morocco, New Zealand, Rwanda, South Korea, Thailand, Tunisia, United Kingdom, and Uruguay. Persons arriving via air from Bulgaria and Romania must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test performed by a testing laboratory recognized by Greek authorities. All persons seeking to enter Greece must fill in a Passenger Locator Form (PLF) online at least 24 hours prior to departure via the following URL: https://travel.gov.gr/#/Additional exemptions to entry restrictions exist for persons who hold a valid Greek residence permit, border security personnel, diplomats, family members of EU citizens, healthcare workers or persons engaged in health research, humanitarian aid workers, military personnel, seasonal agricultural laborers, staff of international organizations, and persons employed in the transportation sector. Persons seeking to enter Greece for non-essential reasons via the Promachonas checkpoint on the land border with Bulgaria must present proof of a negative result for COVID-19 issued no more than 72 hours prior to arrival using a polymerase chain reaction (PCR) test. Land border checkpoints with Albania, North Macedonia, and Turkey are closed. This policy does not apply to persons with a compelling reason to enter Greece.From November 7, 2020, a nationwide lockdown in effect and includes a nightly curfew from 21:00 (9:00 p.m.) to 05:00 (5:00 a.m.)."
  },
  {
    "continent": "",
    "iso_alpha2": "GT",
    "name": "Guatemala",
    "score": "Partially restricted",
    "updated": "From September 18, 2020, all persons entering Guatemala must present proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test, or undergo a 14-day quarantine upon arrival. All persons must complete a health questionnaire found at the following URL: https://servicios.igm.gob.gt/pasedesalud/"
  },
  {
    "continent": "",
    "iso_alpha2": "GW",
    "name": "Guinea-bissau",
    "score": "Partially restricted",
    "updated": "From August 1, 2020, all persons entering Guinea-Bissau must present proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Persons who do not carry such proof or who are currently exhibiting symptoms consistent with COVID-19 must undergo a 14-day quarantine."
  },
  {
    "continent": "",
    "iso_alpha2": "GY",
    "name": "Guyana",
    "score": "Entry prohibited",
    "updated": "All international flights are suspended until further notice."
  },
  {
    "continent": "",
    "iso_alpha2": "HK",
    "name": "Hong Kong, China",
    "score": "Partially restricted",
    "updated": "<b style=white-space: pre-wrap; font-family: Roboto, RobotoDraft, Helvetica, Arial, sans-serif;>Quarantine-Free Entry from Guangdong Province and Macau SAR From November 23, 2020, Hong Kong SAR residents returning from Guangdong Province in Mainland China or from Macau SAR may be eligible for special quarantine-free entry under the so-called Return2hk Scheme. Residents must submit an online reservation and receive confirmation prior to departure. The daily limit on returnees is 3,000 via the Shenzhen Bay Port and 2,000 via the Hong Kong-Zhuhai-Macau Bridge, respectively. All reservations are allocated on a first-come, first-served basis and are non-transferable. Residents seeking to use the Return2hk Scheme must obtain proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test performed by a testing provider recognized by the HKSAR government. Upon arrival at the boundary control point, residents traveling under the Return2hk Scheme must present a valid Hong Kong SAR Identity Card, a Return2hk reservation confirmation, and proof of a negative RT-PCR test result. Additional information is available at the following URL: https://www.coronavirus.gov.hk/eng/return2hk-scheme.htmlAir Travel Bubble for Travelers from Singapore <span style=white-space: pre-wrap;>The Hong Kong SAR government has announced a special Air Travel Bubble arrangement for persons traveling from Singapore regardless of their nationality. A final launch date has not been finalized and is subject to change. This policy does not apply to persons holding a Work Permit or S Pass issued by the Singapore Ministry of Manpower who work in the construction, marine shipyard, or process sectors. Travelers seeking to use the Air Travel Bubble must book passage on designated flights and the initial daily passenger quota is capped at 200. Travelers cannot have traveled outside Singapore during the 14 days prior to their scheduled departure for Hong Kong SAR and must have proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test performed by a recognized testing provider in Singapore. Travelers seeking to use the Air Travel Bubble must apply to undergo a pre-departure PCR test. Travelers must also submit an online health declaration form and pre-book an additional, post-arrival PCR test. Travelers will receive QR codes confirming their health declaration and post-arrival test booking, which are necessary when boarding Air Travel Bubble flights. Upon arrival, travelers must wait at the airport for their PCR test result and confirmation of a negative result is required to enter Hong Kong SAR. Travelers must observe all relevant health regulations and adhere to social distancing measures while in Hong Kong SAR. Persons who hold a passport that requires a visa for travel to Hong Kong SAR must separately obtain a valid visa prior to departure. Approval to use the Air Travel Bubble is NOT a substitute for a visa. Additional information is available at the following URL: https://www.tourism.gov.hk/travel-bubble/en/singapore.html<b style=white-space: pre-wrap;><font face=Roboto, RobotoDraft, Helvetica, Arial, sans-serif><b style=white-space: pre-wrap;> All Others <span style=white-space: pre-wrap;>The Hong Kong SAR government has implemented the following policies in response to COVID-19:1) All non-residents arriving from overseas by air are prohibited from entering Hong Kong SAR;2) All non-residents arriving from Mainland China, Macau SAR, or Taiwan who have visited any other country or region within 14 days of arrival are prohibited from entering Hong Kong SAR;3) All persons (including Hong Kong SAR residents) arriving from Mainland China, Macau SAR, or Taiwan are required to undergo a 14-day quarantine at a designated facility (some exceptions apply);4) Travelers may transit Hong Kong International Airport (HKIA) for onward flights under the same ticket provided they (and any accompanying luggage) are checked through to their final destination. This includes flights originating in Mainland China bound for final destinations abroad;5) Transfer services at HKIA to final destinations in Mainland China remain suspended until further notice.All persons who visited Bangladesh, Belgium, Ecuador, Ethiopia, France, Germany, India, Indonesia, Kazakhstan, Nepal, Pakistan, the Philippines, Romania, Russia, South Africa, Turkey, United Kingdom, or the United States within 14 days of their scheduled departure for Hong Kong SAR must, upon arrival, present original documentation (in English or Chinese) issued no more than 72 hours prior to departure showing a negative result for COVID-19 using a nucleic acid test. Test results must contain the traveler's name and identity card or passport number. Travelers must also provide confirmation of a hotel booking in Hong Kong for a minimum of 14 days from the date of arrival.<font face=Roboto, RobotoDraft, Helvetica, Arial, sans-serif><b style=white-space: pre-wrap;> <font face=Roboto, RobotoDraft, Helvetica, Arial, sans-serif><b style=white-space: pre-wrap;>Post-Arrival Testing and Quarantine <span style=white-space: pre-wrap;>All persons arriving at Hong Kong International Airport who are not exhibiting symptoms will be taken to a designated location and tested for COVID-19. All persons are required to wait onsite for their test results. Those who test negative will be released to proceed directly to their homes or a designated quarantine facility where they must complete their mandatory 14-day quarantine.Mandatory quarantine requirements do not apply to cross-boundary travelers provided they fall into one of the following categories:1) Persons necessary for the supply of goods or services required for the normal operation of Hong Kong SAR or the daily needs of the people of Hong Kong SAR;2) Persons necessary for governmental operation;3) Persons necessary to protect the health or safety of the people of Hong Kong SAR or to handle the public health emergency;4) Persons receiving nursery, kindergarten, primary, or secondary education at any school registered under the Education Ordinance (Cap. 279) in Hong Kong SAR, persons providing such education, or persons necessary for the safe travelling of any persons arriving in Hong Kong SAR for the purposes outlined in this clause;5) Persons whose entry is deemed to serve the public interest of Hong Kong SAR; or6) Persons traveling for purposes relating to manufacturing operations, business activities, or the provision of professional services deemed to be in the interest of economic development in Hong Kong SAR.Mandatory quarantine requirements do not apply to persons arriving from foreign places provided they fall into one of the following categories:1) Persons necessary for the supply of goods or services required for the normal operation of Hong Kong SAR or the daily needs of the people of Hong Kong SAR;2) Persons necessary for governmental operation;3) Persons necessary to protect the health or safety of the people of Hong Kong SAR or to handle the public health emergency; or4) Persons whose entry is deemed to serve the public interest of Hong Kong SAR."
  },
  {
    "continent": "",
    "iso_alpha2": "HN",
    "name": "Honduras",
    "score": "Partially restricted",
    "updated": "From August 17, 2020, all persons traveling to Honduras must provide proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) or rapid reagent test. All persons must fill in an online immigration pre-check form and carry a printed copy for inspection by authorities upon arrival. The form can be found at the following URL: https://prechequeo.inm.gob.hn"
  },
  {
    "continent": "",
    "iso_alpha2": "HR",
    "name": "Croatia",
    "score": "Partially restricted",
    "updated": "All persons arriving in Croatia must either: 1) carry proof of a negative result for COVID-19 issued no more than 48 hours prior to departure using a polymerase chain reaction (PCR) test, or 2) self-isolate for 14 days. Persons who, after 7 days in self-isolation in Croatia, agree to undergo testing for COVID-19 at their own expense may shorten the length of time they are required to remain isolated. To facilitate travel to Croatia, the Croatian government asks all foreign nationals prior to departure to submit the online form found at the following URL: https://entercroatia.mup.hr/"
  },
  {
    "continent": "",
    "iso_alpha2": "HT",
    "name": "Haiti",
    "score": "Normal",
    "updated": "From July 1, 2020, all persons arriving Haiti must fill out and submit a health declaration pertaining to their COVID-19 status. All persons must retain a copy of this form for 14 days following arrival in order to facilitate contact tracing as necessary."
  },
  {
    "continent": "",
    "iso_alpha2": "HU",
    "name": "Hungary",
    "score": "Entry prohibited",
    "updated": "Foreign nationals are prohibited from entering Hungary. This policy provides for exemptions on a case-by-case basis for persons with specific needs to travel to Hungary. From November 11, 2020, strict new restrictions are in place nationwide, including a nightly curfew from 20:00 (8:00 p.m.) to 05:00 (5:00 a.m.)."
  },
  {
    "continent": "",
    "iso_alpha2": "ID",
    "name": "Indonesia",
    "score": "Partially restricted",
    "updated": "Travel Corridor Arrangement for Singaporean Nationals From October 29, 2020, Singaporean nationals and lawful residents may be eligible to travel to Indonesia for business or official travel of up to 30 days using a so-called Travel Corridor Arrangement (TCA) scheme. Persons seeking to use the TCA must be sponsored by either an Indonesia-based company or an Indonesian government agency, which will file an application on their behalf for a specific e-visa. Once approved, e-visa holders must then submit their travel history and a detailed itinerary online via the “Electronic Health Card” (e-HAC) system, and must hold a valid return ticket.Persons seeking to use the TCA must, at their own expense, obtain a certificate showing a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test performed by an approved medical services provider in Singapore. TCA travelers are limited to arrival via Soekarno-Hatta International Airport (CGK) or the Batam Center Ferry Terminal.Upon arrival, TCA travelers will undergo an additional PCR test at their own expense and will be transported by the host company or government agency to a non-residential accommodation where they must self-isolate while awaiting their test results. Upon confirmation of a negative test result, the host company or government agency will ensure the traveler is transported to and from their workplace for the duration of the traveler's stay in Indonesia and refrains from using public transportation. The host company or government agency will further ensure the traveler properly registers with the e-HAC system and observes all local pandemic control measures.All Others Foreign nationals are prohibited from entering Indonesia. This policy does not apply to persons who fall into one of the following categories:1) Children of dual citizenship registered in the Indonesian immigration system as Indonesian citizens;2) Holders of a Temporary Stay Permit or a Permanent Stay Permit (Permanent Residents/KITAS and KITAP) with a valid Multiple Re-Entry Permit (MERP);3) Holders of an Indonesian diplomatic visa or an official / service visa, or those who hold Indonesian diplomatic stay or official / service stay permits;4) Those engaged in medical services or the delivery of supplies or humanitarian assistance;5) Crew members working on air, land, or sea transportation;6) Those traveling for essential work on national strategic projects.Persons arriving from abroad are required to carry a health certificate showing a negative result for COVID-19 using a polymerase chain reaction (PCR) test. The certificate must be issued by a recognized health authority no more than 7 days prior to departure for Indonesia. Failure to produce a valid certificate may result in denial of entry. Upon arrival, all persons are subject to additional testing for COVID-19 and will be directed to either self-isolate for 14 days or undergo quarantine at a designated facility."
  },
  {
    "continent": "",
    "iso_alpha2": "IE",
    "name": "Ireland",
    "score": "Partially restricted",
    "updated": "All persons (including Irish nationals) must submit, prior to arrival, a COVID-19 Passenger Locator Form and must, upon arrival, self-isolate for 14 days. This policy does not apply to diplomats, essential supply chain workers, or persons arriving from a very limited set of locations. Failure to submit the locator form is considered an offense. Locator forms and information on exempted locations is available at the following URL: https://www.gov.ie/en/publication/e885b2-covid-19-coronavirus-travel-advice/"
  },
  {
    "continent": "",
    "iso_alpha2": "IL",
    "name": "Israel",
    "score": "Entry prohibited",
    "updated": "Foreign nationals are prohibited from entering Israel. This policy does not apply to lawful residents. Additional exemptions exist to permit travel for special circumstances and will be assessed on a case-by-case basis by Israeli authorities. More information is available at the following URL: https://www.gov.il/en/departments/news/border_closing_coronavirus_14062020"
  },
  {
    "continent": "",
    "iso_alpha2": "IN",
    "name": "India",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering India for tourism. This policy does not apply to Bhutanese and Nepalese nationals. Foreign nationals holding any category of visa other than a tourist visa may travel to India. This includes dependents who hold an appropriate dependent visa. All previously suspended visas are now restored. This policy does not apply to electronic visas (e-Visa), tourist visas, and medical visas, which remain suspended. Foreign nationals whose visas in restored categories have expired may apply for a new visa at an Indian embassy or consulate abroad. Persons seeking to travel to India for family emergencies should apply for authorization at an Indian embassy or consulate abroad, which will evaluate applications on a case-by-case basis. All persons granted entry to India must strictly adhere to all guidelines issued by the Ministry of Health and Family Welfare concerning COVID-19 and other health-related matters. Current guidelines, including information on pre-departure reporting, on-arrival testing, and quarantine, are available at the following URI: https://www.mohfw.gov.in/pdf/05112020Guidelinesforinternationalarrivals.pdfBe advised, some state-level authorities in India have implemented additional policies and restrictions for persons arriving into their jurisdictions."
  },
  {
    "continent": "",
    "iso_alpha2": "IQ",
    "name": "Iraq",
    "score": "Entry prohibited",
    "updated": "Foreign nationals are prohibited from entering Iraq until further notice."
  },
  {
    "continent": "",
    "iso_alpha2": "IR",
    "name": "Iran",
    "score": "Partially restricted",
    "updated": "From August 5, 2020, all persons over the age of 2 arriving in Iran must carry proof of a negative result for COVID-19 issued no more than 96 hours prior to departure using a polymerase chain reaction (PCR) test. Travelers must fill in a health declaration form prior to arrival and undergo additional screening for COVID-19 once in Iran. Protective face masks are mandatory on all flights to Iran and in Iranian airports. The Iranian government has suspended the issuing of all tourist visas."
  },
  {
    "continent": "",
    "iso_alpha2": "IS",
    "name": "Iceland",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Iceland. This policy does not apply to citizens and legal residents from countries or regions in the European Union, countries or regions associated with the Schengen Area, Andorra, Australia, Canada, Georgia, Japan, Monaco, Morocco, New Zealand, Rwanda, San Marino, South Korea, Tunisia, Thailand, Uruguay, and Vatican City. Additional exemptions exist for persons traveling to Iceland for study or specialists traveling for work-related purposes. Upon arrival, all persons must undergo testing for COVID-19 or quarantine at their own expense. This policy does not apply to persons arriving from Denmark, Finland, Germany, Norway, or countries / regions not designated by the Islandic government as high-risk for COVID-19. Additional exemptions exist for persons born in 2005 or later."
  },
  {
    "continent": "",
    "iso_alpha2": "IT",
    "name": "Italy",
    "score": "Partially restricted",
    "updated": " From March 28, 2020, foreign nationals are prohibited from entering Italy. This policy provides exemptions for health reasons, work requirements, and reasons of absolute necessity. Transit through Italy from one foreign country to another is allowed only for work requirements, medical needs, or reasons of absolute necessity.\n\nAll persons entering Italy (including Italian nationals) are required to self-isolate for 14 days. Prior to boarding transportation bound for Italy, the carrier staff will collect the following information from all travelers: the reason for travel to Italy, an address where the traveler will self-isolate for 14 days, the private means of transportation to be used to reach the self-isolation location, and a contact phone number.\n\nThese policies do not apply to cross-border workers, health services personnel, and passenger or freight transport crews.\n style=font-size: 14.6667px;>Foreign nationals are prohibited from entering Italy. This policy does not apply to persons arriving from countries or regions in the European Union, countries or regions associated with the Schengen Area, Andorra, Australia, Canada, Georgia, Japan, Monaco, New Zealand, Rwanda, San Marino, South Korea, Thailand, Tunisia, United Kingdom, Uruguay, or Vatican City. Persons traveling from or having transited through Belgium, Czech Republic, France, Netherlands, Spain, or the United Kingdom must either: 1) present proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a molecular or antigenic test, or 2) undergo testing for COVID-19 within 48 hours of arrival in Italy and self-isolate while awaiting the results. Further exemptions to Italian entry restrictions exist for persons traveling to Italy for work, health reasons, reasons of absolute necessity, to return home, or for study. All persons (unless traveling from San Marino or Vatican City) are required to fill out and present for inspection upon request a Self-Declaration Form Justifying Travel in Italy of Persons Arriving from Abroad. An example template is available from the following URL: https://www.esteri.it/mae/resource/doc/2020/10/modulo_rientro_sintetico_14_10_20_en.pdf Foreign nationals who, within 14 days of their scheduled departure for Italy, have visited any of the following countries or regions are prohibited from entering Italy: Armenia, Bahrain, Bangladesh, Bosnia and Herzegovina, Brazil, Chile, Colombia, Dominican Republic, Kosovo, Kuwait, Moldova, Montenegro, North Macedonia, Oman, Panama, and Peru. This policy does not apply to citizens (or their close family members) from countries or regions in the European Union, countries or regions associated with the Schengen Area, Andorra, Monaco, San Marino, United Kingdom, or Vatican City provided such persons would normally reside in Italy prior to July 9, 2020.All persons are required to self-isolate for 14-days upon arrival in Italy. This policy does not apply to persons arriving from countries or regions in the European Union (with the exception of Romania), countries or regions associated with the Schengen Area, Andorra, Monaco, San Marino, United Kingdom, or Vatican City, provided such persons have not traveled to a third-country or region outside this grouping within 14 days of their departure for Italy. Further exemptions exist for transportation crew members, healthcare personnel entering Italy for work, persons who commute cross-border to and from work, officials and agents of the European Union, international organizations, or staff of diplomatic missions and consulates, persons intending to remain in Italy for less than 120 hours for work, medical reasons, or reasons of absolute necessity, persons transiting through Italian airports, or persons transiting en route to their home country who will remain in Italy for no more than 36 hours.Be advised, some regional-level authorities in Italy have implemented additional policies and restrictions for persons arriving into their jurisdictions."
  },
  {
    "continent": "",
    "iso_alpha2": "JM",
    "name": "Jamaica",
    "score": "Partially restricted",
    "updated": "From June 15, 2020, all persons (including Jamaican nationals) must present a Travel Authorization document prior to boarding flights bound for Jamaica. These documents are available at the following URL: https://www.visitjamaica.com/travelauthorization/ . All persons 12 years of age or older traveling for non-business reasons from Arizona, Florida, New York, and Texas in the United States must upload proof of a negative result for COVID-19 issued no more than 10 days prior to departure by a medical laboratory accredited by the US College of American Pathologists (CAP). A negative result is required to obtain travel authorization for Jamaica. More information is available at the following URL: https://www.visitjamaica.com/"
  },
  {
    "continent": "",
    "iso_alpha2": "JO",
    "name": "Jordan",
    "score": "Partially restricted",
    "updated": "From September 8, 2020, persons arriving from countries or regions deemed green by Jordanian authorities must have proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Travelers must have spent the 14 days prior to departure within the green country or region and must, at their own expense, undergo an additional PCR test for COVID-19 upon arrival in Jordan. Persons arriving from yellow countries or regions must have proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a PCR test. Such persons must, at their own expense, undergo an additional PCR test for COVID-19 and must self-isolate for 7 days upon arrival. A third PCR test will be administered near the end of the self-isolation period. Persons arriving from red countries or regions will undergo the same procedures as apply to yellow locations; however, they must also wear an electronic monitoring bracelet during their self-isolation period. A nationwide curfew is in effect until further notice.Persons seeking to travel from restricted locations must register with Jordanian authorities and obtain approval prior to booking flights to Jordan. All other persons much submit a travel declaration online prior to departure. Travel declaration forms are available at the following URL: https://www.visitjordan.gov.jo/form/"
  },
  {
    "continent": "",
    "iso_alpha2": "JP",
    "name": "Japan",
    "score": "Partially restricted",
    "updated": "Entry Restrictions As of November 1, 2020, foreign nationals who fall into either of the following categories are prohibited from entering Japan:(1) Foreign nationals who have visited (or transited through) any of the following locations within 14 days of their arrival in Japan:Africa : Algeria, Botswana, Cameroon, Cape Verde, Central African Republic, Comoros, Cote d’Ivoire, Democratic Republic of Congo, Djibouti, Egypt, Equatorial Guinea, Eswatini, Ethiopia, Gabon, Gambia, Ghana, Guinea, Guinea-Bissau, Kenya, Lesotho, Liberia, Libya, Madagascar, Malawi, Mauritania, Mauritius, Morocco, Namibia, Nigeria, Republic of the Congo, Rwanda, Senegal, Sao Tome and Principe, Sierra Leone, Somalia, South Africa, South Sudan, Sudan, Tunisia, Zambia, ZimbabweAsia : Afghanistan, Azerbaijan, Bangladesh, Bhutan, India, Indonesia, Kazakhstan, Kyrgyzstan, Malaysia, Maldives, Myanmar, Nepal, Pakistan, Philippines, Tajikistan, UzbekistanEurope : Albania, Andorra, Armenia, Austria, Belarus, Belgium, Bosnia and Herzegovina, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Georgia, Hungary, Iceland, Ireland, Italy, Kosovo, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Moldova, Monaco, Montenegro, Netherlands, North Macedonia, Norway, Poland, Portugal, Romania, Russia, San Marino, Serbia, Slovakia, Slovenia, Spain, Sweden, Switzerland, Ukraine, United Kingdom, Vatican CityMiddle East : Bahrain, Israel, Iran, Iraq, Jordan, Kuwait, Lebanon, Oman, Palestine, Qatar, Saudi Arabia, Turkey, United Arab EmiratesNorth America : Antigua and Barbuda, Bahamas, Barbados, Belize, Canada, Costa Rica, Cuba, Dominica, Dominican Republic, El Salvador, Grenada, Guatemala, Haiti, Honduras, Jamaica, Mexico, Nicaragua, Panama, Saint Kitts and Nevis, Saint Vincent and the Grenadines, Trinidad and Tobago, United StatesSouth America : Argentina, Bolivia, Brazil, Chile, Colombia, Ecuador, Guyana, Paraguay, Peru, Suriname, Uruguay, Venezuela(2) Persons holding Chinese passports issued in Hubei Province or Zhejiang Province.Quarantine Requirements (1) All persons (including Japanese nationals) who have visited any of the above-listed locations within 14 days of their arrival in Japan must undergo a polymerase chain reaction (PCR) test for COVID-19;(2) All persons (including Japanese nationals) must undergo a 14-day quarantine at their residence or a designated facility. This policy does not apply to Japanese nationals returning from business trips abroad and foreign nationals holding valid Japanese residence permits provided: 1) they spent no more than 7 days in their destination abroad, and 2) their PCR test result is negative. Further exemptions exist for persons traveling from a location not listed above. Regardless of origin, all persons (including Japanese nationals) must refrain from using public transportation for 14 days following arrival in Japan.Phased Resumption of Cross-Border Travel Japanese nationals and nationals from select countries / regions intending to remain in Japan long-term as business personnel on rotation to local affiliates may apply to enter Japan under the Residence Track program. Persons traveling under this program are required to observe all testing and isolation requirements upon arrival in Japan. Currently, the Residence Track is available to travelers from the following countries / regions: Brunei Darussalam, Cambodia, Laos, Mainland China, Malaysia, Myanmar, Singapore, South Korea, Thailand, Taiwan, and Vietnam. More information is available at the following URL: https://www.mofa.go.jp/ca/cp/page22e_000925.htmlBusiness Track for Residents from Mainland China, Singapore, South Korea, and Vietnam Residents of Mainland China, Singapore, South Korea, and Vietnam are eligible to apply for special permission to travel to Japan for up to 30 days for limited business activities. All persons seeking to travel under the business track program must apply for a visa and/or a Re-entry Confirmation Letter from a local Japanese embassy or consulate. Potential business track travelers must submit a Schedule of Activities in Japan and a Written Pledge, in which the hosting company/entity in Japan agrees to properly implement all COVID-19 quarantine measures. The activity schedule should provide a detailed itinerary including all accommodations and destinations to be visited by the traveler during their initial 14 days in Japan. Persons approved to use the business track will receive an official cover letter from the Japanese embassy or consulate. Travelers must present the official cover letter at an authorized medical institution and undergo a real time reverse transcription polymerase chain reaction (RT-PCR) test for COVID-19 within 72 hours of their planned departure. All persons not registered with the Japanese public insurance system should carry private medical insurance valid for use in Japan with coverage sufficient for all medical expenses that may arise during their stay. Upon arrival in Japan, travelers using the business track must undergo additional testing for COVID-19, submit a health questionnaire, their Written Pledge, their Schedule of Activities in Japan, and their pre-departure COVID-19 test results for inspection. All persons must install a COVID-19 contact tracing application, the LINE communications application, and a map application onto their mobile phones. During the initial 14 days following arrival, business track travelers are limited to the activities listed on their Schedule of Activities in Japan.” They must refrain from using public transportation and must report their health condition each day to a designated person at the company or entity hosting them. Additional information and links to sample forms are available at the following URL: https://www.mofa.go.jp/ca/cp/page22e_000925.html Visa Restrictions The Japanese government has suspended the validity of single- and multiple-entry visas issued by Japanese embassies or consulates in numerous countries and regions prior to specific dates. Visa exemption agreements with numerous countries is suspended. Visa exemptions for holders of APEC Business Travel Cards issued by several countries is suspended. A complete list of visa suspensions is available from the Ministry of Foreign Affairs of Japan website at the following URL: https://www.mofa.go.jp/ca/fna/page4e_001053.html"
  },
  {
    "continent": "",
    "iso_alpha2": "KE",
    "name": "Kenya",
    "score": "Partially restricted",
    "updated": "From August 1, 2020, persons arriving in Kenya must present proof of a negative test result for COVID-19 issued no more than 72 hours prior to departure. Those exhibiting symptoms consistent with COVID-19 are subject to quarantine."
  },
  {
    "continent": "",
    "iso_alpha2": "KG",
    "name": "Kyrgyzstan",
    "score": "Entry prohibited",
    "updated": "From March 19, Kyrgyzstan will ban entry of citizens of foreign states and stateless persons into Kyrgyzstan. The exception is drivers engaged in international freight transport, crews and flight personnel of aircraft, train and locomotive teams of international railway traffic. The ban also does not apply to accredited employees of diplomatic missions and consular offices of foreign states, as well as accredited employees of international organizations and family members of these persons in case of informing in advance about their arrival through the Ministry of Foreign Affairs.Foreign citizens and stateless persons, who are members of the families of Kyrgyzstanis with documentary evidence of close family ties, or have a permanent residence permit in the Kyrgyz Republic, will be able to enter.The Ministry of Foreign Affairs will suspend issuance of entry visas of all categories to foreign citizens and stateless persons for the period of the ban. The entry ban for foreigners will remain in effect until the government decree is canceled."
  },
  {
    "continent": "",
    "iso_alpha2": "KH",
    "name": "Cambodia",
    "score": "Partially restricted",
    "updated": "The Cambodian government has suspended the issuing of tourist visas, e-visas, visa on arrival, and all visa-free arrangements until further notice. Foreign nationals seeking to enter Cambodia using another visa category (A,B,C, or E) must obtain a visa from a Cambodian embassy or consulate abroad before departing for Cambodia. Upon arrival, foreign nationals must present a valid medical certificate issued no more than 72 hours prior to departure attesting they have not tested positive for COVID-19. Additionally, they must provide proof of medical insurance valid for their intended duration of stay in Cambodia. The amount of coverage must be at least US$50,000. All persons arriving in Cambodia will be tested for COVID-19 and be required to wait on-site for their results. Upon confirmation of negative test results from all persons on the same flight, individuals will be permitted to proceed to their place of residence or accommodation where they must self-isolate for 14 days. Should any person on the same flight test positive for COVID-19, the entire flight must undergo quarantine at a designated facility. A deposit in the amount of US$3,000 must be paid upon arrival and will be used to cover expenses related to testing, quarantine, and any other health-related services. A full list of applicable services and fees is available from the Cambodian Ministry of Foreign Affairs. This policy does not apply to persons holding a diplomatic (category A) or official (category B) visa."
  },
  {
    "continent": "",
    "iso_alpha2": "KM",
    "name": "Comoros",
    "score": "Partially restricted",
    "updated": "From September 7, 2020, all persons arriving in Comoros must have proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test."
  },
  {
    "continent": "",
    "iso_alpha2": "KN",
    "name": "Saint Kitts and Nevis",
    "score": "Entry prohibited",
    "updated": "All air and sea border checkpoints are closed to commercial traffic until further notice."
  },
  {
    "continent": "",
    "iso_alpha2": "KP",
    "name": "Democratic People's Republic of Korea",
    "score": "Entry prohibited",
    "updated": "All passenger air and rail connections with China are suspended. Arriving foreign nationals must undergo quarantine for up to 1 month."
  },
  {
    "continent": "",
    "iso_alpha2": "KR",
    "name": "South Korea",
    "score": "Partially restricted",
    "updated": "Fast Lane Immigration Clearance for Residents of Singapore From September 2, 2020, lawful residents and Long-Term Pass holders from Singapore who seek to travel to South Korea for essential business or official purposes may apply for fast fane immigration clearance. To use the fast lane, travelers must be sponsored by either a company or a government agency in South Korea, which will file an application on the traveler's behalf for an Isolation Exemption Certificate. If approved, the traveler will receive official notification, which they must submit to the South Korean embassy in Singapore along with a copy of their passport, a flight itinerary, and a completed Isolation Exemption Certificate at least 5 and no more than 10 days prior to intended departure. The South Korean embassy will issue the traveler with the necessary supporting documentation to facilitate travel to South Korea, including documentation to obtain a pre-departure polymerase chain reaction (PCR) test for COVID-19 at a designated testing facility in Singapore.Upon arrival in South Korea, travelers using the fast lane must present their negative PCR test result for COVID-19, two official copies of their Isolation Exemption Certificate issued by the South Korean embassy in Singapore, and a valid visa (if required). Following immigration clearance, fast lane travelers must undergo an additional PCR test at Incheon International Airport (IIA) and quarantine while awaiting their results. Persons who test positive are required, at the own expense, to undergo medical treatment for COVID-19. All persons are required to install the South Korean government's Self Health Check Mobile App and comply with all monitoring and epidemic control measures in accordance with relevant South Korean health regulations. Finally, fast lane travelers must adhere to a controlled itinerary that is supervised by the sponsoring company or government agency for the first 14 days they are in South Korea.Required Testing for Persons Arriving from High-Risk Locations From August 12, 2020, foreign nationals arriving from countries or regions deemed by the South Korean government to be at high-risk for COVID-19 must carry proof of a negative result for COVID-19 using a polymerase chain reaction (PCR) test performed no more than 48 hours prior to departure by a hospital or medical services provider approved by the local Korean embassy or consulate. Currently, this list includes the following countries / regions: Bangladesh, India, Kazakhstan, Kyrgyzstan, Pakistan, Philippines, Russia, Uzbekistan.Re-Entry Permit Required for Alien Registration Card Holders From June 1, 2020, persons holding an Alien Registration Card (ARC) must obtain a Re-Entry Permit prior to departure from South Korea if they intend to return. Failure to do so will result in cancellation of the Alien Registration. This policy does not apply to diplomats, government officials, or persons who hold Overseas Korean (F-4) status. To return to South Korea, persons holding a valid ARC must undergo testing for COVID-19 within 48 hours prior to departure and must present a medical certificate (written in English or Korean) showing their test results upon arrival in South Korea.Fast-Track Immigration Clearance for Chinese Nationals From May 1, 2020, Chinese nationals traveling to South Korea for business purposes may qualify for special fast-track immigration clearance provided they hold proof of a negative test for COVID-19 performed no more than 72 hours prior to departure. They must again test negative for COVID-19 upon arrival in Korea before being exempted from the mandatory quarantine procedures described below. Persons using fast-track immigration clearance are subject to standard government surveillance measures in place to combat COVID-19.Special Entry Procedures So-called special entry procedures are in place for all persons arriving in South Korea regardless of origin. All persons must proceed through immigration at their first port of entry in South Korea and may not connect to onward domestic flights. This policy does not apply to residents of Jeju Island or to special Transit Exclusive Domestic Flights connecting from Incheon International Airport (IIA) to Gimhae International Airport (PUS) in Busan. Individuals are allowed entry only after they provide verifiable contact information and an address within South Korea valid for the duration of their stay. All persons are required to install either the Self-quarantine Safety Protection App or the Mobile Self-diagnosis App on their phones and follow the instructions for documenting their health condition on a daily basis for 14 days. All persons arriving from the United States (including Korean nationals) must self-isolate and must get diagnostic tests within three days of commencing their quarantine period.Symptomatic PassengersAll persons (including Korean nationals) will go through diagnostic tests if they have fever or respiratory symptoms identified during the quarantine stage. Persons who test positive for COVID-19 will be transferred to a hospital or Living and Treatment Center (Community Treatment Center). Korean nationals or long-term foreign nationals who test negative will be placed under self-quarantine. Foreign nationals who are short-term will be placed under quarantine at designated facilities.Asymptomatic PassengersAsymptomatic Korean nationals arriving from Europe and the United States will go into self-quarantine and get diagnostic tests at a health center within three days of arrival. Asymptomatic Korean nationals arriving from countries outside the European countries and the United States will go into self-quarantine and get diagnostic tests if they display any symptoms. Asymptomatic long-term foreign nationals arriving from the United States will be placed under self-quarantine and must get diagnostic tests within three days at a public health clinic. Asymptomatic foreign nationals for long-term and short-term stay arriving from Europe will get diagnostic tests at the airport. Afterwards, long-term foreign nationals will go into self-quarantine while short-term foreign nationals will be quarantined at designated facilities. Asymptomatic long-term stay foreign nationals arriving from countries other than European countries and the United States will go into self-quarantine and get diagnostic tests if they display any symptoms. Asymptomatic short-term foreign nationals arriving from countries outside the European continent will be placed under quarantine at designated facilities and get diagnostic tests if they display any symptoms."
  },
  {
    "continent": "",
    "iso_alpha2": "KW",
    "name": "Kuwait",
    "score": "Partially restricted",
    "updated": "From September 17, 2020, from nationals from the following countries / regions are prohibited from entering Kuwait: Afghanistan, Argentina, Armenia, Bangladesh, Bosnia and Herzegovina, Brazil, Chile, Colombia, Dominican Republic, Egypt, France, Hong Kong SAR, India, Indonesia, Iran, Iraq, Italy, Kosovo, Lebanon, Mainland China, Mexico, Moldova, Montenegro, Nepal, North Macedonia, Pakistan, Panama, Peru, Philippines, Serbia, Spain, Sri Lanka, Syria, and Yemen. All persons arriving at Kuwait International Airport (KWI) must carry a certificate in English showing a negative result for COVID-19 issued no more than 96 hours before departure using a polymerase chain reaction (PCR) test and undergo a 14-day home quarantine. All persons are asked to fill in the Passenger Health Consent form found at the following URL: https://kuwaitmosafer.com"
  },
  {
    "continent": "",
    "iso_alpha2": "KZ",
    "name": "Kazakhstan",
    "score": "Entry prohibited",
    "updated": "Foreign nationals are prohibited from entering Kazakhstan until further notice. This policy does not apply to diplomats and members of international organizations. From April 1, 2020, all persons entering Kazakhstan from abroad will undergo laboratory tests for COVID-19. Those who test positive will be transferred to an infectious disease hospital for treatment. Those who test negative must self-isolate at home for 14 days. From April 4, 2020, Kazakhstan's borders with China, Kyrgyzstan, Russia, and Uzbekistan are closed.From April 1 to July 1, 2020, the Kazakh government has suspended its 72-hour visa-free transit policy. Nur-Sultan and Almaty International Airports have suspended international flights until further notice."
  },
  {
    "continent": "",
    "iso_alpha2": "LA",
    "name": "Laos",
    "score": "Entry prohibited",
    "updated": "From April 1, 2020, all border checkpoints are closed and all international flights are suspended. The Laotian government has suspended the issuing of new visas and visa-on-arrival services. This policy does not apply to persons deemed by the government to be experts, technicians, or foreign workers crucial for major projects. Such persons must apply for entry permission from a Laotian embassy or consulate abroad before departing for Laos. All persons (including Lao nationals) traveling to Laos from abroad are required to carry a certificate showing a negative result for COVID-19 using a polymerase chain reaction (PCR) test. The certificate must be issued by a trustworthy medical institution no more than 72 hours prior to departure for Laos."
  },
  {
    "continent": "",
    "iso_alpha2": "LB",
    "name": "Lebanon",
    "score": "Partially restricted",
    "updated": "All persons traveling from Iraq, Syria, Turkey, or any country / region in Africa should check with a local Lebanese embassy or consulate prior to departure concerning current travel policies with respect to these locations. All persons traveling to Lebanon are required to fill in an online health declaration form, have proof of a negative result for COVID-19 issued no more than 96 hours prior to departure using a polymerase chain reaction (PCR) test, and have medical insurance valid for use in Lebanon and capable of covering all costs associated with the treatment of COVID-19 during the duration of stay. Upon arrival, all travelers must either: 1) undergo an additional test for COVID-19 within 72 hours of entry, or 2) undergo a 10-day quarantine. A nightly curfew is in effect nationwide between 18:00 (6:00 p.m.) and 06:00 (6:00 a.m.). Health declaration forms are available at the following URL: https://www.arcg.is/0GaDnG"
  },
  {
    "continent": "",
    "iso_alpha2": "LC",
    "name": "Saint Lucia",
    "score": "Partially restricted",
    "updated": "From July 9, 2020, all persons arriving in Saint Lucia must complete a Pre-Arrival Travel Registration Form and provide proof of a negative result for COVID-19 issued no more than 7 days prior to departure using a polymerase chain reaction (PCR) test. This policy does not apply to persons arriving from within the Caribbean travel bubble. While in Saint Lucia, all persons must adhere to strict physical distancing guidelines. More information is available at the following URL: https://www.stlucia.org/fr/covid-19/"
  },
  {
    "continent": "",
    "iso_alpha2": "LI",
    "name": "Liechtenstein",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Liechtenstein. This policy does not apply to persons arriving from countries or regions in the European Union, countries or regions associated with the Schengen Area, Algeria, Andorra, Australia, Canada, Georgia, Japan, Morocco, Monaco, New Zealand, Rwanda, Romania, San Marino, South Korea Thailand, Tunisia, Uruguay, or Vatican City. Persons arriving from countries or regions deemed by Switzerland's Federal Office of Public Health to be at increased risk for COVID-19 infection must undergo a 10-day quarantine upon arrival."
  },
  {
    "continent": "",
    "iso_alpha2": "LK",
    "name": "Sri Lanka",
    "score": "Entry prohibited",
    "updated": "Foreign nationals are prohibited from entering Sri Lanka. Beginning August 1, 2020, international flights are scheduled to resume arriving at Colombo International Airport (CMB), Ratmalana International Airport (RML), and Mattala Rajapaksa International Airport (HRI). All foreign nationals will require a valid visa, which they may apply for online. Visas will carry an initial validity of 30 days and have the option for a 6-month extenshion to be granted following arrival. Online visa applications may be found at: www.eta.gov.lk/slvisa/ . In order to board flights bound for Sri Lanka, all persons must prove they have tested negative for COVID-19 no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. All passenger cruise ships are prohibited from docking at Sir Lankan ports."
  },
  {
    "continent": "",
    "iso_alpha2": "LR",
    "name": "Liberia",
    "score": "Partially restricted",
    "updated": "From August 1, 2020, all persons arriving in Liberia must carry proof of a negative test result for COVID-19 and must undergo additional testing upon arrival."
  },
  {
    "continent": "",
    "iso_alpha2": "LS",
    "name": "Lesotho",
    "score": "Entry prohibited",
    "updated": "Until Further notice, all borders are closed, all persons are not allowed to enter Lesotho, except for emergency. Every person shall be confined to his place of residence."
  },
  {
    "continent": "",
    "iso_alpha2": "LT",
    "name": "Lithuania",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Lithuania. This policy does not apply to citizens and legal residents from countries or regions in the European Union, countries or regions associated with the Schengen Area, or the United Kingdom. Prior to boarding transportation bound for Lithuania, all persons must submit an online form to the National Public Health Center containing their personal information for contact tracing purposes. A confirmation QR code must be presented at the time of boarding. Forms are available online at the following URL: https://keleiviams.nvsc.lt/en/formPersons arriving from locations where the rate of COVID-19 infections exceeds 25 cases per 100,000 inhabitants during the 14 days prior to arrival in Lithuania according to the Lithuanian State Commander of National Emergency Operations must provide proof of a negative COVID-19 test result issued no more than 72 hours prior to departure and self-isolate for 14 days upon arrival. A current list of locations subject to this requirement is available from Lithuanian authorities at the following URL: https://koronastop.lrv.lt/en/Be advised, some municipalities have implemented additional policies (including quarantine requirements) for persons arriving into their jurisdictions. It is recommended travelers void unnecessary domestic travel while in Lithuania."
  },
  {
    "continent": "",
    "iso_alpha2": "LU",
    "name": "Luxembourg",
    "score": "Partially restricted",
    "updated": "From July 30, 2020, foreign nationals are prohibited from entering Luxembourg. This policy does not apply to persons arriving from countries or regions in the European Union, countries or regions associated with the Schengen Area, Australia, Canada, Georgia, Japan, Morocco, New Zealand, Rwanda, South Korea, Thailand, Tunisia, or Uruguay."
  },
  {
    "continent": "",
    "iso_alpha2": "LV",
    "name": "Latvia",
    "score": "Partially restricted",
    "updated": "All persons (including Latvian nationals) arriving from, or having transited through, countries or regions where the 14-day cumulative number of COVID-19 infections exceeds 16 individuals per 100,000 must self-isolate for 14 days. All persons must fill in a questionnaire no more than 48 hours before entering Latvia detailing their travel history during the 14 days prior to their arrival as well as local contact information including the address of the accommodation where they intend to complete their self-isolation requirement. This information will be used by the Latvian National Police and Centre for Disease Prevention and Control to facility contact tracing and the notification of people potentially exposed to COVID-19. Form are available online at the following URL: https://covidpass.lv/en/From November 6, 2020, until at least December 6, 2020, strict social restrictions have been reintroduced to curb the spread of COVID-19. Additional information is available at the following URL: https://www.mk.gov.lv/en/aktualitates/state-emergency-be-declared-latvia-9-november"
  },
  {
    "continent": "",
    "iso_alpha2": "LY",
    "name": "Libya",
    "score": "Entry prohibited",
    "updated": "From March 16, 2020, all air, land, and sea border checkpoints are closed. A state of emergency is in effect."
  },
  {
    "continent": "",
    "iso_alpha2": "MA",
    "name": "Morocco",
    "score": "Entry prohibited",
    "updated": "All air, land, and sea border checkpoints are closed. A state of emergency is in effect nationwide until at least November 10, 2020. This policy does not apply to shipments of cargo."
  },
  {
    "continent": "",
    "iso_alpha2": "MD",
    "name": "Moldova",
    "score": "Partially restricted",
    "updated": "From September 1, 2020, persons in countries or regions deemed by the Moldovan Ministry of Health, Labor and Social Protection as being at high-risk for the transmission of COVID-19 are prohibited from entering Moldovia. Persons traveling from countries or regions deemed low-risk must undergo temperature screening upon arrival. Any person who has visited or transited through a high-risk location must complete a health questionnaire and sign a declaration stating they intend to comply with a mandatory 14-day self-isolation requirement. An official list of high-risk locations is available from Moldovan authorities at the following URL: https://msmps.gov.md/wp-content/uploads/2020/09/Lista-Tarilor_Zona-Rosie_11.09.2020-744x1024.jpg"
  },
  {
    "continent": "",
    "iso_alpha2": "ME",
    "name": "Montenegro",
    "score": "Partially restricted",
    "updated": "From July 2, 2020, foreign nationals are prohibited from entering Montenegro. This policy does not apply to persons who meet all of the following criteria: 1) Residents of a country or region designated by Montenegrin authorities as green (see below); 2) Persons who can prove that within 15 days of departing for Montenegro they have remained exclusively within green countries or regions;3) Persons who have traveled exclusively within green countries or regions (with the exception of brief transit stops as indicated on verifiable travel documents).The current list of green countries / regions includes: Algeria, Andorra, Australia, Austria, Bahamas, Barbados, Belgium, Brunei, Bulgaria, Cambodia, China, Costa Rica, Croatia, Cuba, Cyprus, Czechia, Denmark, Estonia, Fiji, Finland, France, Georgia, Germany, Greece, Hungary, Iceland, Iceland, Ireland, Italy, Jamaica, Japan, Jordan, Latvia, Lebanon, Lithuania, Luxembourg, Madagascar, Malaysia, Malta, Morocco, Mauritius, Monaco, Mongolia, Mozambique, Netherlands, New Zealand, Nicaragua, Norway, Palestine, Papua New Guinea, Paraguay, Philippines, Poland, Romania, Seychelles, Senegal, Slovakia, Slovenia, South Korea, Spain, Sweden, Switzerland, Tajikistan, Thailand, Trinidad and Tobago, Tunisia, Uruguay, Uzbekistan, Venezuela, Vietnam, and ZambiaPersons traveling from Albania, Bosnia and Herzegovina, Israel, Kosovo, Turkey, Singapore, or Ukraine may enter Montenegro if they meet all the following conditions: 1) They carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test, an enzyme-linked immunosorbent assay (ELISA) test, or an electrochemiluminescence immunoassay (ECLIA) test; 2) They are a resident of a country or region designated by Montenegrin authorities as green or listed above; 3) They can prove that within 15 days of departing for Montenegro they have remained exclusively within a country or region listed above or one designated green; 4) They have traveled exclusively within a country or region listed above or one designated green (with the exception of brief transit stops as indicated on verifiable travel documents).From July 22, 2020, the Montenegrin government has declared a nationwide epidemic of COVID-19 and re-imposed protective health measures including limiting on public gatherings, enforcing of physical distancing guidelines, and mandating the wearing of protective masks."
  },
  {
    "continent": "",
    "iso_alpha2": "MG",
    "name": "Madagascar",
    "score": "Entry prohibited",
    "updated": "From March 14, all international flights have been suspended. Cruise ships are also banned from entering ports in Madagascar.A nationwide curfew is in place until further notice, from July 9, 2020, the capital and Analamanga region has been in lockdown."
  },
  {
    "continent": "",
    "iso_alpha2": "MH",
    "name": "Marshall Islands",
    "score": "Entry prohibited",
    "updated": "From March 25, all international travelers will not be allowed entry."
  },
  {
    "continent": "",
    "iso_alpha2": "MK",
    "name": "North Macedonia",
    "score": "Normal",
    "updated": "From July 1, 2020, airports have reopened and travelers may enter North Macedonia as normal."
  },
  {
    "continent": "",
    "iso_alpha2": "ML",
    "name": "Mali",
    "score": "Partially restricted",
    "updated": "From July 25, 2020, all persons traveling to Mali must complete an online health declaration and provide proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Persons who fail to provide such proof must, at their own expense, undergo testing and quarantine at a designated facility upon arrival. Health declarations forms are available from the following URLs: www.sante.gov.ml or www.anac-mali.org"
  },
  {
    "continent": "",
    "iso_alpha2": "MM",
    "name": "Myanmar",
    "score": "Entry prohibited",
    "updated": "All international commercial flights are suspended and all land border checkpoints are closed. Persons seeking to enter Myanmar for official or urgent purposes should consult their location Myanmar embassy or consulate for information regarding testing and quarantine requirements. All persons (including Myanmar nationals) allowed to enter must undergo a 21-day quarantine at a designated facility followed by 7 days of self-isolation at home. The Myanmar government has suspended the issuing of visas to foreign nationals. This policy does not apply to accredited diplomats, United Nations officials, and crews of ships or aircraft traveling to and from Myanmar. All existing visa-free and visa-on-arrival arrangements are suspended."
  },
  {
    "continent": "",
    "iso_alpha2": "MN",
    "name": "Mongolia",
    "score": "Entry prohibited",
    "updated": "Foreign nationals are prohibited from entering Mongolia. All cross-border commercial flights, passenger rail services, and passenger vehicular traffic are suspended."
  },
  {
    "continent": "",
    "iso_alpha2": "MO",
    "name": "Macau, China",
    "score": "Partially restricted",
    "updated": "<font face=-apple-system, BlinkMacSystemFont, Microsoft Yahei, emoji-one, sans-serif><span style=white-space: pre-wrap;>From November 25, 2020, all persons who have visited one of following locations in Mainland China within 14 days of their arrival in Macau SAR must, at the discretion of Macau SAR health authorities, undergo a mandatory 14-day quarantine at a designated location: Dongjiang Port Area in Tianjin Municipality, Kashgar Prefecture and Kizilsu Kyrgyz Autonomous Prefecture in Xinjiang Province, Manzhouli in the Inner Mongolia Autonomous Region, or Zhangjiang Township and Zhoupu Town in Shanghai Municipality.<font face=-apple-system, BlinkMacSystemFont, Microsoft Yahei, emoji-one, sans-serif><span style=white-space: pre-wrap;><font face=-apple-system, BlinkMacSystemFont, Microsoft Yahei, emoji-one, sans-serif><span style=white-space: pre-wrap;>All non-residents arriving from overseas are prohibited from entering Macau SAR. This policy does not apply to residents of Hong Kong SAR, Mainland China, and Taiwan provided they have not traveled to any other country or region within 14 days of their arrival in Macau SAR. This policy also provides limited exemptions for non-resident foreigners depending on their circumstances and recent travel history. All persons arriving in Macau SAR from Hong Kong SAR must carry proof of a negative result for COVID-19 issued no more than 24 hours prior to departure using a nucleic acid test and must undergo a 14-day quarantine at a designated facility upon arrival. All persons arriving from Mainland China must carry proof of a negative result for COVID-19 issued no more than 7 days prior to departure using a nucleic acid test. See above for additional restrictions on persons arriving from specific locations in Mainland China. All persons arriving in Macau SAR from Taiwan must carry proof of a negative result for COVID-19 issued no more than 7 days prior to departure using a nucleic acid test and must undergo a 14-day quarantine at a designated facility upon arrival. Additional information regarding exemptions for non-resident foreigners is available via the following URI: https://www.ssm.gov.mo/docs//17049//17049_83c59652adc7414c85fe6a10a1386aa2_002.jpeg"
  },
  {
    "continent": "",
    "iso_alpha2": "MP",
    "name": "Northern Mariana Islands",
    "score": "Partially restricted",
    "updated": "All persons (including residents) arriving from a country with an identified COVID-19 outbreak (including Guam, Hawaii, and the Continental United States) must self-isolate for 14 days. From March 31, 2020, a curfew is in effect."
  },
  {
    "continent": "",
    "iso_alpha2": "MR",
    "name": "Mauritania",
    "score": "Partially restricted",
    "updated": "Foreign nationals permitted to enter Mauritania must carry proof of a negative result for COVID-19 issued no more than 5 days prior to departure using a polymerase chain reaction (PCR) test."
  },
  {
    "continent": "",
    "iso_alpha2": "MT",
    "name": "Malta",
    "score": "Partially restricted",
    "updated": "<font color=#001000 face=Segoe UI, Arial, sans-serif>From October 16, 2020, persons arriving from countries or regions considered by Maltese authorities as green may enter Malta without restriction. Before boarding flights bound for Malta, persons traveling from amber locations must show proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Persons who reside in red locations must spend at least 14 consecutive days prior to their intended departure within a location considered by Maltese authorities as part of the so-called safe corridor. Authorities further recommend such persons undergo a PCR test no more than 72 hours prior to departure. All persons traveling to Malta are required to complete a Public Health Travel Declaration Form. More information is available at the following URL: https://www.visitmalta.com/en/covid-19"
  },
  {
    "continent": "",
    "iso_alpha2": "MU",
    "name": "Mauritius",
    "score": "Partially restricted",
    "updated": "From October 1, 2020, all persons (including infants and children) arriving in Mauritius must have proof of a negative result for COVID-19 issued no more than 7 days prior to departure and proof of a purchased travel package that includes a 14-day in-room quarantine accomidation. All persons must undergo a polymerase chain reaction (PCR) test for COVID-19 on the 7th day following their arrival and then again on the 14th day. Quarantine accommodation can be booked online at the following URL: https://booking.mymauritius.travel/"
  },
  {
    "continent": "",
    "iso_alpha2": "MV",
    "name": "Maldives",
    "score": "Partially restricted",
    "updated": "Persons traveling for tourism must present proof of a negative result for COVID-19 issued no more than 96 hours prior to initial departure for the Maldives using a polymerase chain reaction (PCR) test. This policy does not apply to infants less than one year old. Travelers who, within 14 days of their intended departure, have a history of contact with a suspected or confirmed case of COVID- 19, or with persons who have fever or respiratory symptoms such as cough, sore throat, shortness of breath are advised not to travel to Maldives. Additional information is available at the following URL: https://visitmaldives.com/en/covid19-updates"
  },
  {
    "continent": "",
    "iso_alpha2": "MW",
    "name": "Malawi",
    "score": "Partially restricted",
    "updated": "From September 1, 2020, all persons traveling to Malawi must have proof of a negative test result for COVID-19 issued no more than 10 days prior to departure using a polymerase chain reaction (PCR) test. Travelers must undergo an additional PCR test upon arrival and all returning residents must self-isolate for 14 days."
  },
  {
    "continent": "",
    "iso_alpha2": "MX",
    "name": "Mexico",
    "score": "Normal",
    "updated": "Persons traveling to Mexico via air are required to complete a Questionnaire of Identification of Risk Factors in Travelers. The form is available at: https://afac.hostingerapp.com/ . Mexico’s land border with the United States is closed all to non-essential travel."
  },
  {
    "continent": "",
    "iso_alpha2": "MY",
    "name": "Malaysia",
    "score": "Partially restricted",
    "updated": "Reciprocal Green Lane for Singapore Residents From August 10, 2020, legal residents in Singapore may be eligible to travel to Malaysia for business or official travel for up to 14 days using a so-called Reciprocal Green Lane (RGL) scheme. Persons seeking to use the RGL must be sponsored by either a Malaysia-based company or a Malaysian government agency, which will file an application on their behalf for a MyTravelPass at least 10 business days prior to intended departure.Persons seeking to use the RGL cannot have traveled outside of Singapore during the 14 days prior to their scheduled departure for Singapore and must, at their own expense, obtain a certificate showing a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Travelers are required to produce this certificate along with their MyTravelPass and in order to enter Malaysia.RGL travelers must undergo an additional PCR test at their point of entry or within 24 hours of arrival in Malaysia and must be transported directly by the host company or government agency to a non-residential accommodation where they must self-isolate while awaiting their test results. Upon confirmation of a negative test result, the host company or government agency will ensure the traveler is transported to and from their workplace for the duration of the traveler's stay and will further ensure the traveler installs and uses the MySejahtera mobile application. Persons who test positive for COVID-19 must immediately seek necessary medical treatment from the Malaysian government.Periodic Commuting Arrangement for Singapore Residents From August 10, 2020, Singaporean nationals and permanent residents holding valid long-term Malaysian visas for business or work purposes may be eligible for a new Periodic Commuting Arrangement (PCA) scheme allowing travel via the Johor-Singapore Causeway and Malaysia-Singapore Second Link land border checkpoints. Malaysia-based employers must submit an application for a MyTravelPass to use the PCA on behalf of their employees. Applications must be submitted at least 10 business days prior to the employee's intended entry into Malaysia and employees must be willing to remain in Malaysia for at least 90 days before returning to Singapore. Persons using the PCA must install and use the MySejahtera mobile application. Upon arrival in Malaysia, they must self-isolate for 7 days under the terms of a modified Home Surveillance Order (HSO) and afterwards undergo a serological test for COVID-19 using a rapid test kit (RTK). Persons who test negative will be released from their HSO.All Others Foreign nationals traveling from countries or regions with over 150,000 confirmed cases of COVID-19 are prohibited from entering Malaysia. Currently, this applies to the following locations: Argentina, Bangladesh, Brazil, Chile, Columbia, France, Germany, India, Indonesia, Iran, Iraq, Italy, Mexico, Pakistan, Peru, Russia, Saudi Arabia, South Africa, Spain, Philippines, Turkey, United Kingdom, and the United States. Foreign nationals traveling from other locations may do so only if they are a permanent resident holding a MyPR card, hold a Malaysia My Second Home (MM2H) pass, hold a valid student pass, hold a valid temporary employment pass, are the spouse or child of Malaysian nationals, or are a diplomat.All persons (including Malaysian nationals) returning from abroad are required to undergo testing for COVID-19 and a 14-day quarantine upon arrival. Non-nationals must register online and prepay in full for all required testing and quarantine services. Malaysian nationals will be charged a reduced rate. Additionally, all persons must download and sign a Letter of Undertaking and Indemnity for Persons under Surveillance (LoU). Travelers should consult their local Malaysian embassy or consulate for LoU templates and instructions. At least three days prior to departure, all persons must submit relevant documents (including a LoU) to a local Malaysian embassy or consulate for approval. Failure to submit documents may result in a denial of permission to board flights bound for Malaysia. Upon arrival, all persons are required install and use the MySejahtera mobile application to track and monitor their health status. Registration and prepayment information is available via the following URL: https://safetravel.myeg.com.my/"
  },
  {
    "continent": "",
    "iso_alpha2": "MZ",
    "name": "Mozambique",
    "score": "Partially restricted",
    "updated": "Persons traveling to Mozambique must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test performed in the country or region of departure. Persons must, at their own expense, self-isolate for 10 days upon arrival at their homes or other suitable accommodation. Afterwards, they must undergo an additional PCR test. Persons unable to afford the additional PCR test may elect to self-isolate for a full 14 days. Most land border checkpoints remain closed."
  },
  {
    "continent": "",
    "iso_alpha2": "NA",
    "name": "Namibia",
    "score": "Partially restricted",
    "updated": "Persons arriving in Namibia must have proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Those with valid PCR test results are not subject to quarantine; however, they must undergo an additional PCR test on the 5th day following their arrival. Persons traveling to Namibia for tourism must hold medical insurance valid in Namibia with coverage sufficient for any unexpected health-related expenses. Additionally, they must complete a health declaration form and provide a full travel itinerary to airport officials upon arrival. All international flights are required to arrive at Hosea Kutako International Airport (WDH) in Windhoek. All land border checkpoints are closed except to persons holding a valid work permit. Heath declaration forms and additional information are available at the following URL: http://www.namibiatourism.com.na/page/tourism-revival-initiative"
  },
  {
    "continent": "",
    "iso_alpha2": "NE",
    "name": "Niger",
    "score": "Entry prohibited",
    "updated": "From August 1, 2020, all persons arriving via air must present proof of a negative test result for COVID-19 issued no more than 72 hours prior to departure and undergo a 14-day quarantine upon arrival. The quarantine requirement does not apply to persons on short-term visits. All land border checkpoints are closed until further notice."
  },
  {
    "continent": "",
    "iso_alpha2": "NG",
    "name": "Nigeria",
    "score": "Partially restricted",
    "updated": "From September 18, 2020, all persons arriving in Nigeria must provide proof of a negative result for COVID-19 issued no more than 120 hours prior to departure using a polymerase chain reaction (PCR) test. Results must be uploaded to the Nigeria International Travel Portal website prior to departure. Travelers must also register, pre-pay for a second PCR test to be performed upon arrival, and submit a Health Declaration / Self-Reporting form. Prior to boarding flights bound for Nigeria all persons will undergo a health screening. Those showing symptoms consistent with COVID-19 will not be permitted to board. Additional information and reporting forms are available at the following URL: https://covid19.ncdc.gov.ng/advisory/"
  },
  {
    "continent": "",
    "iso_alpha2": "NI",
    "name": "Nicaragua",
    "score": "Partially restricted",
    "updated": "All persons traveling to Nicaragua must hold proof of a negative test result for COVID-19 issued no more than 72 hours prior to departure. Upon arrival, travelers must undergo health screening. Persons exhibiting symptoms consistent with COVID-19 will be quarantined."
  },
  {
    "continent": "",
    "iso_alpha2": "NL",
    "name": "Netherlands",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering the Netherlands for non-essential travel. This policy does not apply to nationals and residents from countries or regions in the European Union, countries or regions associated with the Schengen Area, Australia, Japan, New Zealand, Rwanda, Singapore, South Korea, Thailand, United Kingdom, or Uruguay. Further exemptions exist for cross-border commuters, diplomats, elite athletes and their support staff, flight crews, key workers, members of the armed forces traveling to the Netherlands as part of their duties, persons in a long-distance relationship with someone from the Netherlands, persons who hold a long-stay visa, persons who hold a service passport traveling to the Netherlands as part of their duties, persons who hold a valid residence permit, persons who work in the energy or transport sectors, persons who work for international or humanitarian organizations, persons whose purpose of travel will have demonstrable value for the Dutch economy and Dutch society, persons with a compelling family interest, professionals in the cultural and creative sectors, professional journalists, researchers, seafarers in possession of a seafarer's record book (excluding seafarers on commercial yachts and pleasure crafts), or seasonal workers. Be advised, some regional- and municipal-level authorities in the Netherlands have implemented additional policies and restrictions for persons arriving into their jurisdictions. A complete list of exempted categories and information about required documentation is available at the following URL: https://www.government.nl/topics/coronavirus-covid-19/tackling-new-coronavirus-in-the-netherlands/travel-and-holidays/visiting-the-netherlandsAll persons traveling from outside any of the locations mentioned above must self-isolate for 14 days upon arrival. Additionally, persons arriving from certain European regions must self-isolate upon arrival. An updated list of self-isolation requirements from the Dutch government is available at the following URL: https://www.government.nl/topics/coronavirus-covid-19/tackling-new-coronavirus-in-the-netherlands/travel-and-holidays/self-quarantine"
  },
  {
    "continent": "",
    "iso_alpha2": "NO",
    "name": "Norway",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Norway. This policy does not apply to persons who hold a valid Norwegian residence or work permit. The Norwegian government will classify countries / regions as either yellow or red based on determinations by Norwegian health authorities. Persons arriving from yellow locations are exempt from mandatory quarantine requirements. Persons arriving from red locations or from locations for which there is insufficient health data (striped locations) must undergo a mandatory quarantine upon arrival. An official list is available from the Norwegian government at the following URL: https://www.fhi.no/en/op/novel-coronavirus-facts-advice/facts-and-general-advice/travel-advice-COVID19/"
  },
  {
    "continent": "",
    "iso_alpha2": "NP",
    "name": "Nepal",
    "score": "Partially restricted",
    "updated": "From October 17, 2020, persons arriving in Nepal on scheduled international flights must carry the following documents: 1) a valid visa or entry permit, 2) proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test, 3) a completed online form from the Nepal COVID-19 Crisis Management Center (CCMC) showing the bar code, and 4) proof of a minimum 7-night hotel booking. Priority will be given to repatriation flights, lawful residents, diplomats, and international aid officials. All persons seeking to travel to Nepal for mountaineering and trekking must obtain all required visas prior to departure. More information is available at the following URL: https://trade.welcomenepal.com/entry-protocol-for-mountaineering-expeditions-and-trekking-in-nepal/All land border checkpoints are closed until at least November 15, 2020."
  },
  {
    "continent": "",
    "iso_alpha2": "NU",
    "name": "Niue",
    "score": "Entry prohibited",
    "updated": "From April 2 to August 31, 2020, foreign nationals are prohibited from entering Niue. This policy does not apply to residents who have lived in Niue for more than 12 months and residents who have lived continuously in Niue for at least 6 of the past 12 months, professionals, and technicians such as medical personnel who hold written permission from the Niue government. All persons arriving to Niue by flight must undergo a 14-day quarantine at a designated facility."
  },
  {
    "continent": "",
    "iso_alpha2": "NZ",
    "name": "New Zealand",
    "score": "Entry prohibited",
    "updated": "Foreign nationals are prohibited from entering New Zealand. This policy does not apply lawful residents holding valid travel documents, partners or dependent children of New Zealand nationals or residents who hold a valid visa based on this status, Australian nationals or lawful permanent residents who ordinarily reside in New Zealand, and diplomats posted to New Zealand. All other non-nationals and non-residents who do not fall into one of the aforementioned categories must obtain approval from New Zealand immigration authorities prior to boarding flights bound for New Zealand. Separate restrictions apply to persons seeking to transit New Zealand for final destinations abroad. All travelers should consult the latest information regarding restrictions on transit prior to finalizing travel arrangements. All arriving persons (including New Zealand nationals) must undergo testing for COVID-19 and a 14-day quarantine at a designated facility upon arrival. Additional information and request forms for travel to New Zealand are available at the following URL: https://www.immigration.govt.nz/formshelp/request-for-travel-to-new-zealand"
  },
  {
    "continent": "",
    "iso_alpha2": "OM",
    "name": "Oman",
    "score": "Partially restricted",
    "updated": "From October 1, 2020, foreign nationals are prohibited from entering Oman. This policy does not apply to persons holding a valid residence visa. Persons entering Oman must have proof of suitable accommodation where they will self-isolate for 14 days upon arrival and must also install the Tarassud+ mobile app and start the registration process prior to departure. Additionally, they must purchase a tracking bracelet for use during the self-isolation period at a cost of OMR 5 and carry medical insurance valid for their entire duration of stay in Oman.This policy does not apply to air crews."
  },
  {
    "continent": "",
    "iso_alpha2": "PA",
    "name": "Panama",
    "score": "Entry prohibited",
    "updated": "All persons arriving in Panama are required to show proof of a negative test result for COVID-19 issued no more than 48 hours prior to departure using a polymerase chain reaction (PCR) or antigen test. Persons without such proof must, at their own expense, undergo a PCR test upon arrival followed by a 7-day quarantine at a designated location and an additional PCR test after 7 days."
  },
  {
    "continent": "",
    "iso_alpha2": "PE",
    "name": "Peru",
    "score": "Entry prohibited",
    "updated": "Foreign nationals are prohibited from entering Peru for tourism. A daily curfew is in effect nationwide from 21:00 (9:00 p.m.) to 04:00 (4:00 a.m.)."
  },
  {
    "continent": "",
    "iso_alpha2": "PG",
    "name": "Papua New Guinea",
    "score": "Partially restricted",
    "updated": "All persons traveling to Papua New Guinea (including nationals) must arrive via air at Jacksons International Airport (POM) in Port Moresby. Traditional border checkpoints on routes from Australia, Indonesia, Micronesia, and the Solomon Islands are closed. In order to board a flight bound for Papua New Guinea, all persons must provide proof they have tested negative for detectable levels of COVID-19 within the previous 7 days and hold authorization from the Controller of the COVID-19 National Control Centre. Upon arrival, all persons must undergo quarantine at a designated facility in Port Moresby. This requirement does not apply to diplomats, who may self-isolate for 14-days at their place of residence."
  },
  {
    "continent": "",
    "iso_alpha2": "PH",
    "name": "Philippines",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering the Philippines. This policy does not apply to foreign spouses and children of Filipino citizens, foreign parents of Filipino minors or Filipino children with special needs, persons who hold a valid long-term visa, diplomatic officials, persons who work for international organizations, foreign airline crew members, or foreign seafarers holding a category 9(c) visa. Further exemptions exist for persons holding a valid, previously-issued Permanent Resident or Native-Born visa (categories 13(a), 13(b), 13(c), 13(d), 13(e), 13(g), RA 7919, EO 324, or native-born), persons holding a valid visa for work as personnel or executives of multinational companies (category EO 226 as amended by RA 8756), persons holding a special visa issued by the Philippine Department of Justice (category 47(a)2), and persons holding a visa issued by the Aurora Pacific Economic Zone and Freeport Authority or the Subic Bay Metropolitan Authority. Such persons must secure a pre-booked COVID-19 testing provider and a place at an accredited quarantine facility prior to departure. Entry is subject to limitation regarding the maximum number of allowed inbound passengers at the specific arrival port on the scheduled arrival date. The Philippine government has suspended the issuing of new visas and all existing visa-free entry arrangements are suspended. All persons (including Filipino nationals) granted entry to the Philippines must undergo a 14-day quarantine at a designated facility. Overseas Filipino Workers (OFWs) and persons traveling together as a family with at least 1 OFW must submit an electronic case investigation form (e-CIF) online prior to boarding aircraft bound for the Philippines. Non-OFWs and foreign nationals should consult their airline regarding the submission of an e-CIF. The e-CIF system for OFWs is available at the following URL: https://e-cif.redcross.org.ph/"
  },
  {
    "continent": "",
    "iso_alpha2": "PK",
    "name": "Pakistan",
    "score": "Partially restricted",
    "updated": "From October 5, 2020, all persons arriving in Pakistan from abroad must carry proof of a negative result for COVID-19 issued no more than 96 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. This policy does not apply to persons arriving from certain countries or regions. Upon arrival, all persons must undergo health screening and provide contact information via the PassTrack mobile application on a web-based form. Additional information, including a list of locations exempted from testing requirements, is available at the following URL: http://covid.gov.pk/intl_travellers/current_policies"
  },
  {
    "continent": "",
    "iso_alpha2": "PL",
    "name": "Poland",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Poland. This policy does not apply to nationals from countries and regions in the European Union or countries and regions associated with the Schengen Area. Nationals from Belarus, Russia, and Ukraine may enter Poland provided they are the spouse or child of a Polish national or hold a valid Polish work permit. Passenger rail service to destinations outside the European Union is suspended. Additional information is available from Polish authorities at the following URL: https://www.gov.pl/web/coronavirus/travel"
  },
  {
    "continent": "",
    "iso_alpha2": "PS",
    "name": "Palestine",
    "score": "Partially restricted",
    "updated": "From March 22, travelers from abroad will be quarantined at designated locations."
  },
  {
    "continent": "",
    "iso_alpha2": "PT",
    "name": "Portugal",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Portugal. This policy does not apply to persons arriving from countries or regions in the European Union, countries or regions associated with the Schengen Area, Australia, Hong Kong SAR, Japan, Macau SAR, Mainland China, New Zealand, Rwanda, Singapore, South Korea, Thailand, United Kingdom, or Uruguay. Persons seeking to travel to Portugal from any other country or region may do so only for essential purposes, which does not include tourism. All persons arriving via air must fill out a Passenger Locator Card for contact tracing purposes. Additionally, all persons arriving via air from countries or regions other than those listed above must provide proof of a negative test result for COVID-19 issued no more than 72 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. This policy does not apply to persons transiting through Portugal provided they do not leave the airport facilities."
  },
  {
    "continent": "",
    "iso_alpha2": "PW",
    "name": "Palau",
    "score": "Partially restricted",
    "updated": "From February 5 until June 30, 2020, Palau will prohibit entry of all travelers with travel history originating from or transiting through mainland China, Hong Kong and Macau within 14 days of their arrival in the country.Exemption may be made to this prohibition for Palauan citizens and residents, provided that such persons submit to a comprehensive health screening and agree to a 14-day self-quarantine upon arrival in Palau.Any person, including a crew member, a Palauan citizen, or a Palau resident, arriving into Palau at any point of entry is required to complete a health declaration form and to submit to all testing and quarantine procedures.All resident workers of Palau are advised to carry their worker’s permit and immigration entry permit while traveling.From February 1 to June 30, 2020, flights from mainland China (including Hong Kong, Macau) to Palau are suspended."
  },
  {
    "continent": "",
    "iso_alpha2": "PY",
    "name": "Paraguay",
    "score": "Partially restricted",
    "updated": "From November 16, 2020, all persons arriving in Paraguay must have proof of a negative test result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. All persons must also carry proof of international medical insurance valid for use in Paraguay. This policy does not apply to travelers from countries or regions part of the Southern Common Market (Mercosur). Persons without such proof must undergo quarantine upon arrival."
  },
  {
    "continent": "",
    "iso_alpha2": "QA",
    "name": "Qatar",
    "score": "Entry prohibited",
    "updated": "Foreign nationals are prohibited from entering Qatar. Qatari nationals and Qatar ID (QID) holders returning from abroad must have a confirmed 14-day reservation at a government-approved quarantine hotel. Bookings should be made online at the Discover Qatar website. Failure to secure a booking prior to arrival may result in a denial of permission to enter Qatar. Persons holding a QID are advised not to book a quarantine package before receiving approval to return to Qatar. Additional information is available at the following URL: https://portal.www.gov.qa/wps/portal/qsports/home"
  },
  {
    "continent": "",
    "iso_alpha2": "RO",
    "name": "Romania",
    "score": "Partially restricted",
    "updated": "Foreign nationals and stateless persons are prohibited from entering Romania. This policy does not apply to citizens from countries and regions in the European Union, foreign nationals and their family members who legally reside in Romania, persons who hold a valid Romanian residence permit, and diplomats or staff of international organizations and humanitarian missions. Persons displaying symptoms consistent with COVID-19 must self-isolate for 14 days upon arrival."
  },
  {
    "continent": "",
    "iso_alpha2": "RS",
    "name": "Serbia",
    "score": "Partially restricted",
    "updated": "From August 15, 2020, foreign nationals arriving from Bulgaria, Croatia, North Macedonia, or Romania must carry proof of a negative result for COVID-19 issued no more than 48 hours prior to departure using a polymerase chain reaction (PCR) test. This policy does not apply to lawful residents, diplomats, children under 12, or persons transiting through Serbia who remain within Serbian jurisdiction for less than 12 hours."
  },
  {
    "continent": "",
    "iso_alpha2": "RU",
    "name": "Russia",
    "score": "Partially restricted",
    "updated": "</style> From March 18, 2020, foreign nationals are prohibited from entering Russia. This policy does not apply to diplomats, airplane crew members, or permanent residents. From March 30, 2020, Russia’s land borders are closed to passenger transport. Foreign nationals are prohibited from entering Russia and land border checkpoints are closed to passenger transport. From November 15, 2020, this policy does not apply to persons arriving by air from Belarus, Cuba, Egypt, Ethiopia, Japan, Kazakhstan, Kyrgyzstan, the Maldives, Serbia, Seychelles, South Korea, Switzerland, Tanzania, Turkey, United Arab Emirates, or the United Kingdom. Further exemptions exist for lawful residents, diplomats, airplane crew members, or those traveling for urgent business or medical reasons. Persons seeking to enter Russia must present documentation issued in either English or Russian showing a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Persons traveling to Russia for purposes of employment must undergo a 14-day quarantine upon arrival. Russian nationals returning from abroad are required to submit an online registration from, undergo a PCR test within 72 hours of arrival in Russia, and report their test results to national authorities. Registration forms are available at the following URL: https://www.gosuslugi.ru/"
  },
  {
    "continent": "",
    "iso_alpha2": "RW",
    "name": "Rwanda",
    "score": "Partially restricted",
    "updated": "Persons traveling to Rwanda must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test and fill in the online form found at the following URL: https://caa.gov.rw . All persons must, at their own expense, undergo an additional PCR test for COVID-19 at the cost of US$50 and a 24-hour quarantine at a designated facility upon arrival. A nightly curfew is in effect nationwide between 21:00 (9:00 p.m.) and 05:00 (5:00 a.m.) and several districts in Kigali are under confinement orders. Masks must be worn in public and all land border checkpoints remain closed."
  },
  {
    "continent": "",
    "iso_alpha2": "SA",
    "name": "Saudi Arabia",
    "score": "Entry prohibited",
    "updated": "From September 15, 2020, foreign nationals are prohibited from entering Saudi Arabia. This policy does not apply to the following categories of persons: those holding both a valid residence permit (iqama) and an exit/re-entry visa, those holding a valid work visa, and those holding a visa for professional or family visitation. Before boarding flights bound for Saudi Arabia, persons in these categories must present proof of a negative result for COVID-19 issued no more than 48 hours prior to departure using a polymerase chain reaction (PCR) test. Upon arrival, they must register with Saudi authorities and strictly quarantine for 7 days."
  },
  {
    "continent": "",
    "iso_alpha2": "SB",
    "name": "Solomon Islands",
    "score": "Entry prohibited",
    "updated": "From March 22, Non-Citizens of Solomon Islands will not be permitted to enter the country. Solomon Islands Citizens and residents who travelled through any country reporting cases of COVID-19 (Coronavirus) will be permitted to enter but will undergo mandatory strict quarantine for 14 days."
  },
  {
    "continent": "",
    "iso_alpha2": "SC",
    "name": "Seychelles",
    "score": "Partially restricted",
    "updated": "From August 31, 2020, foreign nationals are prohibited from visiting the Seychelles. This policy does not apply to persons traveling from the following countries or regions: Austria, Cambodia, Canada, China, Cyprus, Denmark, Estonia, Finland, Germany, Hungary, Iceland, Ireland, Italy, Latvia, Lithuania, Malaysia, Mauritius, Monaco, New Zealand, Norway, Portugal, Qatar, Singapore, Slovakia, Slovenia, Sri Lanka, Switzerland, Thailand, orUnited Arab EmiratesPersons arriving in the Seychelles must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Results should submitted using the official form provided at the following URL: http://tourism.gov.sc/wp-content/uploads/2020/05/Submission-of-Covid-test-result-to-PHA-updated.pdf and afterwards emailed directly to health authorities at visitor@health.gov.sc . More information is available at the following URL: http://tourism.gov.sc/"
  },
  {
    "continent": "",
    "iso_alpha2": "SD",
    "name": "Sudan",
    "score": "Partially restricted",
    "updated": "From September 1, 2020, all persons arriving in Sudan must have proof of a negative result for COVID-19 issued no more than 96 hours prior to departure using a polymerase chain reaction (PCR) test performed by a certified provider. This policy does not apply to children age 6 or under."
  },
  {
    "continent": "",
    "iso_alpha2": "SE",
    "name": "Sweden",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Sweden. The policy does not apply to foreign nationals arriving from countries or regions within the European Union, countries or regions associated with the Schengen Area, or the United Kingdom. Further exemptions exist for persons with particularly urgent needs, persons who are to carry out essential functions in Sweden such as healthcare professionals, staff transporting goods, and persons with imperative family reasons."
  },
  {
    "continent": "",
    "iso_alpha2": "SG",
    "name": "Singapore",
    "score": "Partially restricted",
    "updated": "Air Travel Pass Now Available to Travelers from Mainland China From November 6, 2020, travelers departing from Mainland China are permitted to enter Singapore for short-term visits including for tourism. Travelers must apply for an Air Travel Pass (ATP) at least 7 days and no more than 30 days prior to their intended arrival in Singapore and must remain entirely within Mainland China for the 14 days prior to their scheduled departure. Upon arrival, all persons must, at their own expense, undergo a polymerase chain reaction (PCR) test for COVID-19 and self-isolate for 1-2 days at a pre-booked, non-residential accommodation while awaiting their test results. All persons are required to install the TraceTogether mobile app for contact tracing purposes and submit their personal information electronically via SG Arrival Card system. Persons who hold a passport that requires a visa for travel to Singapore must separately obtain a valid visa prior to departure. An ATP is NOT a substitute for a required visa. Additional information including links to ATP applications are available at the following URL: https://safetravel.ica.gov.sg/china/atp/requirements-and-processReciprocal Green Lane for Residents from Brunei Darussalam, Indonesia, Japan, and Malaysia From October 26, 2020, residents from Brunei Darussalam, Indonesia, Japan, and Malaysia may be eligible to travel to Singapore for business or official travel using a so-called Reciprocal Green Lane (RGL) scheme. Persons seeking to use the RGL must be sponsored by either a Singapore-based company or a Singapore Government agency, which will file an application on their behalf for a SafeTravel Pass. Once approved, SafeTravel Pass holders may then apply for a standard travel visa (persons holding existing valid visas need not apply for a new visa). Residents from Malaysia are limited to a maximum stay of 14 days. Residents from Indonesia are limited to traveling from either Soekarno-Hatta International Airport (CGK) or the Batam Center Ferry Terminal.Persons seeking to use the RGL cannot have traveled outside either Brunei Darussalam, Indonesia, Japan, or Malaysia during the 14 days prior to their scheduled departure for Singapore and must, at their own expense, obtain a certificate showing a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test performed by a laboratory accredited by the government of Brunei, the government of Indonesia, the government of Japan, or the Malaysian Ministry of Health. Travelers are required to produce this certificate along with their SafeTravel Pass, valid travel visa, and proof of a return ticket or other onward transportation in order to enter Singapore.Upon arrival, RGL travelers will undergo an additional PCR test at their own expense and will be transported by the host company or government agency to a non-residential accommodation where they must self-isolate while awaiting their test results. Upon confirmation of a negative test result, the host company or government agency will ensure the traveler is transported to and from their workplace for the duration of the traveler's stay in Singapore. The host company or government agency will further ensure the traveler installs and uses the TraceTogether mobile app for the duration of the traveler's stay in Singapore. RGL travelers are not permitted to use public transportation while in Singapore.Periodic Commuting Arrangement for Malaysian Residents From August 10, 2020, Malaysian nationals and permanent residents holding valid Singapore work passes may be eligible for a new Periodic Commuting Arrangement (PCA) scheme allowing cross-border travel at the Johor-Singapore Causeway and Malaysia-Singapore Second Link. Singapore-based employers must submit an application to use the PCA on behalf of their employees. Applications must be submitted at least 7 days prior to the employee's intended entry into Singapore and employees must be willing to remain in Singapore for at least 90 days. Specific information requirements for submitting a PCA application are available at the following URL: https://safetravel.ica.gov.sg/malaysia/pca/overviewPrior to arrival, persons using the PCA must complete an electronic Health Declaration Card (eHDC) found at the following URL: https://eservices.ica.gov.sg/sgarrivalcard . They must also install the TraceTogether, Homer, and WhatsApp mobile applications. Upon arrival, persons using the PCA must refrain from using public transportation and proceed directly to their registered accommodation where they must self-isolate for 7 days under the terms of their Stay Home Notice (SHN). During the self-isolation period, persons are only allowed to leave their SHN location to go to a designated testing facility to undergo a PCR swab test for COVID-19. During their stay, persons in Singapore under the PCA must abide by all prevailing local public health requirements and safe distancing measures. Persons using the PCA, or their employers, must agree to cover all costs associated with self-isolation and testing.Fast Lane Immigration Clearance for Chinese and South Korean Nationals From September 4, 2020, Chinese and South Korean nationals traveling to Singapore for business purposes may qualify for special fast lane immigration clearance. To use the fast lane, travelers must be sponsored by either a Singapore-based company or a government agency, which will file an application on behalf of the traveler for a SafeTravel Pass. If approved, the traveler will receive an official notification letter. Persons requiring a visa may use the letter during the visa application process. Persons already holding a valid visa may use the existing visa as normal. Persons who qualify under a visa-free arrangement need not apply for a visa to use the fast lane.For at least 7 days prior to departure for Singapore, Chinese nationals intending to use the fast lane must remain in one of the following provinces or municipalities in China: Chongqing, Guangdong, Jiangsu, Shanghai, Tianjin, or Zhejiang. For at least 14 days prior to departure for Singapore, South Korean nationals intending to use the fast lane must remain in South Korea. Fast lane travelers must undergo a polymerase chain reaction (PCR) test for COVID-19 no more than 48 hours prior to departure in the case of Chinese nationals or 72 hours prior to departure in the case of South Korean nationals. Airlines will conduct pre-boarding checks to verify the traveler holds a valid SafeTravel Pass, a negative PCR test result, a return air ticket, and a valid visa (if required). Failure to produce these documents may result in a denial of permission to board the aircraft.Upon arrival, fast lane travelers will undergo an additional PCR test and will be transported by the host company or government agency to a non-residential accommodation where they must self-isolate while awaiting their test results. Upon confirmation of a negative test result, the host company or government agency will ensure the traveler is transported to and from their workplace for the duration of the traveler's stay in Singapore. The host company or government agency will further ensure the traveler installs and uses the TraceTogether mobile app for the duration of the traveler's stay in Singapore. Fast lane travelers are not permitted to use public transportation while in Singapore.All Others The following policies are in place:1) The Singaporean government will designate countries / regions as either lower-risk or higher-risk depending on relevant epidemiological factors and the prevalence of COVID-19 in those locations. All persons arriving from lower-risk locations must either: a) undergo a polymerase chain reaction (PCR) test for COVID-19 upon arrival in Singapore, or b) self-isolate for 7 days at the their place of residence and undergo a subsequent PCR test. All persons arriving from higher-risk locations must undergo a 14-day quarantine at their residence or a designated facility followed by a subsequent PCR test;2) All persons (including those transiting Singapore) who have traveled to India, Indonesia, or the Philippines within 14 days of their arrival in Singapore must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. This policy does not apply to Singaporean nationals or lawful permanent residents;3) From November 18, 2020, all persons arriving in Singapore (regardless of origin) must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. This policy does not apply to Singaporean nationals or lawful permanent residents. All persons (including Singapore nationals and permanent residents) must submit a health declaration to immigration authorities upon arrival;4) Persons who, for the 14 consecutive days prior to their departure for Singapore, have remained in either Australia, Brunei Darussalam, Mainland China, New Zealand, or Vietnam may apply for an Air Travel Pass (ATP) at least 7 days and no more than 30 days prior to their intended arrival in Singapore. Upon arrival, such persons must undergo testing for COVID-19; however, they are not required to self-isolate or undergo quarantine. Persons who test positive must undergo treatment at their own expense. Travelers from Hong Kong SAR must additionally undergo pre-departure testing and book passage aboard special Air Travel Bubble flights for travel to Singapore;5) All other short-term visitors, regardless of origin, are prohibited from entering or transiting through Singapore;6) All foreign nationals holding a Long-Term Pass issued by Immigration &amp; Checkpoints Authority (ICA) must obtain prior permission from the relevant government agency prior to departing for Singapore. This includes Long-Term Visit Pass (LTVP) or Student's Pass (STP), or In-Principle Approval (IPA) letters for LTVP or STP.Additional information is available from the following URL: https://safetravel.ica.gov.sg/"
  },
  {
    "continent": "",
    "iso_alpha2": "SI",
    "name": "Slovenia",
    "score": "Partially restricted",
    "updated": "The Slovenia government classifies countries / regions based on determinations by Slovenian authorities. Nationals and lawful residents from green locations may enter Slovenia without restriction and / or quarantine. Persons arriving from yellow locations must undergo a 10-day quarantine upon arrival. This policy does not apply to foreign nationals holding valid temporary or permanent residence in Slovenia, persons traveling from countries / regions in the European Union or countries / regions associated with the Schengen Area provided such persons can prove they have not visited any red locations. All persons arriving from red locations, regardless of their status, must undergo a 10-day quarantine upon arrival in Slovenia. Additional information and a current list of location designations is available at the following URL: https://www.gov.si/en/topics/coronavirus-disease-covid-19/border-crossing/From October 25, 2020, nightly restrictions on movement and public gatherings are in effect nationwide from 21:00 (9:00 p.m.) and 06:00 (6:00 a.m.). More information is available at the following URL: https://www.gov.si/en/topics/coronavirus-disease-covid-19/"
  },
  {
    "continent": "",
    "iso_alpha2": "SK",
    "name": "Slovakia",
    "score": "Partially restricted",
    "updated": "All persons arriving in Slovakia must self-isolate and undergo testing for COVID-19. This policy does not apply to persons arriving from countries or regions designated by the Slovakian government as low risk for COVID-19. An official list of such locations is available at the following URL: https://korona.gov.sk/en/travelling-to-slovakia-and-covid19/"
  },
  {
    "continent": "",
    "iso_alpha2": "SL",
    "name": "Sierra Leone",
    "score": "Partially restricted",
    "updated": "From August 7, 2020, all persons must complete a health form, show proof of prepayment for COVID-19 tests to be carried out on arrival in Sierra Leona, and present proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Upon arrival, all persons are subject to both a PCR test and a rapid diagnostic test (RDT). Persons who test positive using the RDT will be quarantined at their own expense while awaiting their PCR test result. Persons who test positive using the PCR test will be contacted by health authorities regarding available treatment options. Prepayment instructions, health declaration forms, and additional information are available at the following URL: https://www.travel.gov.sl . All land border checkpoints remain closed to passenger traffic."
  },
  {
    "continent": "",
    "iso_alpha2": "SN",
    "name": "Senegal",
    "score": "Partially restricted",
    "updated": "All persons traveling to Senegal must present proof of a negative test result for COVID-19 issued no more than 5 days prior to departure."
  },
  {
    "continent": "",
    "iso_alpha2": "SO",
    "name": "Somalia",
    "score": "Partially restricted",
    "updated": "From August 3, 2020, all persons traveling to Somalia must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure. A nightly curfew is in effect in Mogadishu from 20:00 (8:00 p.m.) to 05:00 (5:00 a.m.) and all travel into the city is prohibited during those hours."
  },
  {
    "continent": "",
    "iso_alpha2": "SR",
    "name": "Suriname",
    "score": "Entry prohibited",
    "updated": "All travel to Suriname is prohibited. All air, land, and sea border checkpoints are closed until further notice. A nightly curfew is in effect nationwide from 21:00 (9:00 p.m.) to 05:00 (5:00 a.m.)."
  },
  {
    "continent": "",
    "iso_alpha2": "SS",
    "name": "South Sudan",
    "score": "Entry prohibited",
    "updated": "Travelers from more than 70 coronavirus affected countries and regions will not be allowed entry. From March 23, all international passenger flights will be suspended and all borders will be closed, except for cargo and humanitarian missions. All land borders will be closed, except for cargo."
  },
  {
    "continent": "",
    "iso_alpha2": "ST",
    "name": "Sao Tome and Principe",
    "score": "Partially restricted",
    "updated": "All persons arriving in Sao Tome and Principe must have proof of a negative test result for COVID-19 issued no more than 72 prior to departure. Persons who test positive, the close contacts of such persons, and persons exhibiting symptoms consistent with COVID-19 must undergo quarantine upon arrival. Persons holding a passport from a country or region in Europe may travel to Sao Tome and Principe visa-free for up to 15 days."
  },
  {
    "continent": "",
    "iso_alpha2": "SV",
    "name": "El Salvador",
    "score": "Partially restricted",
    "updated": "All persons traveling to El Salvador must have proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. More information is available at the following URL: http://www.cepa.gob.sv/"
  },
  {
    "continent": "",
    "iso_alpha2": "SX",
    "name": "Sint Maarten",
    "score": "Entry prohibited",
    "updated": "From March 30, 2020, all persons are prohibited from entering Sint Maarten. A curfew from 20:00 to 06:00 (8:00 p.m. to 6:00 a.m.) is in place."
  },
  {
    "continent": "",
    "iso_alpha2": "SY",
    "name": "Syria",
    "score": "Partially restricted",
    "updated": "From March 19, Citizens of 26 countries will be temporarily banned from entry, citizens of China, Italy, Iran, South Korea, Spain, Germany, France, the United States, Japan, Belgium, Australia, Norway, Denmark, Sweden and Finland will be banned from entry for two months, citizens of Qatar, Bahrain, UAE, Kuwait, Egypt, Iraq, Lebanon, Saudi Arabia, Algeria, Tunisia and Morocco will be banned from entry for one month. Travelers from other countries must be quarantined at home for 14 days after entry. Those with suspected symptoms will be transferred to designated locations for quarantine.From March 23, the Kassab port on the Syrian-Turkish border has been closed. From March 24, all crossing points have been closed for arrivals from Lebanon, Persons from Lebanon, including Syrian citizens, will be banned from entering, except for cargo vehicle driver who after health check.All international flights to and from Syria will be suspended from March 22."
  },
  {
    "continent": "",
    "iso_alpha2": "SZ",
    "name": "Eswatini",
    "score": "Entry prohibited",
    "updated": "Foreign nationals are prohibited from entering Eswatini until further notice. This policy does not apply to lawful residents."
  },
  {
    "continent": "",
    "iso_alpha2": "TD",
    "name": "Chad",
    "score": "Partially restricted",
    "updated": "From August 1, 2020, all persons traveling to Chad must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Persons intending to remain in Chad more than 7 days must self-isolate for the initial 7 days following arrival and afterwards undergo an additional PCR test for COVID-19. Persons intending to remain less than 7 days must provide their personal information to local authorities for contact tracing purposes."
  },
  {
    "continent": "",
    "iso_alpha2": "TG",
    "name": "Togo",
    "score": "Partially restricted",
    "updated": "All persons arriving at Gnassingbe Eyadema International Airport (LFW) in Lome must carry proof of a negative result for COVID-19 issued no more than 7 days prior to departure using a polymerase chain reaction (PCR) test. Additionally, all persons must submit an Immigration and Health Declaration Form, install the Togo Safe mobile application, undergo an additional PCR test upon arrival, and self-isolate while awaiting their test results. All land border checkpoints are closed until further notice. More information is available at the following URL: https://voyage.gouv.tg<table border=0 cellpadding=0 cellspacing=0 style=width: 505pt; width=673>"
  },
  {
    "continent": "",
    "iso_alpha2": "TH",
    "name": "Thailand",
    "score": "Entry prohibited",
    "updated": "Foreign nationals are prohibited from entering Thailand unless they fall into one of the following categories:1) Persons directly permitted by the Prime Minister or a competent official appointed by the Prime Minister to resolve issues pertaining to a state of emergency in Thailand;2) Persons on diplomatic or consular missions or under the auspices of International Organizations or agencies, or government representatives performing official duties in Thailand to whom the Ministry of Foreign Affairs has given special permission, and their family members;3) Non-Thai nationals who are the spouse, parent, or child of a Thai national;4) Non-Thai nationals who hold a valid certificate of permanent residence in Thailand or who have received permission to reside in Thailand, and their family members;5) Non-Thai nationals holding work permits or who have been granted permission from Thai government agencies to work in Thailand, and their family members;6) Non-Thai nationals who are students at an educational institution approved by Thai authorities (with the exception of non-formal institutions under the law on private schools), and their parents or legal guardians;7) Non-Thai nationals seeking to enter Thailand for medical treatments unrelated to COVID-19;8) Non-Thai nationals permitted to enter Thailand under a special arrangement with a third-country or region, or who have received special permission from the Prime Minister.Persons traveling under categories 2 through 8 must apply for a Certificate of Entry (COE) at a Thai embassy or consulate abroad and obtain a valid Thai visa at least 15 days prior to departing for Thailand. All persons traveling to Thailand (including Thai nationals) must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test and hold medical insurance valid for Thailand with coverage sufficient for any unforeseen medical expenses. All persons arriving in Thailand are expected to comply with all relevant measures to combat the spread of COVID-19. Scheduled commercial flights are currently suspended; however, the Thai government is operating special repatriation flights at regular intervals.The Thai government has suspended entry for persons holding the following categories of visa: tourists visas (TR), transit visas (TS), sports visas (S), visas for monks and other religious visas (R), volunteers (O), and non-formal students visas (such as for language schools, diving schools, and boxing schools)."
  },
  {
    "continent": "",
    "iso_alpha2": "TJ",
    "name": "Tajikistan",
    "score": "Entry prohibited",
    "updated": "From April 8, 2020, foreign nationals are prohibited from entering or exiting Tajikistan. This policy does not apply to diplomats and representatives of international organizations or financial institutions accredited in Tajikistan, or their family members.Persons granted entry to Tajikistan must self-isolate for 14 days under supervision of staff from the Ministry of Health and Social Protection."
  },
  {
    "continent": "",
    "iso_alpha2": "TL",
    "name": "Timor-Leste",
    "score": "Entry prohibited",
    "updated": "From April 4, 2020, foreign nationals are prohibited from entering Timor-Leste. This policy does not apply to persons born in Timor-Leste, resident citizens, legal representatives of minors who are Timorese nationals, persons working on oil rigs in the Timor Sea, and other persons specially designated by the Prime Minister whose entry is considered in the national interest. Persons engaged in the transport of goods must remain within the international zone at all airports, seaports, or land border checkpoints. All persons granted entry to Timor-Leste will be tested for COVID-19. Those testing positive will be placed in quarantine and isolated. All other persons must undergo a 14-day quarantine. All commercial flights are suspended."
  },
  {
    "continent": "",
    "iso_alpha2": "TM",
    "name": "Turkmenistan",
    "score": "Entry prohibited",
    "updated": "From March 20, 2020, all persons (including Turkmen nationals) are prohibited from entering or leaving Turkmenistan. This policy does not apply to diplomats and staff of international organizations, aviation, maritime, or railway crews, international freight drivers, or foreign nationals working in Turkmenistan provided they hold a “health clearance” issued by an authorized medical authority. Such clearance much include the following information in English, Russian, or Turkmen: legal name, gender, age, nationality, passport number, foreign residence address, contact phone number, travel history, date and purpose of entry, local residence address, and test results for COVID-19 issued no more than 24 hours prior to arrival."
  },
  {
    "continent": "",
    "iso_alpha2": "TN",
    "name": "Tunisia",
    "score": "Partially restricted",
    "updated": "From November 16, 2020, all persons arriving in Tunisia must have proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Upon arrival, all persons permitted to enter must undergo a 14-day quarantine at their residence or a designated hotel. Persons who elect to undergo an additional PCR test after 7 days in quarantine will be eligible to leave quarantine early provided they test negative. The Tunisian Ministry of Health may select certain arriving passengers to undergo rapid testing for COVID-19. All persons must comply with these and all other directives relating to testing for COVID-19 upon arrival in Tunisia."
  },
  {
    "continent": "",
    "iso_alpha2": "TO",
    "name": "Tonga",
    "score": "Entry prohibited",
    "updated": "From June 22, 2020, foreign nationals are prohibited from entering Tonga. This policy does not apply to persons who hold a Tongan passport, a valid residency permit, or a valid working visa, or to persons specifically approved by the Tongan Ministry of Health. All persons arriving in Tonga must pass through Tongatapu. Travelers must register with the Ministry of Health Border Control Team and provide the following documentation: a completed Arrival Health Declaration card and a medical clearance form issued no more than 72 hours prior to arrival in Tonga. All persons must undergo a 14-day quarantine in Tongatapu and must comply with all directives issued by the Ministry of Health Border Control Team. All international cruise ships and yachts are prohibited from docking at any Tongan port until further notice. Arrival forms are available at the following URL: https://citizensregistration.gov.to/wp/"
  },
  {
    "continent": "",
    "iso_alpha2": "TR",
    "name": "Turkey",
    "score": "Normal",
    "updated": "Persons arriving in Turkey are subject to health screening for COVID-19."
  },
  {
    "continent": "",
    "iso_alpha2": "TT",
    "name": "Trinidad and Tobago",
    "score": "Entry prohibited",
    "updated": "From March 23, 2020, all border checkpoints are closed and all persons (including nationals) are prohibited from entering Trinidad and Tobago. This policy does not apply to vessels transporting cargo."
  },
  {
    "continent": "",
    "iso_alpha2": "TW",
    "name": "Taiwan, China",
    "score": "Partially restricted",
    "updated": "All non-Taiwanese residents are prohibited from entering Taiwan. This policy does not apply to persons holding an Alien Residential Certificate (ARC), persons holding special approval to enter for reasons other than tourism or regular social visits, persons with permission to enter for approved medical care, or persons holding approval to enter for study (and their companions). Residents of Hong Hong SAR and Macao SAR may apply to enter Taiwan for special humanitarian reasons or emergency situations, to fulfill contractual obligations, as part of internal transfers within multinational enterprises, if they are the spouse or child of a Taiwanese resident and possess a Taiwanese Resident Certificate, for commercial and trade exchanges, or if they hold a Taiwanese Resident Certificate related to employment, investment, or entrepreneurship. Entry permission will be granted on a case-by-case basis. All persons (including Taiwanese residents) granted entry into Taiwan must self-isolate for 14 days. Persons traveling to Taiwan for short-term business purposes may be eligible for shortened self-isolation requirements. In order to apply, travelers must submit documents prepared by the host company in Taiwan comprising a detailed travel itinerary and COVID-19 prevention plans. Exemptions to quarantine requirements will be made on a case-by-case basis at the discretion of relevant authorities in Taiwan.From December 1, 2020, all persons (including Taiwanese residents) must present a certificate showing a negative result for COVID-19 issued no more than 72 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. This policy does not apply persons transiting Taiwan, persons traveling to Taiwan for necessary and short-term official business or business purposes approved by the Taiwan Central Epidemic Command Center (CECC), persons traveling from locations where self-paid COVID-19 tests are not available, and persons traveling for special humanitarian reasons or emergency situations. In all cases of exemption, travelers must sign an affidavit attesting to their purpose and produce supporting documentation. Such persons may be asked to undergo COVID-19 testing at their own expense upon arrival in Taiwan. All persons arriving in Taiwan are required to submit a health declaration via the mobile website of the Quarantine System of Entry prior to boarding flights bound for Taiwan. Confirmation of this declaration is required at entry. Forms are available online at the following URL: https://hdhq.mohw.gov.tw/"
  },
  {
    "continent": "",
    "iso_alpha2": "TZ",
    "name": "Tanzania",
    "score": "Partially restricted",
    "updated": "All persons arriving in Tanzania are subject to enhanced screening for COVID-19. Persons displaying symptoms consistent with COVID-19 are subject to additional testing requirements."
  },
  {
    "continent": "",
    "iso_alpha2": "UA",
    "name": "Ukraine",
    "score": "Partially restricted",
    "updated": "From September 28, 2020, all persons traveling from a country or region classified by the Ukrainian Ministry of Health as green may enter Ukraine provided they carry proof of health insurance valid for use in Ukraine and sufficient to cover any expenses related to observation and treatment for COVID-19. Persons traveling from red locations must install the Dii Vdoma mobile application and do one of the following: 1) undergo quarantine at a designated location, 2) self-isolate for 14 days in a suitable accommodation registered in the Dii Vdoma app, or 3) undergo a polymerase chain reaction (PCR) test for COVID-19 upon arrival in Ukraine. Additional information including a list of persons not subject to quarantine requirements is available at the following URL: https://visitukraine.today/"
  },
  {
    "continent": "",
    "iso_alpha2": "UG",
    "name": "Uganda",
    "score": "Partially restricted",
    "updated": "From October 1, 2020, foreign nationals traveling to Uganda for business or tourism must have proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. All tour operators and domestic hosts shall ensure travelers arriving from abroad do not have contact with local Ugandans. Tourists are required to proceed directly from the airport to their destination or to a designated transit hotel. Ugandan nationals returning from abroad with proof of a negative PCR test result must provide their contact information to the Ministry of Health for contact tracing purposes."
  },
  {
    "continent": "",
    "iso_alpha2": "US",
    "name": "United States",
    "score": "Partially restricted",
    "updated": "Foreign nationals who have visited any of the following countries / regions within 14 days of their arrival in the United States are prohibited from entering: Austria, Belgium, Brazil, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Mainland China, Malta, Monaco, Netherlands, Norway, Poland, Portugal, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland, Vatican City, United Kingdom.All persons returning to the United States from abroad should self-isolate and monitor their health status for 14 days. From March 20, 2020, the United States government has suspended the issuing of new visas. From March 21, 2020, all US land border checkpoints with Canada and Mexico are closed to non-essential traffic. From June 24, 2020, additional restrictions are in place for persons holding special category visas including H-1B, H-2B, J-1, and L-1 visas. Travelers should verify their status with the US Department of Homeland Security prior to making travel arrangements."
  },
  {
    "continent": "",
    "iso_alpha2": "UY",
    "name": "Uruguay",
    "score": "Entry prohibited",
    "updated": "From March 25, 2020, foreign nationals are prohibited from entering Uruguay. This policy does not apply to legal residents, diplomats accredited to the Uruguayan government or to international organizations based in Uruguay, persons engaged in the transport of goods, merchandise, correspondence, supplies, or humanitarian and health aid. From July 6, 2020, all persons permitted entering Uruguay must provide a negative PCR test results with 72 hours prior to their arrival and self-isolate for 7 days after entry."
  },
  {
    "continent": "",
    "iso_alpha2": "UZ",
    "name": "Uzbekistan",
    "score": "Partially restricted",
    "updated": "From October 1, 2020, persons arriving by air from Austria, China, Finland, Hungary, Japan, Latvia, Malaysia, South Korea, or Thailand may enter Uzbekistan without restriction. This policy does not apply to persons currently exhibiting symptoms consistent with COVID-19. Persons arriving by air from Azerbaijan, Belarus, the European Union (with the exception of Spain), or the United Arab Emirates must present a certificate in English or Russian showing a negative result for COVID-19 issued no more than 72 hours prior to departure using a polymerase chain reaction (PCR) test. Persons without such a certificate must undergo testing at the own expense upon arrival. All persons from these locations must undergo temperature screening and a 14-day self-isolation upon arrival. Persons arriving by air from any other location must present a certificate showing a negative PCR test result for COVID-19 and self-isolate for 14 days upon arrival. Persons entering Uzbekistan via land border checkpoints must present a certificate showing a negative PCR test result for COVID-19 and submit a self-isolation questionnaire. Persons without such a certificate must undergo testing at the own expense followed by quarantine. Additional information is available at the following URL: https://uzbekistan.travel/en/o/covid-19-in-uzbekistan/"
  },
  {
    "continent": "",
    "iso_alpha2": "VC",
    "name": "Saint Vincent and the Grenadines",
    "score": "Partially restricted",
    "updated": "All persons arriving in Saint Vincent and the Grenadines must observe strict health control measures upon arrival."
  },
  {
    "continent": "",
    "iso_alpha2": "VE",
    "name": "Venezuela",
    "score": "Entry prohibited",
    "updated": "From March 12, all the country will be in quarantine. All International Flights have been suspended. All travelers have to self-quarantine for 14 days after entry. From July 15, 2020, the Venezuelan government announced the implementation of strict level 1 radical quarantine measures across the country, requiring all citizens to be isolated at home."
  },
  {
    "continent": "",
    "iso_alpha2": "VN",
    "name": "Vietnam",
    "score": "Partially restricted",
    "updated": "Foreign nationals are prohibited from entering Vietnam. This policy provides exemptions for investors, specialists, skilled workers, business managers, persons traveling as part of diplomatic or official missions, persons traveling under special bilateral agreements, and the family members of such persons, provided the duration of their stay in Vietnam does not exceed 14 days. Visitors may apply for an extension beyond 14 days if they undergo testing for COVID-19. All persons traveling to Vietnam must fully comply with local regulations to prevent the spread of COVID-19 and ensure public safety. Travelers should carry international health insurance with coverage valid in Vietnam; otherwise, the local organization sponsoring the traveler is required to cover all costs associated with the treatment for COVID-19 should it become necessary. The sponsoring organization is likewise responsible for all expenses relating to quarantine (if any), transportation, and COVID-19 testing for visitors entering Vietnam at their invitation.From September 15, 2020, the Vietnamese government has approved a resumption of international flights from the following locations: Guangzhou, Phnom Penh, Seoul, Taiwan, Tokyo, and Vientiane. Flights are limited to Vietnamese nationals returning from abroad, foreign investors, experts, business managers, high-tech workers, persons holding diplomatic or official passports, and their family members. All persons (including Vietnamese nationals and persons traveling on diplomatic or official passports) must carry proof of a negative result for COVID-19 issued no more than 72 hours prior to departure using a reverse transcription polymerase chain reaction (RT-PCR) test. Upon arrival, all persons must submit an online health declaration form, plus undergo an additional RT-PCR test and quarantine at a designated location. Health declaration forms are available at the following URL: https://tokhaiyte.vn/"
  },
  {
    "continent": "",
    "iso_alpha2": "VU",
    "name": "Vanuatu",
    "score": "Entry prohibited",
    "updated": "Foreign nationals are prohibited from entering Vanuatu. This policy does not apply to citizens or lawful residents. All border checkpoints are closed and all international flights are suspended. A state of emergency is in effect until at least December 31, 2020."
  },
  {
    "continent": "",
    "iso_alpha2": "WS",
    "name": "Samoa",
    "score": "Entry prohibited",
    "updated": "Until at least July 2, 2020, foreign nationals are prohibited from entering Samoa. All international flights are suspended and all maritime vessels are prohibited from docking at Samoan ports. This policy does not apply to shipments of cargo.Persons seeking to return to Samoa shall be given consideration provided they fall into one of the following categories:(i) returning residents with return tickets;(ii) returning resident students;(iii) persons whose travel permits or visas for New Zealand have expired;(iv) persons providing essential services in Samoa;(v) returning resident patients who travelled overseas for medical purposes;(vi) families with children and persons over the age of 60 years;(vii) returning resident sports teams and seasonal employees with expired employment contracts;(viii) general returning residents (“tagata lautele”);(ix) any other special and relevant ground for travel to Samoa.Prior to departure for Samoa, all persons must quarantine for 14 days and undergo a test for COVID-19 no more than 72 hours prior to departure. Upon arrival, all persons must undergo a 14-day quarantine in Samoa."
  },
  {
    "continent": "",
    "iso_alpha2": "YE",
    "name": "Yemen",
    "score": "Entry prohibited",
    "updated": "From March 17, all air flights from and to all Yemeni airports, all land entrances should be closed except for commercial, relief and humanitarian shipping."
  },
  {
    "continent": "",
    "iso_alpha2": "ZA",
    "name": "South Africa",
    "score": "Partially restricted",
    "updated": "From October 1, 2020, persons in countries or regions considered by South African authorities to have a high rate of COVID-19 infection and transmission are prohibited from entering South Africa. This policy does not apply to countries or regions on the African continent, or to business travelers holding special permission from the Department of Home Affairs. Persons traveling to South Africa must have proof of a negative test result for COVID-19 issued no more than 72 hours prior to departure, or undergo quarantine upon arrival at their own expense. International flights are restricted to the following airports: Cape Town International Airport (CPT), King Shaka International Airport (DUR), and O. R. Tambo International Airport (JNB). More information is available at the following URL: https://sacoronavirus.co.za/"
  },
  {
    "continent": "",
    "iso_alpha2": "ZM",
    "name": "Zambia",
    "score": "Partially restricted",
    "updated": "From July 27, 2020, persons arriving in Zambia must carry proof of a negative result for COVID-19 issued no more than 14 days prior to departure using a polymerase chain reaction (PCR) test. Additionally, they must complete a medical questionnaire and undergo screening for COVID-19. Persons seeking to travel to Zambia may submit a visa application online via the following URL: https://eservices.zambiaimmigration.gov.zm/#/home"
  },
  {
    "continent": "",
    "iso_alpha2": "ZW",
    "name": "Zimbabwe",
    "score": "Entry prohibited",
    "updated": "Foreign nationals are prohibited from entering Zimbabwe. This policy does not apply to lawful residents. All persons entering Zimbabwe must undergo a 21-day quarantine at a designated facility. A nationwide lockdown is in effect and all persons are required to stay at home.]"
  }
]
